{"newsList":[
    {
      "title": "CS3STHLM Newsletter December",
      "author": "Robert Malmgren",
      "category": "news",
      "date": "20 Dec 2017",
      "content_html": "<p><img src=\"/cs3sthlm/assets/cs3-holiday.png\" alt=\"CS3STHLM Holiday\" class=\"full-width-image\" /></p><p>2017 was indeed a remarkable year, and some of the cyber security related things that happened will surely be remembered. Among them was the Wannacry malware hospitals, industrial companies and other important infrastructure. Things that also hit the front pages were outbreak that blindly struck against the analysis of Industroyer/CRASHOVERRIDE (ICS malware attacking Ukraine grid operator) and recently the TRITON/TRISIS/Hatman (attack tool against safety system). In Sweden, IT security incidents led to the resignation of two ministers from the government, and a journalists use of Shodan led to that one of Swedens largest news room had a series of reports on what is Internet accessible, when they found heating/hydropower/windpower/elevators and more, sitting on the Internet for anyone to access.</p><p>The CS3STHLM 2017 summit (previously known as 4SICS) had several presentations related to all these issues. As a holiday gift for you, we have now published a number of presentations on our YouTube channel: <a href=\"https://www.youtube.com/channel/UCkD15o_9eJxUc9eeHtWSQ6Q\">CS3STHLM at YouTube</a></p><p>Next year we will be back for the fifth time and the dates are October 22nd-25th. We are already on the lookout for summit content, so do let us know what you think we should present in order to make next years workshops and conference as useful and rewarding as possible.</p><p>Another holiday gift is that we already have opened the ticket sale for 2018 with a special Earliest Bird discount of 30 % on the two-day conference ticket. Link: <a href=\"https://www.cs3sthlm.se/\">www.cs3sthlm.se</a> and the discounted ticket is available until January 12th.</p><p>A very happy holiday season - from all of us, to all of you! The CS3STHLM crew</p>"
    } ,
  
    {
      "title": "CS3STHLM Presents ICS- and IoT Lab together with Norwegian Energy CERT",
      "author": "Maria Engstrom Ostby",
      "category": "press",
      "date": "04 Oct 2017",
      "content_html": "<p>In the light of growing vulnerabilities, this year’s top summit on Cyber Security in Industrial Control Systems and Critical Infrastructure will give delegates possibilities to partake in real-time simulations and challenges in an updated and bigger ICS lab. The lab is hosted by ROMAB, Norwegian Energy CERT and equipment provided by the Norwegian National Security Authority, NSM. The summit takes place in Stockholm October 24-26.</p><p>This year the lab is declared to be bigger, better and more interesting than ever before with added ICS and ICS communication equipment to the lab. New equipment has resulted in a simulation of communication in industrial control systems with some ICS specific protocols including OPC communication being in progress. It is also extended with a part that is for IoT security. The Internet of things, (IoT), is the network of physical devices, vehicles, and other items embedded with electronics, software, sensors, actuators, and network connectivity which enable these objects to collect and exchange data.</p><p>Margrete Raaum from Norwegian Energy CERT:</p><blockquote>  <p>-”Nothing gives as valuable cyber security learning as real hands-on work. Teaming up with ROMAB to create a dynamic and realistic learning environment is exciting, and we hope this will benefit ICS security engineers all over Scandinavia and beyond”</p></blockquote><p>This year there is a much larger team involved in setting up, running the lab, or have special tasks involving the lab during the conference. The team members include Lars-Erik Smevold of KraftCERT (NO) who will be in charge of the lab, Nicklas Keijser (SE), who is an expert on SCADA/ICS development, Robert Malmgren (SE) of ROMAB, Erik Hjelmvik (SE) of NETRESEC and Mikael Vingaard (DK).</p><p>Robert Malmgren, founder of CS3STHLM and owner of ROMAB elaborates:</p><blockquote>  <p>-”We are honored to have the Norwegian energy sector CERT KraftCERT, as cooperators to ROMAB in setting up this year hosting the ICS and IoT security lab! This is a truly great partnership over the border with our Scandinavian friends in an effort to build competence and relationships for all that strive to secure the society and its critical infrastructure by starting with its fundamentals - the very systems that run our basic functions, like the electrical grid. Thank you to the Norwegian National Security Authority (NSM)  to lending out equipment to the lab”</p></blockquote>"
    } ,
  
    {
      "title": "Advenica announces new collaboration with CS3STHLM",
      "author": "Maria Engstrom Ostby",
      "category": "press",
      "date": "14 Sep 2017",
      "content_html": "<p>The 4th edition of the top international summit on SCADA/ICS and critical infrastructure includes a seminar called ’Effective threat mitigation strategies’ hosted by Advenica. The company is providing new ways in cyber security, protecting critical infrastructures with innovative solutions.</p><p>One of the founders of CS3STHLM, Robert Malmgren, expresses excitement over the collaboration;</p><blockquote>  <p>” This fits perfectly with our profile and we are looking forward to learn about Advenica’s new security solutions.”</p></blockquote><p>Advenica elaborates</p><blockquote>  <p>”Last years have presented an increasing number of bumps in the road for cyber security defenders. The vast number of different attack vectors and the explosion in number of malware variants has made yesterday’s cyber defense strategies obsolete. The goal of cyber security is to ensure robust operation of the defended system – not to find as many pieces of malware as possible. Yesterday’s strategy is efficient at finding malware – but fail in ensuring robust operation”.</p></blockquote><p>CS3STHLM is an international summit that focus entirely on cyber security protection of SCADA/ICS and critical infrastructure. CS3STHLM attracts about 250-300 people from around the world to meet, network and gain knowledge. CS3STHLM takes place October 23-26 at the venue Nalen in central Stockholm.</p>"
    } ,
  
    {
      "title": "CS3STHLM Newsletter September",
      "author": "Robert Malmgren",
      "category": "news",
      "date": "13 Sep 2017",
      "content_html": "<p>The CS3STHLM summit is just a bit over a month away. Today we have speakers from many corners of the earth, and we have already attendees from most continents!  </p><p>We will be at the beutiful venue Nalen in central Stockholm again.  </p><h4 id=\"speakers-and-presentations\">Speakers and presentations </h4><p>We will have presentations on various topics, including:  </p><ul>  <li>how security impact safety</li>  <li>how to sucessfully roll out cyber security policies at multinational corporations  </li>  <li>Security (or the lack thereof) in IoT  </li>  <li>First hand accounts of the ongoing Ukraine cyber attacks  </li>  <li>New, secure, protocols for SCADA/ICS  </li>  <li>Lessons learned from handling an enourmous APT at a critical infrastructure provider</li>  <li>Learn about tricks and defense in Social Engineering  </li></ul><p>As always we will have a mix of attack and defence stances, between technology and policy level, between theory and real-dirt-under-your-nails practise. We will continue the tradition from 4SICS to use multiple stages, and presentations will be done in different formats – a main stage, a TV studio setup for more intimate atmosphere and dialogues, and an impromptu stage in GeekLounge for improvised presentations (lightning talks, work in progress presentations, etc).  </p><p>View speaker info here - <a href=\"https://cs3sthlm.se/program/speakers/\">/speakers</a></p><p>View info on presentations here - <a href=\"https://cs3sthlm.se/program/presentations/\">/presentations</a></p><h4 id=\"workshops\">Workshops </h4><p>We are fortunate to have three excellent pre-conference trainings/tutorials:  </p><ul>  <li><a href=\"https://cs3sthlm.se/program/workshops/erik-hjelmvik/\">Network Forensics (2 day) </a></li>  <li><a href=\"https://cs3sthlm.se/program/workshops/mikael-vingaard/\">Practical SCADA/ICS Honeypots (1 day) </a></li>  <li><a href=\"https://cs3sthlm.se/program/workshops/michael-theuerzeit/\">Cyber Security for Industrial Automation and Control Systems: An introduction of the IEC 62443 standard (1 day) </a></li></ul><p>Tickets for all different workshops are available now. Please remember that one workshop is 2 day and the others are 1 day. If you select the 2 day workshop, make sure that you arrive and can start monday morning!  </p><h4 id=\"security-lab-ics-and-iot\">Security lab: ICS and IoT </h4><p>This year we will have a larger and more professional ICS security lab in place. Besides the number of equipment available, we will also help interested attendees to better play with it at their level of knowledge. Beginners will find help to do basic probeing and pokeing at exotic devices. Intermediates will be able to do more advanced experiments with bugs. Experts will be able to participate in winning prices if they submit newly found vulnerabilities to the CERT representatives at the conference.</p><p>This year we will also introduce an IoT security lab where people can play around with SOHO equipment, lightbulbs with IP addresses, embedded devices, etc.  </p><h4 id=\"practical-things\">Practical things </h4><p>We still have rooms left in the block with discounts that we negotiated with the hotel closest to the venue. We want to inform you that rooms are going quickly and the cut-of-date for when the discount is no longer available is less than two weeks away. Dont miss out on having this!  </p><p>Info on venue, dates, airports, subways, hotels, etc can be found at the info web here:  <a href=\"https://cs3sthlm.se/practical-details/\">/practical-details</a></p><h4 id=\"historic-presentations\">Historic presentations </h4><p>To get a taste of what the summit is, you can find old presentations from 2015 and 2016 on <a href=\"https://www.youtube.com/channel/UCkD15o_9eJxUc9eeHtWSQ6Q\">youtube/cs3sthlm</a></p>"
    } ,
  
    {
      "title": "CS3STHLM Newsletter June",
      "author": "Robert Malmgren",
      "category": "news",
      "date": "13 Jun 2017",
      "content_html": "<p>Outline of this short newsletter</p><ul>  <li>CFP work</li>  <li>Announced speakers</li>  <li>Technical Trainings</li>  <li>Social events</li>  <li>Early Bird tickets</li>  <li>Venue</li>  <li>Conference Hotel</li></ul><p>We want to share some info about the recent development.</p><p>We will carry on the tradition from when we where called 4SICS - to be a leading international conference on SCADA, ICS and critical infrastructure cyber security! We will have multiple stages with the best international speakers and trainers, having excellent social activities and provide hard-to-earn knowledge, no matter if it is deeply technical matters, sucessful solutions or policy briefs.</p><p>In the program comittee, we are working with the submissions that we have received as the CFP closed. We have alot more submissions than available speaker slots! And still not all slots are for submitted proposals, but we have reserved some slots for invited speakers as well. Thus it is really hard to make the selection this year.</p><h3 id=\"announced-speakers\">Announced speakers</h3><p>We have announced a couple of speakers already, especially since they are related to investigations into the recently unveiled industroyer/CRASHOVERRIDE malware:</p><ul>  <li>Joe Slowik of Dragos Inc (US), who will speak on “Strategic Network Defense in ICS Environments”</li>  <li>The ESET team (SK) who have a presentation on “Industroyer: biggest threat to industrial control systems since Stuxnet”</li></ul><p>We will have a special panel on the Ukraine 2016 event with detailed discussion, where both the ESET and Dragos specialists will attend. We plan to add more experts to this discussion.</p><p>More speakers will be announced in the weeks to come, including keynote speakers!</p><h3 id=\"technical-trainings\">Technical trainings</h3><p>We will have a number of technical trainings related to network forenics, honeypots, hacking, etc.</p><ul>  <li>Erik Hjelmvik of Netresec (SE) will have a 2 day Network Forensic class</li>  <li>Mikael Vingaard (DK) will have a 1 day Honeypot class</li></ul><p>Thus, with the addition of 2 day training classes, the pre-conference activity will start already on the 23rd of october!</p><h4 id=\"social-events\">Social Events</h4><p>We will have a welcome reception on the evening of the 24th and a conference dinner on the 25th.</p><h3 id=\"early-bird\">Early Bird</h3><p>A reminder - the early bird prices are until 30 of June! You will find the ticket site here: <a href=\"\">https://tickets.4sics.se/sales/</a> or from the main CS3STHLM web page.</p><h3 id=\"venue\">Venue</h3><p>As per the last 2 years, we will be in wonderful Nalen, in the heart of Stockholm. You will find information and directions at <a href=\"https://cs3sthlm.se/practical-details/\">/practical-details</a></p><h3 id=\"conference-hotel\">Conference hotel</h3><p>We have a special arrangement with Elite Palace Hotel located just ~200 meters away from the venue. Use this link to get our special discount when booking <a href=\"https://www.elite.se/en/conference-reservations/stockholm/e1a64817-7910-4517-bff8-d94ea2e28ed5/\">Elite Conference Reservation</a></p><p>–Until the next news letter,</p><p>Best wishes from the whole CS3STHLM team</p><p><img src=\"/cs3sthlm/assets/news/cyber.jpg\" alt=\"Cyber\" class=\"full-width-image\" /></p>"
    } ,
  
    {
      "title": "Malware that can knock out power grids discovered",
      "author": "Maria Engstrom Ostby",
      "category": "press",
      "date": "13 Jun 2017",
      "content_html": "<p>Researchers from Slovakian Anti Virus company ESET have publicized information on malware especially targeted for automation in power grids. The malware is tied to an attack in Ukraine 2016. ESET have worked alongside researchers from another company, Dragos, to analyze the code. Investigators from ESET and Dragos will come to Cyber Security Summit CS3STHLM in Stockholm in October to present and discuss their findings.</p><p>Robert Lipovski, one of the researchers at ESET, states in Washington Post:</p><blockquote>  <p>“The potential impact of malware like this is huge. It’s not restricted to Ukraine. The industrial hardware that the malware communicates with is used in critical infrastructure worldwide.”</p></blockquote><p>This malware is called the most dangerous code since Stuxnet, malware discovered in 2010 aimed specifically towards Iran’s nuclear program.</p><p>Robert Malmgren, owner and co-founder of CS3STHLM:</p><blockquote>  <p>” The fact that this malware can be used and re-used in critical infrastructure everywhere makes it an enormous threat to non protected Industrial Control Systems.”</p></blockquote><p>CS3STHLM takes place at Nalen in Stockholm October 24-26.</p><p>www.cs3sthlm.se</p><p>For more information regarding the malware, please contact</p><p>Robert Malmgren</p><p>Phone: +46 708 33 03 78</p>"
    } ,
  
    {
      "title": "CFP - DON'T MISS OUR DEADLINE",
      "author": "Robert Malmgren",
      "category": "news",
      "date": "08 May 2017",
      "content_html": "<p>To show how seriously we take all parts of the CS3STHLM summit we have sent one team member to Carrara, Italy, in order to actually carve the prize for Best Presenter in white marble. If it turns out nicely you will be able to see, and maybe accept, the piece at CS3STHLM summit in October. If it fails you won’t.</p><h3 id=\"we-want-your-submission-for-presentation-or-workshop-by-may-31\">WE WANT YOUR SUBMISSION FOR PRESENTATION OR WORKSHOP BY MAY 31</h3><p><a href=\"mailto:cfp@cs3sthlm.se\">cfp@cs3sthlm.se</a></p><p><img src=\"/cs3sthlm/assets/news/marble-one.jpg\" alt=\"Marble One\" /> <img src=\"/cs3sthlm/assets/news/marble-two.jpg\" alt=\"Marble Two\" /></p>"
    } ,
  
    {
      "title": "Cyber Security Summit 4SICS Relaunches as CS3STHLM",
      "author": "Maria Engstrom Ostby",
      "category": "press",
      "date": "21 Apr 2017",
      "content_html": "<p>Due to a conflict of interest regarding the name SICS between the summit 4SICS and Swedish Institute of Computer Science, Omnisiens announces the fourth summit to be arranged under the new name CS3 STHLM. Three CS stand for Cyber Security, Control Systems and Critical Structures, and STHLM is an official acronym for Stockholm. CS3 STHLM takes place in Stockholm this October 24-26.</p><p>Top level cyber security experts from all over the world will gather again in the old concert venue Nalen in Stockholm for the internationally acclaimed summit. Owners of arranging company Omnisiens, Swedish cyber security experts Erik Johansson and Robert Malmgren, state:</p><blockquote>  <p>-”We changed the name because we had to, but we are convinced our target group will find us, and that it won’t be such a big deal. Ticket sales are up and running, and we look forward to presenting yet another exciting mix of speakers and topics.”</p></blockquote><p>Interest for the summit is expected to escalate while awareness of hacker attacks and vulnerabilities in IoT (Internet of Things), rises.</p><p>Tickets are on sale with an early bird price until June 30.</p><h3 id=\"facts-cs3sthlm\">FACTS CS3STHLM</h3><p>CS3STHLM is hosted by Omnisiens, owned by Swedish Cyber Security Experts Robert Malmgren; voted number one IT security specialist in Sweden in trade magazine Computer Sweden and Erik Johansson, PhD; Security Researcher, Advisor, and Contractor working at the intersection of Information Technology (IT) and Operational Technology (OT)</p><p>Key note speakers previous years:</p><ul>  <li>2014 Stefan Lüders, Head of Computer Security at CERN</li>  <li>2015 Kim Zetter, editor at Wired Magazine and author of the book Countdown to Zero Day</li>  <li>2016 Robert M Lee, SCADA expert who was one of the investigators of the attack on Ukraine</li></ul><p>Selected topics from previous years, among ca 12-20 per year:In depth analysis of the attacks against Ukraine with Robert M Lee from Dragos and Anton Cherepanov together with Robert Lipovsky from anti virus company ESET who presented a thorough walk through of what is known about the virus ”Black Energy”, which was used against power companies in Ukraine.</p><p>Internet of Things; John Matherly, creator of Shodan, called the world’s most dangerous search engine leads a discussion of escalation of IoT with a number of the world’s leading experts on the subject.</p><p>Hackable pacemakers discussed by scientists Marie Moe and Eireann Leverett, they present weaknesses and possible threats against Moe’s own pacemaker. A kind of threat that led Dick Cheney, previous Vice President of The US, to discountct his pacemaker from the Internet to avoid being targeted by hackers.</p><p>The summit’s moderator is since the start Anne Marie Eklund Löwinder, AMEL, Head of Security at IIS, The Internet Foundation in Sweden, and one of seven crypto officers in the world with a key to the Internet root zone.</p>"
    } 
  
]}