{"newsList":[
    {
      "title": "CS3STHLM App and Honey Pot Competition",
      "author": "CS3STHLM Crew",
      "category": "news",
      "date": "22 Oct 2018",
      "content_html": "<h3 id=\"cs3sthlm-launches-conference-app\">CS3STHLM LAUNCHES CONFERENCE APP</h3><p>When the conference opens for the 5th consecutive year participants can download an app with agenda, presentations of speakers, and the possibility of partaking in polls, give direct response to seminars, lectures and questions asked from stage. This also means a channel for newsflashes, changes in the program and messages from conference management. You find the app in usual app stores.</p><h3 id=\"honey-pot-chase-competition\">HONEY POT CHASE COMPETITION</h3><p>Mikael Vingaard, (DK), invites all participants to a competition to find Honey Pots: Can you spot the honey-pot(s) @ the ICS Lab? - challenge yourself and find the honey-pot(s) hidden - submit your findings and win a prize!</p><h4 id=\"spot-the-honey-pot---the-rules-of-engagement\">“Spot the Honey-pot” - The rules of engagement;</h4><p>Competition starts 24.oct Wednesday at 10.00 am and ends Thursday at 14.30.</p><p>The winner will be announced during the closing session, and need to be in the audience during the closing session.Use whatever tools (e.g. telnet, nmap, PLCscan etc) to find the honeypot(s), we have placed @ the ICS Lab industrial networks!Be a good ICS neighbor, don’t try to change the configuration on anything, DDOS’ing or otherwise break stuff on purpose - or in any way make the competition harder for your fellow contesters.</p><p>You may work together as a team, but only one prize is rewarded.</p><p>To keep things interesting, we will change the Honeypot environment, during the whole CS3sthlm conference.There might be many honey-pots hidden - and not only on one single ICS networks - so do remember to look at ICS_Lab network 1 to 4.In case, that several contesters gets the same (correct) reply - there will be a drawing, to find the winner.</p><p>To participate, do send an email with the following to stockholm@defenica.com before Thursday 14.30 :</p><p>a) Your name</p><p>b) time of your research - aka. the date+ Hour as we will dynamically change the honeypot(s) during CS3.</p><p>C) IP’s of the honeypots you have spotted - do remember to write on what ICS_LAB network it was found, e.g. IP x.x.x.x on ICS network 4 + IP z.y.y.y on ICS network 2</p><p>GPDR stuff; the information collected during “Spot the Honeypot” will only be used for this competition.</p><p>May the best honey-pot spotter win :-)</p>"
    } ,
  
    {
      "title": "CS3STHLM fifth conference on industrial cyber security",
      "author": "Maria Engstrom Ostby",
      "category": "press",
      "date": "18 Oct 2018",
      "content_html": "<p>CS3STHLM FIFTH CONFERENCE ON INDUSTRIAL CYBER SECURITY ADDRESSING THREATS AND POSSIBILITIES IN A GROWING DIGITAL ENVIRONMENT</p><p>With tickets almost sold out, arranging Omnisiens are looking forward to a successful meeting for leading cyber security experts from around the world. CS3STHLM takes place in Nalen, Stockholm, October 22-25.</p><p>Regrettably first day keynote speaker, Marty Edwards (US), has had to cancel due to personal reasons.</p><p>Organizer Robert Malmgren from Omnisiens:</p><blockquote>  <p>”- It’s unfortunate that Marty Edwards had to cancel at such short notice, but we feel confident that our replacement will complement our diverse agenda.” New keynote speaker for the first day will be Mark Bristow (US).</p></blockquote><p>The fifth edition of the acclaimed conference includes a formidable list of renowned speakers, and in addition to seminars and workshops there will be an complementary expo day on Tuesday the 23rd for companies and organisations within this field. The Expo day is free of charge but entrance require registration.</p><p>Erik Johansson from Omnisiens:</p><blockquote>  <p>”- The Expo is not only a great opportunity to network and discuss the market field for interested parties, but will also consist of exciting demonstrations and presentation from researchers and vendors.”</p></blockquote><p>Highlights from the program:</p><ul>  <li>Recent APT Campaign targeting Energy Sector Assets, John Homer (US)</li>  <li>Hunting and Responding in ICS, Ben Miller &amp; Mark Stacey, (US)</li>  <li>Unblockable Chains - Is Blockchain the ultimate malicious infrastructure?, Omer Zohar (IL)</li>  <li>ICS Incident Response: Lessons and mitigations from the field, Mark Bristow (US)</li>  <li>Attacking Cars Revisited: On the Road Towards a More Resilient Connected Vehicle Infrastructure, Kai Thomsen (DE)</li>  <li>Supply Chain Cyber Security throughout the ICS Lifecycle, Erik Zouave (S)</li></ul>"
    } ,
  
    {
      "title": "Ola Hermansson - Technical Operations Manager",
      "author": "CS3STHLM Crew",
      "category": "blog",
      "date": "15 Oct 2018",
      "content_html": "<p><em>This is a blog post with Ola Hermansson, one of the guys in our great crew.</em></p><h1 class=\"blog-title\" itemprop=\"name headline\">Ola Hermansson - Technical Operations Manager</h1><h4 id=\"what-is-your-name-where-do-you-work-and-what-is-your-profession\">What is your name, where do you work and what is your profession?</h4><p>My name is Ola Hermansson. I’m an audio engineer by trade, and work with stage craft and engineering on TV-productions, concerts and corporate events. Where I work? Everywhere…</p><h4 id=\"for-how-many-years-have-you-been-involved-in-this-conference\">For how many years have you been involved in this conference?</h4><p>Hmmm, “As time goes by” (like Sam sung in Casablanca). This years conference is my fourth i believe. My first CS3 (then 4SICS)-experience was in 2015.</p><h4 id=\"how-did-you-get-involved-in-this-both-with-your-profession-and-with-this-event\">How did you get involved in this, both with your profession and with this event?</h4><p>My profession is a life-long love story (the cliché “I started out as a child” comes in handy…). Regarding me getting involved with the good people at CS3, I think it was my colleague Anders Hagström that was given the opportunity to work with the event, and asked me to join the team.</p><h4 id=\"what-is-your-role-during-the-conference\">What is your role during the conference?</h4><p>I manage and run the technical operations when we’re “live” (so to speak). My main target is to keep the show running smooth (out of a technical perspective) and keeping the keynote speakers happy, giving them the best possible platform to perform on stage.</p><h4 id=\"you-normaly-travel-the-world-with-rock-stars-and-tv-celebrities-so-this-must-be-the-complete-contrast-or\">You normaly travel the world with rock stars and TV celebrities, so this must be the complete contrast, or?</h4><p>I would like to think quite the opposite. The tools we use during CS3 is much the same as we use in a TV- or concert-production. Except the rock stars are PhD’s and the TV-cameras are fewer.</p><h4 id=\"is-it-a-marathon-race-a-100-meter-race-or-something-else-to-do-this-kind-of-job\">Is it a marathon race, a 100 meter race, or something else to do this kind of job?</h4><p>That kind of depends of your position in a production. In this particular case, I come into play when much of the “marathon-like” work is done. For me it’s more like a 100 meter race, for one intense week. Of course there’s a lot of pre production on the technical side of things as well, but the intense part of the work takes place the last days just before a production (when we set things up) and during the show. One cool thing about working live production, is that you really only get one chance to get it right.</p><h4 id=\"what-is-the-biggest-challenges-that-you-see\">What is the biggest challenges that you see?</h4><p>Beating people’s expectations year after year, that’s a big challenge.</p><h4 id=\"what-is-your-best-memories-from-the-previous-conferences\">What is your best memories from the previous conferences?</h4><p>Hmmm, Lot’s off goodies - but Jenny Radcliffe’s “Tales of a people Hacker” in 2017 was really intriguing. Also, for a techie like me, the GeekLounge in the basement is a really cool place as well (even though the technical level of the stuff going down there is kind of above my pay-grade :)</p><h4 id=\"what-do-you-look-forward-to-with-this-years-event\">What do you look forward to with this years event?</h4><p>Working at Nalen (the Venue) is always super cosy, I really like that place. This year will also feature an expo (taking place the day before the actual conference starts) - this means some new challenges for us production-wise, that I’m kind of looking forward to dealing with. It’s gonna be exciting.</p><h4 id=\"any-last-words-of-advice-to-our-readers-and-the-attendees\">Any last words of advice to our readers and the attendees?</h4><p>I don’t know. Buy a ticket. Show up. Stay geek?</p>"
    } ,
  
    {
      "title": "Anton Shipulin - Kaspersky Lab",
      "author": "CS3STHLM Crew",
      "category": "blog",
      "date": "15 Oct 2018",
      "content_html": "<p><em>This is a blog post with Anton Shipulin, a global presales manager at Kaspersky Lab.</em></p><h1 class=\"blog-title\" itemprop=\"name headline\">Anton Shipulin - Kaspersky Lab</h1><h4 id=\"what-is-your-name-where-do-you-work-and-what-is-your-profession\">What is your name, where do you work and what is your profession?</h4><p>My name is Anton Shipulin I work for Kaspersky Lab at the headquarter, as a global presales manager in Kaspersky Industrial CyberSecurity (KICS) business development team. I am responsible for various things like promoting our technologies and expertise, market, technologies, and research intelligence, advising product development, building and improving presale processes and resources, heading Kaspersky ICS conference program committee, and many others.</p><p>Besides that, I am a co-founder of international Russian-speaking ICS Cyber Security community <a href=\"https://www.ruscadasec.com/\">RUSCADASEC</a> and Industrial Cybersecurity Center (CCI) coordinator for Russia. All of these is because I have been a big fan of industrial cyber security topic for about 10 years and keen to help people to increase industrial cybersecurity posture.</p><h4 id=\"have-you-been-to-cs3sthlm-4sics-before-have-you-been-to-stockholm-before\">Have you been to CS3sthlm (4SICS) before? Have you been to Stockholm before?</h4><p>No! It is my first time at CS3sthlm and in Sweden! I am very excited to come this year as I’ve been following the conference for years and believe it is one of the best ICS security conferences, and doubly happy to be here with our Kaspersky ICS team as a sponsor to share our industrial cybersecurity expertise! Thank you for the long-standing quality!</p><h4 id=\"this-area-protection-of-critical-infrastructure-what-makes-it-so-interesting-do-you-think\">This area, protection of critical infrastructure, what makes it so interesting do you think?</h4><p>What amazed me when I was studying cybersecurity at the university was how close had become a physical and cyber world. That pushing a button remotely you can negatively impact the physical process. Years have passed since then and we see that those worlds have become even closer, big cyber-physical incidents happened, lots of researchers are done every year all over the world proving that despite specific of ICS and processes, they can be hacked with sufficient resources. It scares</p><h4 id=\"what-will-you-present-or-demo-in-the-ics-security-lab\">What will you present or demo in the ICS Security Lab?</h4><p>We will bring two demo modes to the lab: Gasoil discharge rail tank stand and Anomaly detection on the IoT stand, and our industrial cybersecurity researchers who want to look at and evaluate the security posture of the presented industrial equipment in the Lab and test possible cyber-physical attack scenarios.</p><p>Gasoil discharge rail tank stand shows several targeted attack scenarios that could happen to industrial infrastructure on an example of oil and gas industry. The model represents a rail tank discharge rack that is used for offloading of oil into storage tanks. The sample attack scenarios (including «Process STOP», «Buffer tank overflow» and «Impacting pump operation») demonstrate how hypothetical hacker can impact or sabotage the operation of the rail tank discharge process. At the stand (comprising of an industrial programmable logic controller, physical process representation and two industrial workstations protected by Kaspersky Industrial Cybersecurity) you can see sequential stages of cyberattack, possible outcome and counteracting reaction of protection mechanisms based on Kaspersky Industrial Cybersecurity.</p><p><img src=\"/assets/news/anton-shipulin/image-01.png\" alt=\"alt text\" /><img src=\"/assets/news/anton-shipulin/image-02.png\" alt=\"alt text\" /></p><p>Anomaly detection on the IoT stand simulates attempted attacks on typical elements of IoT infrastructure, such as gateways and devices (e.g. an IP camera), which are connected to a local network. IoT devices such as various controllers, sensors, cameras, are widely used in industrial organizations to collect and analyze data about manufacturing processes and to automate procedures. On the stand, you can see how IoT devices (an IP camera in this case) can be easily manipulated by an intruder. The intruder steals video data from the camera by creating a second video stream that is then connected to a criminal’s notebook. IoT gateways can be vulnerable to attempts to run a malicious code on them and to illegitimately change the firmware. These scenarios can be stopped with the Kaspersky IoT Security solution. The solution consists of several components, including Machine Learning Anomaly Detection that reveals anomalies in devices behavior; Linux Application Control (LAC), that blocks the launch of suspicious code that are not in the secure “White List”. This is accomplished via a connection to Kaspersky Lab intelligence services through the Kaspersky Security Network - ensuring a fast response. A program called Secure Boot blocks the launch of illegitimate software; and another solution, Secure Update, prevents a device from being updated with illegitimate version of software.</p><h4 id=\"will-there-be-any-new-products-or-services-that-you-are-rolling-out\">Will there be any new products or services that you are rolling out?</h4><p>On Gasoil discharge oil tank demo we show how our solution - Kaspersky Industrial Cybersecurity – reacts on the different ICS attacks. Basically, Kaspersky Industrial CyberSecurity is a portfolio of technologies and services designed to protect operational technology layers and elements of industrial enterprises – including SCADA servers, HMIs, engineering workstations, PLCs, network connections – without impacting on operational continuity and the consistency of industrial process. I would give a more detailed an overview of our approach to  Industrial Cybersecurity at the expo talk.</p><h4 id=\"there-has-been-some-publication-about-the-kaspersky-secure-ics-operating-system-what-is-the-current-status-of-that\">There has been some publication about the Kaspersky secure ICS operating system. What is the current status of that?</h4><p>It is not only an operating system. Kaspersky Lab provides three closely related technologies: KasperskyOS, Kaspersky Security System for Linux and Kaspersky Secure Hypervisor. All these solutions have outstanding security capabilities due to dedicated security engine - Kaspersky Security System, capable to specify diverse security properties in a higher level way.</p><p>KasperskyOS has already been successfully used in network appliances and other specialized solutions, and the major features of upcoming release are hard real-time support and support of CODESYS PLC runtime from 3S company, thus making KasperskyOS an ideal platform for PLC, where security matters.</p><p>To harden existing Linux-based PLCs, there is a Kaspersky Security System for Linux - a product, based on the security engine and Linux containers technology. It allows to isolate components of different trust levels and enforce specified security properties. As an example of a solution based on this technology, there is an Embedded Security Shield from BE.Services, providing protected version of CODESYS runtime, which was separated into two parts (communication and core), and flexible and secure way to operate the PLC, constraining undesired behavior.As to Kaspersky Secure Hypervisor (KSH), it is a type 2 virtualization solution, which uses KasperskyOS as a host operating system and provides extended set of security services and guaranties. KSH enables seamless integration of COTS products, like SCADA, available at the market, with the security hardening mechanisms implemented in KasperskyOS. Practical use cases include access control for HW peripherals, additional independent authentication procedures, control and authorization of guest user and SW operations in accordance with security policies, defined for the solution as a whole, secure boot, update and audit available out of the box and many others. It should be specially noted, that KSH makes possible to harden the solution with a strong, state of the art cryptography implemented at the level of KasperskyOS, and it does not require any modifications of guest software at all. Along with the mentioned above KSH provides easy to use and transparent way to implement Trusted Execution Environment (TEE) that is also a high demand feature. Currently Kaspersky Lab has successful experience in combining the KSH technology both with other company products like KICS, and with third-party solutions like PcVue SCADA from ARC Informatique.Besides direct application to ICS solutions and products, KasperskyOS may be used to support ICS infrastructure in networking equipment - to secure communications, as well as Kaspersky Secure Hypervisor may be used for hardening of other ICS infrastructure components like DB servers.</p><p>The plans for the nearest future include extending the set of supported usage scenarios and further integration with Kaspersky Lab services and technologies, like Kaspersky Security Network (KSN), Kaspersky Security Center (KSC) and many others.</p><h4 id=\"what-is-the-current-state-of-ics-security-in-the-markets-where-kaspersky-is-operating-are-the-customers-well-aware-of-the-threats-do-they-have-good-protection-in-place\">What is the current state of ICS security in the markets where Kaspersky is operating? Are the customers well aware of the threats? Do they have good protection in place?</h4><p>Good question, to find an answer to that, besides all of our projects at our client’s facilities, we conduct global researches, surveying people, analyzing data from our endpoints and networks sensors. We publish those reports regularly. Readers can find the latest version here <a href=\"https://ics.kaspersky.com/the-state-of-industrial-cybersecurity-2018/\">The State of Industrial Cybersecurity 2018</a> and here <a href=\"https://ics-cert.kaspersky.com/reports/2018/09/06/threat-landscape-for-industrial-automation-systems-h1-2018/\">Threat landscape for industrial automation systems: H1 2018</a>. Some highlights from them are on the pictures below. Our practice with our clients mostly proves it</p><p><img src=\"/assets/news/anton-shipulin/image-03.png\" alt=\"alt text\" /><img src=\"/assets/news/anton-shipulin/image-04.png\" alt=\"alt text\" /></p><h4 id=\"will-the-attendees-be-able-to-test-test-drive-hack-or-play-with-any-of-the-devices-and-demos-that-you-will-have-on-display\">Will the attendees be able to test, test drive, hack or play with any of the devices and demos that you will have on display?</h4><p>Absolutely, our equipment described above will be open for exploring and researching during the conference in the Lab for the attendees, and our Kaspersky Industrial Cybersecurity security solutions will be connected to the lab network to analyse process traffic and attacks and demonstrate security capabilities.</p><h4 id=\"kaspersky-have-launched-an-ics-cert-how-long-have-it-existed-what-are-the-objectives-with-that-and-is-it-working-on-any-interesting-projects\">Kaspersky have launched an ICS CERT. How long have it existed, what are the objectives with that, and is it working on any interesting projects?</h4><p>Kaspersky Lab ICS CERT is a research and awareness project launched by Kaspersky Lab at the end of 2016. The main objectives are to share KL expert knowledge on cyber threats affecting industrial organizations, to continuously identify major cybersecurity weaknesses and bottlenecks in ICS products and technologies and to coordinate community efforts to eliminate them. Since the launch of the project, KL ICS CERT experts have found and reported more than 165 0-day Vulnerabilities in various ICS, IoT, Automotive vendors’ products, and technologies wide-spread in the industry, some affecting hundreds of products on the market. KL ICS CERT researchers keep their eye on cyberattack campaigns, targeting industrial organizations in various countries all over the globe, notifying subscribers of the threat discovered.  Security analysts are working with various international regulation bodies to bring Kaspersky Lab threat landscape knowledge and security expertise for the benefit of the new standards and recommendations being developed. KL ICS CERT experts provide awareness trainings for OT personnel and extensive deep dive expert-level exercises for IT security specialists as their way to share KL expertise and knowledge on how to make industrial enterprises more secure.</p><h4 id=\"what-do-you-see-as-the-biggest-challenges-in-the-ics-security-area\">What do you see as the biggest challenges in the ICS security area?</h4><p>There are lots of challenges we all know due to increasing connectivity everything to everything and amounts of data in the industrial systems, as result people have to process lots of information simultaneously. But people are not perfect at big (including security) data processing, they fail every time due to violations, mistakes, fatigue, losing vigilance. Therefore I see a lack of maturity and automation cybersecurity processes as the biggest problem in the ICS security. That is what we all should work on!</p><h4 id=\"what-are-you-looking-forward-to-with-this-years-cs3sthlm\">What are you looking forward to with this years CS3sthlm?</h4><p>Showcase and share our expertise, meet and discuss with world class experts, learn new stuff and get new ideas, learn how to make great ICS security conference to use it to make our Kaspersky ICS security conference better!</p><h4 id=\"what-would-be-you-advice-to-our-readers-and-attendees\">What would be you advice to our readers and attendees?</h4><p>Never stop learning, stay open-minded, strengthen the global ICS security community with your expertise! Keep [ or start ] attending the great CS4STHLM event, and do come to meet our Kaspersky Industrial CyberSecurity team all over the conference!</p><p>Follow usKaspersky ICS Team: <a href=\"https://twitter.com/KasperskyICS\">@KasperskyICS</a>Anton Shipulin: <a href=\"https://twitter.com/shipulin_anton\">@Shipulin_Anton</a></p>"
    } ,
  
    {
      "title": "Kai Thomsen - Senior Incident Responder",
      "author": "CS3STHLM Crew",
      "category": "blog",
      "date": "26 Sep 2018",
      "content_html": "<p><em>This is a blog post with Kai Thomsen, a senior incident responder at AUDI AG.</em></p><h1 class=\"blog-title\" itemprop=\"name headline\">Kai Thomsen - Senior Incident Responder</h1><h4 id=\"what-is-your-day-job-where-are-you-working-and-what-do-you-do\">What is your day job, where are you working and what do you do? </h4><p>I am a senior Incident Responder at AUDI AG. My office is in Ingolstadt at Audi’s headquarters, but takes me where ever we have to investigate. Currently we a building up a joint Enterprise/ICS/Car cyber defense team. This means learning about and integrating three sometimes very different mindsets. Quite a challenge, but I’m convinced that we won’t be very successful without these integrated teams. I also teach for SANS in the ICS curriculum. And since we are a small team, I get to teach all over the world, which is at the same time interesting and challenging considering all the different countries and cultures I get to teach in.</p><h4 id=\"for-how-long-have-you-worked-in-the-field\">For how long have you worked in the field? </h4><p>Computers and hacking have been kind of my thing since I was thirteen. After university, in 2001, when I finally had to get a real job, I got started as a network admin tasked with passive security (firewalls, IDSses, etc.) and then moved on to what nowadays is called active defense, mainly Network Security Monitoring and Incident Response. When Stuxnet hit in 2010 and caused a lot of headache for us at the company I was working at back then I started to focus more on ICS security.</p><h4 id=\"you-give-classes-as-a-technical-trainer-for-icsscada-security-do-you-see-a-lot-of-interest-in-these-issues\">You give classes as a technical trainer for ICS/SCADA security, do you see a lot of interest in these issues? </h4><p>I teach the “ICS Active Defense and Incident Response” course at SANS (ICS515). And we have definitely seen interest increasing in this and other ICS courses over the last year. When I look at the current threat landscape, this was absolutely necessary. We need a lot more knowledgable and capable active defenders to secure our critical infrastructures and industries.</p><h4 id=\"have-you-ever-destroyed-a-car-or-something-physical-as-part-of-what-you-do-in-your-day-work\">Have you ever destroyed a car, or something physical, as part of what you do in your day work? </h4><p>Well, yes, but keep in mind, I am an incident responder, not I researcher so my main mantra especially in ICS/SCADA environments is to always put safety and reliability of operations first. But as probably anyone who as worked on many incidents I have my own stories to tell about devices and thus evidence I destroyed because of a stupid mistake I made.  With regard to what you are probably more interested in, do I crash vehicles with my mad cyber skills, that’s a) not how this works and b) the job of our dedicated Car/IT Security team.</p><h4 id=\"what-is-the-hype-in-relation-to-cyber-security-and-vehicles\">What is the hype in relation to cyber security and vehicles? </h4><p>In my opinion the hype is in the way current research gets reported vs. what current threats against vehicles actually are. Most organized crime around vehicles is about stealing vehicles or spare parts. Of course this is not as sexy for a story than say hackers taking over autonomous vehicles. If you’d like to get my full view on this, come to my talk ;-)What is the biggest challenges to automotive area with regards to security? I think the biggest challenge is software developers and automotive engineers understanding each other’s development processes and constraints. And learning to understand their different culture and language. Without these basics we’ll have a very hard time coping with the paradigm shifts currently happening in the automotive industry.</p><h4 id=\"is-car-theft-the-biggest-risk-or-do-you-see-other-aspects-worse-risks-for-vehicles--cyber-security\">Is car theft the biggest risk, or do you see other aspects worse risks for vehicles &amp; cyber security? </h4><p>As of now I’d say yes, definitely. As cars get more functionality that can be activated via software and we see an increase of managed vehicle fleets versus privately owned cars threats will probably diversify somewhat more. Criminals will always be where the most money can be made with the least risk, at least we can be sure of that ;-)</p><h4 id=\"what-is-the-least-known-aspects-of-cyber-security-in-the-automative-industry\">What is the least known aspects of cyber security in the automative industry? </h4><p>We have been at some aspects of this a lot longer than many folks in the cyber security community might think and this has to do with all the immobilizer technology put into cars over the past 10-15 years and criminals finding ways around that. Also most discussions around fixing security problems in vehicles with quick patches over the air often don’t reflect how much testing has to go into any change you make to anything safety related in a vehicle. Also, like most ICS systems, we should keep in mind that there are (and there probably should be some more) failsafes that cannot be overridden by software.</p><h4 id=\"how-will-the-creation-of-smart-cities-have-an-impact-on-smart-cars-with-regards-to-security\">How will the creation of smart cities have an impact on smart cars, with regards to security? </h4><p>Absolutely. It’s the complexity of networks and the questions of trust all over again. But on a much larger scale than the Internet and with larger time constraints on both ways. By that I mean, your car and the traffic light you’re about to be at in 5 seconds won’t have the time to establish trust via something like a CRL. But also, that traffic light will be there for more than twenty years. And your car has a lifetime of about 10-15 years. Lots of interesting questions waiting for answers when it comes to smart cities…</p><h4 id=\"in-general-do-you-think-that-we-will-ever-see-things-like-notpetya-ransomware-infecting-cars\">In general, do you think that we will ever see things like NotPetya, ransomware infecting cars? </h4><p>I can certainly imagine wormable vulnerabilities in parts of vehicle infrastructure that heavily relies on software. EV charging infrastructure, I’m looking at you ;-) But I am still optimistic enough that we’ll finally start learning from mistakes in other fields and will succeed in implementing more resilient architectures in vehicles and smart traffic infrastructures.</p><h4 id=\"what-will-be-the-biggest-take-away-for-the-audience-from-your-presentation-at-cs3sthlm\">What will be the biggest take away for the audience from your presentation at CS3sthlm? </h4><p>That although there are some hard questions waiting to be answered we do know the basics of how to do this right. These are not new and sexy things and they take some effort, but it’s certainly doable. Also, we are still very early on in this particular race. So there is still time to learn from other fields and do some things better. </p>"
    } ,
  
    {
      "title": "CS3STHLM Newsletter September",
      "author": "CS3STHLM Crew",
      "category": "news",
      "date": "19 Sep 2018",
      "content_html": "<h4 id=\"cs3sthlm-expo-on-23rd-oct\">CS3sthlm Expo on 23rd Oct</h4><p>On the 23rd, we will have an Expo at our venue Nalen. Partners will display the latest cyber security solutions and services. We will have a full lineup of speakers during the Expo day on the Harlem stage. Get the agenda for the day here <a href=\"https://cs3sthlm.se/expo/\">/expo</a></p><p>Free registration here: <a href=\"https://cs3sthlmexpo.eventbrite.com/?aff=cs3sthlm\">https://cs3sthlmexpo.eventbrite.com/</a></p><p>Info on Expo partners and new CS3sthlm partners, shown further down!</p><h4 id=\"technical-training\">Technical Training</h4><p>This year we will offer six different trainings, to have something for all our participants. Some are technical deep dives, some are more theoretical or policy oriented. Here is some short info on the trainings:</p><ul>  <li><a href=\"/program/trainings/mikael-vingaard/\">Learn why honeypots</a> should be part of your toolbox to detect anomalies in your ICS network by taking Mikael Vingaards ICS honeypot class. This is a very hands-on class. Read an interview with Mike here: <a href=\"https://cs3sthlm.se/blog/mikael-vingaard/\">/blog/mikael-vingaard</a></li>  <li><a href=\"/program/trainings/erik-hjelmvik/\">The Network ForensICS</a> class is given for the 3rd time. Always sold out. Packed with network level examinations and protocol analysis, and you need to bring your computer.</li>  <li><a href=\"/program/trainings/stephan-beirer/\">The ISO/IEC 27019</a> training can be very useful for those interested in policy level work for the oil/gas industry or electrical utility industry. Read an interview with Dr Beirer here   <a href=\"https://cs3sthlm.se/blog/dr-stephan-beirer/\">/blog/dr-stephan-beirer</a></li>  <li><a href=\"/program/trainings/arnaud-soullie/\">The ICS Pentest</a> is a hand-on class where you will learn to find errors and vulnerabilities in a ICS system. To add something little extra, the class also includes a capture-the-flag competition between the attendees.</li>  <li><a href=\"/program/trainings/joe-slowik\">ICS Strategic planning and war gaming</a> is given by Joe Slowik of Dragos Inc to help you become better at defending your ICS systems.</li>  <li><a href=\"/program/trainings/ben-daniel/\">Ben and Daniel</a> from Dragos will get you started with threat hunting in your ICS environment</li></ul><p>See all trainings here: <a href=\"/program/trainings/\">/trainings</a></p><h4 id=\"more-speakers\">More Speakers</h4><p>We are more or less ready with the lineup for this year with close to 30 presenters. We have experts from all over the world, giving presentations in as diverse areas such as Cyber attacks against cars, lessons from incidents and attacks, writing a adding malware into blockchain solutions. See all speakers here <a href=\"/program/speakers/\">/speakers</a></p><h4 id=\"ics-security-lab\">ICS Security Lab</h4><p>We will continue the success with the ICS security lab from previous years. Attendees will have opportunities to try out various ICS equipment, cyber security protection mechanisms, and to see demonstrations of attacks. More info on the lab here <a href=\"/ics-lab/\">/ics-lab</a></p><h4 id=\"hotel-discount\">Hotel Discount</h4><p>Please take note - hotel Elite Stockholm Plaza will only hold the reserved block of rooms for CS3sthlm until the 21st of september. If you have not already booked your hotel room, now is the time! Use this link <a href=\"https://www.elite.se/en/conference-reservations/stockholm/e1a64817-7910-4517-bff8-d94ea2e28ed5/ea79fd04-097f-47bc-a55f-5e12e8c5868a/\">https://www.elite.se/en/conference-reservations/stockholm/e1a64817-7910-4517-bff8-d94ea2e28ed5/ea79fd04-097f-47bc-a55f-5e12e8c5868a/</a></p><h4 id=\"new-partners\">New Partners</h4><div class=\"partner--list partner--list-inpost\">\t<div class=\"partner--item partner--item-large\">\t\t<a href=\"https://www.advenica.com/en\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/advenica.png\" alt=\"Advenica\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item partner--item-large\">\t\t<a href=\"https://www.msb.se/en/\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/msb-english.png\" alt=\"MSB\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item partner--item-large\">\t\t<a href=\"https://www.first.org\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/first.png\" alt=\"FIRST\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item partner--item-large\">\t\t<a href=\"https://dragos.com\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/dragos.png\" alt=\"Dragos\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item partner--item-large\">\t\t<a href=\"https://www.kraftcert.no/english/index.html\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/kraftcert.png\" alt=\"KraftCERT\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item partner--item-large\">\t\t<a href=\"https://www.gai-netconsult.de/index.php?id=startseite\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/gai-netconsult.png\" alt=\"Gai Netconsult\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item \">\t\t<a href=\"https://omnisiens.se\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/omnisiens.png\" alt=\"OMNISIENS\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item \">\t\t<a href=\"https://romab.com\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/romab.png\" alt=\"ROMAB\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item \">\t\t<a href=\"https://sysctl.se\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/sysctl.png\" alt=\"sysctl\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item \">\t\t<a href=\"http://managementdoctors.se\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/md.png\" alt=\"Management Doctors\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item partner--item-large\">\t\t<a href=\"https://www.kaspersky.com\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/kaspersky.png\" alt=\"Kaspersky\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item \">\t\t<a href=\"https://www.recordedfuture.com\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/recorded-future.png\" alt=\"Recorded Future\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item \">\t\t<a href=\"https://waterfall-security.com\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/waterfall-security.png\" alt=\"Waterfall Security\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item \">\t\t<a href=\"https://en.energinet.dk\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/energinet.png\" alt=\"EnergiNet\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item \">\t\t<a href=\"https://www.netresec.com\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/netresec.png\" alt=\"NETRESEC\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item \">\t\t<a href=\"https://netnordic.se\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/netnordic.png\" alt=\"Netnordic\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item \">\t\t<a href=\"https://www.secmatters.com\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/securitymatters.png\" alt=\"SecurityMatters\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div>\t<div class=\"partner--item partner--item-large\">\t\t<a href=\"https://www.fortinet.com\" target=\"_blank\">\t\t\t<img src=\"/assets/partners/fortinet.png\" alt=\"Fortinet\" width=\"auto\" height=\"100%\" />\t\t</a>\t</div></div>"
    } ,
  
    {
      "title": "Erik Johansson - Co-founder of CS3sthlm",
      "author": "CS3STHLM Crew",
      "category": "blog",
      "date": "18 Sep 2018",
      "content_html": "<p><em>This is a blog post with Ph D Erik Johansson, one of the organizers of the CS3sthlm summit. Below you find the interview we did with him as the planning and preparation of the conference and expo, was in full swing!</em></p><h1 class=\"blog-title\" itemprop=\"name headline\">Erik Johansson - Co-founder of CS3sthlm</h1><p>Behind the scenes: Erik Johansson, CS3sthlm organizer</p><h4 id=\"what-is-your-name-profession-and-where-do-you-work\">What is your name, profession and where do you work?</h4><p>My name is Erik Johansson and  I work as an independent advisor helping organizations with assessments and procurements to increase industrial cyber security.</p><p>I often see myself as an Cyber Security Evangelist. Since I have found that most often the root cause behind technical weaknesses comes down to changing organizations mindset by educating and training them!</p><h4 id=\"how-did-you-get-involved-with-this-conference\">How did you get involved with this conference?</h4><p>Well the ideas for this conference started like a decade ago.</p><p>Every winter Robert and I visited S4 the S4 conference in Miami. However, we were surprised about the small number of Europeans over there - despite the lack of  good conferences focusing on Industrial Cyber Security in Europe. The ones that existed was too commercial and lacked the combination of technical depth and business perspective that we thought was necessary!</p><h4 id=\"how-did-you-get-involved-in-this-field\">How did you get involved in this field?</h4><p>During my  research at the Royal Institute of Technology (KTH) on the security challenges, when migrating from analog to digital equipment (aka programmable electronics), I found that the security could also be related to the mindset of the people.</p><p>A root cause of technical weaknesses can often be traced back to the lack of understanding the security implications of the business decisions.</p><p>The last decades have I therefore preached about security awareness for organizations in order to change their fundamentally immature mindset regarding security.</p><p>About twenty years ago I met Robert Malmgren – a very clever IT-security person who did not only understand the bits and bytes but could also see the business perspective - and the lack of human understanding of the complexity. Since then have our roads crossed many times in security related projects.</p><h4 id=\"what-is-your-role-during-the-conference\">What is your role during the conference?</h4><p>As the co-founders,  Robert Malmgren and I are involved in most part of the planning as well as running the event. Involved in program committee, evaluating the submitted papers, selecting partners and perform the overall discussion with industry.</p><h4 id=\"running-a-big-event-like-cs3sthlm-is-different-from-your-day-to-day-work-or\">Running a big event like CS3sthlm is different from your day-to-day work, or?</h4><p>Definitely different. It’s a strange time consuming ”hobby” – that takes a huge amount of our limited spare timet. However, it’s also super exciting to get to know so many clever people from allround this planet… :)</p><h4 id=\"is-it-a-marathon-race-a-100-meter-race-is-it-cat-herding-or-something-else-to-do-this-kind-of-job\">Is it a marathon race, a 100 meter race, is it cat herding or something else to do this kind of job?</h4><p>Tricky question. It’s really a mix. It’s a Marathon in the way that the planning and preparations starts almost direct after the last one and is ongoing for almost a year. Sometimes it’s more like a 100 meter race - like when we get 50 great submissions that needs to be evaluated. Or when the final program and all pieces is getting in place… and yes we are all exhausted after each event.</p><h4 id=\"why-should-i-go\">Why should I go?</h4><p>Everyone that is working in critical infrastructure, as manager or operational, and would like to learn more about current threats, incidents, vulnerabilities and experiences as well as success stories should go.</p><p>Not to say the least is to participate in the networking among peers that inspire and share valuable knowledge during the event!</p><h4 id=\"what-are-the-biggest-challenges-that-you-see\">What are the biggest challenges that you see?</h4><p>Industry have a huge challenge, not only to continuously increase their knowledge and awareness but to get a mature security culture in place.</p><p>The challenges from a conference perspective is to reach out and bridge the unfortunate gap between top-level decision-makers and technical experts as well as the gap between IT and OT departments.</p><h4 id=\"what-is-your-best-memory-from-previous-conferences\">What is your best memory from previous conferences?</h4><p>Hard to tell - there are so many good memories.</p><p>One was when the security researcher Ruben Santamarta (IOACTIVE) did a live hacking demo on a critical SATCOM equipment turning into a slot machine in front of our eyes.  Another special memory was to listen to the only Swedish Astronaut, Mr Fuglesang, as evening speaker! :)</p><h4 id=\"what-do-you-look-forward-to-with-this-years-event\">What do you look forward to with this year’s event?</h4><p>I’m really excited for this our fifth anniversary which has been extended with an EXPO on the day before the SUMMIT!</p><h4 id=\"any-last-words-of-advice-to-our-readers-and-the-attendees\">Any last words of advice to our readers and the attendees?</h4><p>Arrive early! Participate and interact with the vendors at the EXPO. Moreover, take the opportunity to discuss the strategical challenges that follows by the ongoing regulations and visit and don’t forget to take a look at the ICS lab and the demonstrations of valuable security solutions.</p>"
    } ,
  
    {
      "title": "Dr. Stephan Beirer - The Expert on the ISO/IEC 20719 standard",
      "author": "CS3STHLM Crew",
      "category": "blog",
      "date": "17 Sep 2018",
      "content_html": "<p><em>This is a blog post interview with Dr. Stephan Beirer, the expert on theISO/IEC 27019 standard. He will give a training session during theCS3sthlm conference week. Below you will find an interview we did withhim as he was preparing for the class. You will probably find severalthings in the interview that you didnt already knew about the standard!</em></p><h1 class=\"blog-title\">Dr. Stephan Beirer - The Expert on the ISO/IEC 20719 standard</h1><h4 id=\"what-is-your-day-job-where-are-you-working-and-what-do-you-do\">What is your day job, where are you working and what do you do?</h4><p>I am a Principal Security Consultant and the Team Manager for ICS/OT Security at GAI NetConsult, a security consulting company based in Berlin / Germany.</p><p>GAI NetConsult has been working in the ICS/OT domain for more than 15 years. Together with my colleagues we do consulting and technical or organizational auditing in the OT and ICS domain, mostly for operators and asset owners from energy industry, industrial manufacturing and for critical infrastructure projects.</p><h4 id=\"for-how-long-have-you-worked-in-the-field\">For how long have you worked in the field?</h4><p>During my studies and my PhD, I worked as a freelance security consultant. In 2006, I joined GAI NetConsult; I have been working in the ICS / OT domain since then.</p><h4 id=\"are-you-involved-in-the-standardization-process-what-areas-are-you-working-with\">Are you involved in the standardization process? What areas are you working with?</h4><p>Since 2010, I am involved in security standardization for ICS and OT systems. First in the security working group of the German utility organization BDEW, then also in the national standardization institutions DIN and DKE, the German mirror organisation to IEC. Since 2011, I have been working on the international level within ISO and IEC. In the working group responsible for information security management at ISO/IEC, I am the Editor of ISO/IEC 27019 and an expert for ICS and Smart Grid.</p><h4 id=\"in-your-class-you-will-cover-the-isoiec-27019-standard-which-is-somewhat-unknown-to-many-what-is-the-background-for-this-standard\">In your class, you will cover the ISO/IEC 27019 standard, which is somewhat unknown to many. What is the background for this standard?</h4><p>ISO/IEC 27019 started as a German national project in 2010. It was initiated by several large and medium sized energy utilities and BDEW, the German utility association. The utilities felt that it was hard to integrate the OT / ICS domain within their security management organization, which was based on ISO/IEC 27001 within most companies. They decided to publish a standard to fill this gap and in 2013, the German version was translated and published as an international ISO/IEC document.</p><p>The aim of 27019 is to extend the contents of ISO/IEC 27002 to the domain of process control systems and automation technology, thus allowing energy utilities to implement a standardized and specific information security management system (ISMS) that extends from the business to the process control level.</p><h4 id=\"where-you-involved-early-on-with-the-development-of-the-isoiec-27019-standard\">Where you involved early on with the development of the ISO/IEC 27019 standard?</h4><p>I was the project leader and editor for the German version at DIN and DKE from 2010 to 2012 and was then delegated from the German National Body to ISO/IEC to be the Editor of the International Standard.</p><h4 id=\"there-is-a-relatively-new-edition-of-the-standard-does-the-new-version-differ-much-in-comparison-with-older-ones\">There is a relatively new edition of the standard. Does the new version differ much in comparison with older ones?</h4><p>The latest version from 2017 is now completely aligned with the current version of ISO/IEC 27001 and 27002, so it can be seamlessly used within an ISMS based on ISO/IEC 27001. Additionally we aligned with 27001 in such a way that is possible to have certifications based on ISO/IEC 27019 together with 27001. Furthermore, the scope of the standard has been extended to include the oil sector. We completely revised the technical content of all security controls and twelve new topics are covered now which were not included in the first revision from 2013, e.g. with regard to mobile devices, vulnerability management or technical reviews.  </p><h4 id=\"will-utility-companies-start-certification-processes-against-the-27019-standard-or-is-it-still-against-the-27001-only\">Will utility companies start certification processes against the 27019 standard, or is it still against the 27001 only?</h4><p>It is now possible to have a certification for ISO/IEC 27019. This automatically includes the ISO/IEC 27001 requirements, which 27019 refers to. In Germany, already all gas and electricity grid providers have to be certified against ISO/IEC 27001 together with ISO´/IEC 27002 and 27019 since January, very likely a similar regulation will come into force for large generation and gas storage plants.</p><h4 id=\"is-there-any-requirement-on-prerequisites-and-prior-deep-knowledge-of-isoiec-27000-before-taking-the-class\">Is there any requirement on prerequisites and prior deep knowledge of ISO/IEC 27000 before taking the class?</h4><p>Absolutely not. After an introduction to the energy supply and the ICS systems used in the different energy domains, I will give an overview about the ISO/IEC 27000 series and the important content of ISO/IEC 27001, which is necessary to understand the application of 27019. Then we will concentrate on the 27019 controls for the various security management domains.</p><h4 id=\"you-will-also-talk-about-an-interesting-german-and-austrian-whitepaper-what-is-the-background-of-this-document\">You will also talk about an interesting German and Austrian Whitepaper. What is the background of this document?</h4><p>The Whitepaper „Requirements for Secure Control and Telecommunication Systems” is a best practice guideline, which defines security requirements for control systems used in the energy domain. It was developed by the German and Austrian utility associations BDEW and Oesterreichs Energie - therefore it is also called BDEW/OE-Whitepaper. The first version was published already in 2008 and it has become the de-facto standard in the German speaking regions, i.e. Germany, Austria and Switzerland for security requirement definitions for control systems in the energy domain.</p><p>In May 2018 a fully revised version 2.0 has been published, the English translation is available is here:  https://www.bdew.de/service/anwendungshilfen/whitepaper-anforderungen-sichere-steuerungs-telekommunikationssysteme/</p><h4 id=\"how-does-the-bdewoe-whitepaper-relate-to-isoiec-27019\">How does the BDEW/OE-Whitepaper relate to ISO/IEC 27019?</h4><p>While ISO/IEC 27019 defines requirements and best-practice controls related to the security management in the utility organization, the BDEW/OE-Whitepaper covers the requirements for the technology used in the ICS/OT domain. It is focusing on security specification and requirement definition in procurement projects.</p><p>Together, ISO/IEC 27019 and the BDEW/OE-Whitepaper are the basis for secure operation within an energy utility.</p><h4 id=\"how-long-have-you-been-working-with-the-bdewoe-whitepaper\">How long have you been working with the BDEW/OE-Whitepaper?</h4><p>With BDEW and Oesterreichs Energie, I have been the editor of the Whitepaper both for the initial version in 2008 and for the revision in 2018. I have used the Whitepaper very often over the last 10 years, especially in procurement and audit projects for grid control systems, substation automation and protection systems as well as for power and gas storage plant automation and virtual power plants and supporting OT systems. Oddly enough, sometimes I still have to discuss the same problematic topics with suppliers and integrators as ten years ago.</p><h4 id=\"is-your-class-only-theoretical-or-will-the-participants-also-have-any-practical-exercises\">Is your class only theoretical, or will the participants also have any practical exercises?</h4><p>We will have exercises to learn how to apply the lecture content with regard to the ISO/IEC 27019 controls and the BDEW/OE-Whitepaper requirements. I will give as many first hand experiences from my projects with 27019 and the Whitepaper as possible.</p><h4 id=\"as-an-expert-in-the-field-of-itinformationcyber-security-any-advice-you-would-like-to-share\">As an expert in the field of IT/information/cyber security, any advice you would like to share?</h4><p>Our field is rapidly changing, thus is very important to have a regular exchange within the community. CS3STHLM is a perfect event for this.</p><h4 id=\"any-last-thoughts-you-would-like-to-share-with-the-readers\">Any last thoughts you would like to share with the readers?</h4><p>I am happy that I have been invited to give a lecture at CS3STHLM. I am looking forward to meet IRL some old friends from the ICS security community and to make a lot of new ones in Stockholm! I heard rumours there might be a gathering of the European Chapter of BEER-ISAC also…</p>"
    } ,
  
    {
      "title": "Mikael Vingaard - The Expert on ICS Honeypots",
      "author": "CS3STHLM Crew",
      "category": "blog",
      "date": "17 Sep 2018",
      "content_html": "<p><em>This is a blog post with Mikael Vingaard, the expert on ICS Honeypot that will give the 2-day training session during the CS3sthlm conference week. Last year it was a 1 day course, but we decided to extend it so that more could be covered during class. Below you will find an interview we did with Mike as he was preparing for the class.</em></p><h1 class=\"blog-title\" itemprop=\"name headline\">Mikael Vingaard - The Expert on ICS Honeypots</h1><h4 id=\"what-is-your-background-with-regards-to-security-the-energy-system-and-honeypots\">What is your background, with regards to security, the energy system and honeypots?</h4><p>For the last 15 years, I have been working as Pentester, Auditor, BC-manager and IT-security “jack of all trade” like malware tracking and alerting via malware sinkholes.</p><p>Four years ago I switched from IT security to OT Security and needed to learn a lot of stuff in a very short timespan. As I didn’t have a power substation or water treatment plant for my private disposal (who has that :-) I had to learn a lot on ‘arcane’ ICS protocols like Modbus, IEC104, S7comm, DNP3 in some other way, hence honeypot seemed like an interesting way forward. To sum it all up - I needed to build something to simulate these protocols.</p><p>I found a low interaction honeypot and started to learn about it. After a while I put an ICS honeypot on the Internet, and it was attacked right away! I was hooked and the rest is history - today I manage one of the largest privately owned honeypot networks (120+ sensors) deployed all over the world!</p><h4 id=\"honeypots-arent-they-just-tools-for-researchers-or-can-they-be-used-in-a-real-environment\">Honeypots, aren’t they just tools for researchers? Or can they be used in a real environment?</h4><p>They can be both! During my two-day training at CS3sthlm in October we will touch both types of usage. Depending on your goals and scope, it is two different deployment approaches - they can (read should!) be used as a important layer in our “defense in depth” strategies. Internally deployed honeypots can provide an effective “close-to-zero-false-positives” warning system - with a minimal maintained profile - and should be used in most ICS networks. My newest honeypot project Defenica works as a very, very convincing deception ICS device, built on purpose to emulate for example a PLC or HMI system.</p><h4 id=\"what-is-the-most-interesting-results-or-effects-you-have-seen-with-your-honeypots\">What is the most interesting results or effects you have seen with your honeypots?</h4><p>That is when I find zero-days targeting my honeypot networks!  Normal reasoning would say that no real attackers would “burn” a zero-day on unsolicited ICS equipment… but some times they do!</p><p>My latest published Moxa vulnerability (CVE-2018-10632) <a href=\"https://ics-cert.us-cert.gov/advisories/ICSA-18-200-04\">https://ics-cert.us-cert.gov/advisories/ICSA-18-200-04</a> was built on the research found in the network traffic aimed at one of my honeypots!</p><p>My 2 day workshop would provide a walk-through on that case, to enable my students to be inspired to do similar zero-day research activities.</p><h4 id=\"high-interaction-honeypots-or-low-interaction-honeypots-what-is-that-and-what-do-you-think-about-it\">High interaction honeypots or low interaction honeypots, what is that, and what do you think about it?</h4><p>Honeypots can be either low, medium or high interaction. Low interaction honeypots are very easy to spot as a fake system if the attacker is skilled, but a high interaction honeypot, to a very large extent, has the same feel and look as the device/system that you are emulating.</p><p>During my learning curve I started with typical low interactions honeypots, but today I use only medium/high interaction honeypots. During the workshop we will deploy and work with low, medium and high interaction honeypots – in combination with real ICS/SCADA equipment!</p><h4 id=\"during-your-time-running-honeypots-what-is-the-most-surprising-thing-you-have-encountered-or-seen\">During your time running honeypots, what is the most surprising thing you have encountered or seen?</h4><p>When moving from low to high interactions honeypots a whole new world of enriched data emerged! Suddenly I found that I was able to detect and track various attacker groups during their campaign. Often one IP address attacks a honeypot, and they do some stuff and then seem to stop and go away. A while later a new IP adress comes along and continues the work that the first IP started!</p><p>Having deployed a considerably number of honeypots globally, I have been able to see patterns, as well as map various activities to a specific group of attackers, previously hidden.</p><h4 id=\"can-an-attacker-easily-see-the-difference-between-a-real-system-and-a-fake-one-the-honeypot\">Can an attacker easily see the difference between a real system and a fake one, the honeypot?</h4><p>No!</p><p>In my class I will share my hard-earned knowledge on how to setup honeypots that an attacker cannot differentiate from a real device!</p><h4 id=\"how-would-you-differentiate-the-honeypot-in-comparison-with-an-ids-or-an-ips-what-are-the-advantages\">How would you differentiate the honeypot in comparison with an IDS or an IPS? What are the advantages?</h4><p>Traditional IDS/IPS systems are often signature based, hence they will alert you whenever something match a known “signature”. If the activities/signatures from the attacker are not known in advance, no alert will be triggered.</p><p>As the honeypot is a fake unit, there should never be any reason to communicate with the device - so any and all traffic/alerts to or from it should be investigated by the SOC/Blue team.</p><h4 id=\"is-there-anything-that-you-can-catch-or-detect-or-do-with-an-honeypot-that-one-cannot-do-with-an-ids-ips-or-firewall\">Is there anything that you can catch, or detect, or do with an honeypot that one cannot do with an IDS, IPS or firewall?</h4><p>Yes.</p><p>A typical IDS system is designed for operating in environment with traditional IT systems, not OT/ICS equipment. Putting an IDS system to alert on ‘anomaly stuff ‘ e.g. old network protocols in an OT industrial network will fire a lots of alerts and make the security monitor system to light up as a over-charged Christmas three - that not a good way to avoid the alert fatigue that so many SOC/SAC teams are currently suffering from…</p><p>As highlighted earlier, a significant advantage of using honeypot technology is the (almost) zero-false positive alerts.</p><h4 id=\"is-the-honeypot-a-protection-or-a-detection-mechanism\">Is the honeypot a protection or a detection mechanism?</h4><p>Very good questions, Robert! I would say that a honeypot typically and <em>primarily</em> is a detection mechanism to alert you that something is out of order. But based on the deployment options it can actually be both!</p><h4 id=\"having-honeypots-in-a-icsscada-environment-what-is-the-most\">Having honeypots in a ICS/SCADA environment, what is the most</h4><p>important things to think about?</p><ol>  <li>To know what  to achieve from the deployment</li>  <li>How to make the honeypot ’believable’</li>  <li>Not introducing new risks for the company</li></ol><p>All this, and more, is what we will learn on the first day of the workshop!</p><h4 id=\"if-a-honeypot-actually-is-being-attacked-what-is-the-first-thing-you-should-do-as-the-owner-of-the-honeypot\">If a honeypot actually is being attacked, what is the first thing you should do as the owner of the honeypot?</h4><p>First: be really happy that it’s a honeypot and not the real equipment the attacker are trying to hack :-)</p><p>Secondly: initiate your incident response (IR) process and start to observe the attacker in order to find the best possible time to kick them out of the environment.</p><p>And - if done properly in the IR phase, be sure to gather knowledge of the TTP’ of the attackers.</p><h4 id=\"what-will-your-students-learn-at-the-training\">What will your students learn at the training?</h4><p>My students will learn how to plan, build, deploy and manage different types of honeypots. We will deploy the honeypots on the Internet and see various probes and attacks.</p><p>On the second day we will build a dedicated network with real ICS/SCADA equipment and learn how to move from low to high interactions honeypots. Lots of fun stuff to do with this equipment! </p><h4 id=\"any-last-final-words-of-advice-you-would-like-to-give\">Any last final words of advice you would like to give?</h4><p>If you don’t already have honeypots in your arsenal of security tools you are missing out on a very interesting technology that can be effective, with zero false positives. If you never have worked with honeypots, please come and join the technical training!</p><p>A great bonus of taking the honeypot class is that you also will get a view on the strange and ‘arcane’ protocols that lives in most industrial networks!</p>"
    } ,
  
    {
      "title": "CS3STHLM Newsletter April",
      "author": "CS3STHLM Crew",
      "category": "news",
      "date": "30 Apr 2018",
      "content_html": "<p>We are opening up the gates for the 5th CS3STHLM summit! In this newsletter we present the keynote speakers, our first presentation and a record number of training sessions!</p><h4 id=\"important-notice\">Important notice!</h4><p>Many of you might already be aware of the new data privacy regulations (GDPR) that will be applied in Europe on May 25th. This regulation makes all of our old registers for mail information null and void by the end of May.</p><p>If you would like to keep receiving our Newsletters with information about the CS3STHLM activities – PLEASE CLICK ON <a href=\"mailto:info@cs3sthlm.se\">THIS LINK</a> AND SEND US THE RESULTING MAIL.  We are sorry for this inconvenience, but we feel it is important to respect the privacy of all persons.</p><p>Spring cleaning has been done to our website. We have updated the web with information on the upcoming conference. A lot of new information has been published, and a lot more will be posted in the near future.</p><p>We are thrilled and honoured to announce our two keynote speakers for the 2018 CS3Sthlm conference: Marty Edwards and Patrick C. Miller. Both keynote speakers have a long history in ICS security, one working within DHS and the ICS-CERT, the other being the grandfather of the NERC CIP. Both are also very experienced and well-respected speakers at conferences worldwide.</p><p>For the Call For Participation, we got more than 50+ very good submissions from all over the planet. We have selected 16 top submissions to start with in this year’s agenda. Please check out the first batch of topics and presenters listed here <a href=\"https://cs3sthlm.se/program/speakers/\">/speakers</a> and here <a href=\"https://cs3sthlm.se/program/presentations/\">/presentations</a> We will add presenters to the lists over time, as we also have a few slots reserved for invited speakers.</p><p>We will have a record number of training sessions to select from this year. It is the largest selection found at any ICS/SCADA conference, which allows you to select deep dives into the topic most interesting for you: ICS/SCADA Penetration Testing, ICS Threat Hunting, ICS Network Defense, ICS Network ForensICS, ISO 27019, ICS Honeypots. Information on trainings available at <a href=\"https://cs3sthlm.se/program/trainings/\">/trainings</a>.</p><p>Our strong lineup, with keynotes/presenters/trainings and with yet a number of unannounced speakers and events, is stronger than any of the previous years!</p><p>Please take advantage of the MEDIUM BIRD DISCOUNT of 10% that is still valid until May 31st on all tickets! Please visit the <a href=\"https://tickets.cs3sthlm.se\">ticket site</a> to claim your discounted ticket.</p><p>Last, and on the lighter side – we have had some questions regarding the meaning of CS3STHLM. “CS3” stands for Cyber Security, Critical Structures and Control Systems, “STHLM” is short for Stockholm where the summit is held annually, and had to be added not to confuse our name with other brands. The correct pronunciation is:</p><p>/siː ɛs θriː stɒkhoʊlm/;</p><p>Or better yet, grab one of the organizers when you are at the conference and ask them why we need such strange name for this thing….</p><p>Best wishes from the CS3STHLM crew  </p>"
    } ,
  
    {
      "title": "CS3STHLM Newsletter December",
      "author": "Robert Malmgren",
      "category": "news",
      "date": "20 Dec 2017",
      "content_html": "<p><img src=\"/assets/cs3-holiday.png\" alt=\"CS3STHLM Holiday\" class=\"full-width-image\" /></p><p>2017 was indeed a remarkable year, and some of the cyber security related things that happened will surely be remembered. Among them was the Wannacry malware hospitals, industrial companies and other important infrastructure. Things that also hit the front pages were outbreak that blindly struck against the analysis of Industroyer/CRASHOVERRIDE (ICS malware attacking Ukraine grid operator) and recently the TRITON/TRISIS/Hatman (attack tool against safety system). In Sweden, IT security incidents led to the resignation of two ministers from the government, and a journalists use of Shodan led to that one of Swedens largest news room had a series of reports on what is Internet accessible, when they found heating/hydropower/windpower/elevators and more, sitting on the Internet for anyone to access.</p><p>The CS3STHLM 2017 summit (previously known as 4SICS) had several presentations related to all these issues. As a holiday gift for you, we have now published a number of presentations on our YouTube channel: <a href=\"https://www.youtube.com/channel/UCkD15o_9eJxUc9eeHtWSQ6Q\">CS3STHLM at YouTube</a></p><p>Next year we will be back for the fifth time and the dates are October 22nd-25th. We are already on the lookout for summit content, so do let us know what you think we should present in order to make next years workshops and conference as useful and rewarding as possible.</p><p>Another holiday gift is that we already have opened the ticket sale for 2018 with a special Earliest Bird discount of 30 % on the two-day conference ticket. Link: <a href=\"https://www.cs3sthlm.se/\">www.cs3sthlm.se</a> and the discounted ticket is available until January 12th.</p><p>A very happy holiday season - from all of us, to all of you! The CS3STHLM crew</p>"
    } ,
  
    {
      "title": "CS3STHLM Presents ICS- and IoT Lab together with Norwegian Energy CERT",
      "author": "Maria Engstrom Ostby",
      "category": "press",
      "date": "04 Oct 2017",
      "content_html": "<p>In the light of growing vulnerabilities, this year’s top summit on Cyber Security in Industrial Control Systems and Critical Infrastructure will give delegates possibilities to partake in real-time simulations and challenges in an updated and bigger ICS lab. The lab is hosted by ROMAB, Norwegian Energy CERT and equipment provided by the Norwegian National Security Authority, NSM. The summit takes place in Stockholm October 24-26.</p><p>This year the lab is declared to be bigger, better and more interesting than ever before with added ICS and ICS communication equipment to the lab. New equipment has resulted in a simulation of communication in industrial control systems with some ICS specific protocols including OPC communication being in progress. It is also extended with a part that is for IoT security. The Internet of things, (IoT), is the network of physical devices, vehicles, and other items embedded with electronics, software, sensors, actuators, and network connectivity which enable these objects to collect and exchange data.</p><p>Margrete Raaum from Norwegian Energy CERT:</p><blockquote>  <p>-”Nothing gives as valuable cyber security learning as real hands-on work. Teaming up with ROMAB to create a dynamic and realistic learning environment is exciting, and we hope this will benefit ICS security engineers all over Scandinavia and beyond”</p></blockquote><p>This year there is a much larger team involved in setting up, running the lab, or have special tasks involving the lab during the conference. The team members include Lars-Erik Smevold of KraftCERT (NO) who will be in charge of the lab, Nicklas Keijser (SE), who is an expert on SCADA/ICS development, Robert Malmgren (SE) of ROMAB, Erik Hjelmvik (SE) of NETRESEC and Mikael Vingaard (DK).</p><p>Robert Malmgren, founder of CS3STHLM and owner of ROMAB elaborates:</p><blockquote>  <p>-”We are honored to have the Norwegian energy sector CERT KraftCERT, as cooperators to ROMAB in setting up this year hosting the ICS and IoT security lab! This is a truly great partnership over the border with our Scandinavian friends in an effort to build competence and relationships for all that strive to secure the society and its critical infrastructure by starting with its fundamentals - the very systems that run our basic functions, like the electrical grid. Thank you to the Norwegian National Security Authority (NSM)  to lending out equipment to the lab”</p></blockquote>"
    } ,
  
    {
      "title": "Advenica announces new collaboration with CS3STHLM",
      "author": "Maria Engstrom Ostby",
      "category": "press",
      "date": "14 Sep 2017",
      "content_html": "<p>The 4th edition of the top international summit on SCADA/ICS and critical infrastructure includes a seminar called ’Effective threat mitigation strategies’ hosted by Advenica. The company is providing new ways in cyber security, protecting critical infrastructures with innovative solutions.</p><p>One of the founders of CS3STHLM, Robert Malmgren, expresses excitement over the collaboration;</p><blockquote>  <p>” This fits perfectly with our profile and we are looking forward to learn about Advenica’s new security solutions.”</p></blockquote><p>Advenica elaborates</p><blockquote>  <p>”Last years have presented an increasing number of bumps in the road for cyber security defenders. The vast number of different attack vectors and the explosion in number of malware variants has made yesterday’s cyber defense strategies obsolete. The goal of cyber security is to ensure robust operation of the defended system – not to find as many pieces of malware as possible. Yesterday’s strategy is efficient at finding malware – but fail in ensuring robust operation”.</p></blockquote><p>CS3STHLM is an international summit that focus entirely on cyber security protection of SCADA/ICS and critical infrastructure. CS3STHLM attracts about 250-300 people from around the world to meet, network and gain knowledge. CS3STHLM takes place October 23-26 at the venue Nalen in central Stockholm.</p>"
    } ,
  
    {
      "title": "CS3STHLM Newsletter September",
      "author": "Robert Malmgren",
      "category": "news",
      "date": "13 Sep 2017",
      "content_html": "<p>The CS3STHLM summit is just a bit over a month away. Today we have speakers from many corners of the earth, and we have already attendees from most continents!  </p><p>We will be at the beutiful venue Nalen in central Stockholm again.  </p><h4 id=\"speakers-and-presentations\">Speakers and presentations </h4><p>We will have presentations on various topics, including:  </p><ul>  <li>how security impact safety</li>  <li>how to sucessfully roll out cyber security policies at multinational corporations  </li>  <li>Security (or the lack thereof) in IoT  </li>  <li>First hand accounts of the ongoing Ukraine cyber attacks  </li>  <li>New, secure, protocols for SCADA/ICS  </li>  <li>Lessons learned from handling an enourmous APT at a critical infrastructure provider</li>  <li>Learn about tricks and defense in Social Engineering  </li></ul><p>As always we will have a mix of attack and defence stances, between technology and policy level, between theory and real-dirt-under-your-nails practise. We will continue the tradition from 4SICS to use multiple stages, and presentations will be done in different formats – a main stage, a TV studio setup for more intimate atmosphere and dialogues, and an impromptu stage in GeekLounge for improvised presentations (lightning talks, work in progress presentations, etc).  </p><p>View speaker info here - <a href=\"https://cs3sthlm.se/program/speakers/\">/speakers</a></p><p>View info on presentations here - <a href=\"https://cs3sthlm.se/program/presentations/\">/presentations</a></p><h4 id=\"workshops\">Workshops </h4><p>We are fortunate to have three excellent pre-conference trainings/tutorials:  </p><ul>  <li><a href=\"https://cs3sthlm.se/program/workshops/erik-hjelmvik/\">Network Forensics (2 day) </a></li>  <li><a href=\"https://cs3sthlm.se/program/workshops/mikael-vingaard/\">Practical SCADA/ICS Honeypots (1 day) </a></li>  <li><a href=\"https://cs3sthlm.se/program/workshops/michael-theuerzeit/\">Cyber Security for Industrial Automation and Control Systems: An introduction of the IEC 62443 standard (1 day) </a></li></ul><p>Tickets for all different workshops are available now. Please remember that one workshop is 2 day and the others are 1 day. If you select the 2 day workshop, make sure that you arrive and can start monday morning!  </p><h4 id=\"security-lab-ics-and-iot\">Security lab: ICS and IoT </h4><p>This year we will have a larger and more professional ICS security lab in place. Besides the number of equipment available, we will also help interested attendees to better play with it at their level of knowledge. Beginners will find help to do basic probeing and pokeing at exotic devices. Intermediates will be able to do more advanced experiments with bugs. Experts will be able to participate in winning prices if they submit newly found vulnerabilities to the CERT representatives at the conference.</p><p>This year we will also introduce an IoT security lab where people can play around with SOHO equipment, lightbulbs with IP addresses, embedded devices, etc.  </p><h4 id=\"practical-things\">Practical things </h4><p>We still have rooms left in the block with discounts that we negotiated with the hotel closest to the venue. We want to inform you that rooms are going quickly and the cut-of-date for when the discount is no longer available is less than two weeks away. Dont miss out on having this!  </p><p>Info on venue, dates, airports, subways, hotels, etc can be found at the info web here:  <a href=\"https://cs3sthlm.se/practical-details/\">/practical-details</a></p><h4 id=\"historic-presentations\">Historic presentations </h4><p>To get a taste of what the summit is, you can find old presentations from 2015 and 2016 on <a href=\"https://www.youtube.com/channel/UCkD15o_9eJxUc9eeHtWSQ6Q\">youtube/cs3sthlm</a></p>"
    } ,
  
    {
      "title": "Malware that can knock out power grids discovered",
      "author": "Maria Engstrom Ostby",
      "category": "press",
      "date": "13 Jun 2017",
      "content_html": "<p>Researchers from Slovakian Anti Virus company ESET have publicized information on malware especially targeted for automation in power grids. The malware is tied to an attack in Ukraine 2016. ESET have worked alongside researchers from another company, Dragos, to analyze the code. Investigators from ESET and Dragos will come to Cyber Security Summit CS3STHLM in Stockholm in October to present and discuss their findings.</p><p>Robert Lipovski, one of the researchers at ESET, states in Washington Post:</p><blockquote>  <p>“The potential impact of malware like this is huge. It’s not restricted to Ukraine. The industrial hardware that the malware communicates with is used in critical infrastructure worldwide.”</p></blockquote><p>This malware is called the most dangerous code since Stuxnet, malware discovered in 2010 aimed specifically towards Iran’s nuclear program.</p><p>Robert Malmgren, owner and co-founder of CS3STHLM:</p><blockquote>  <p>” The fact that this malware can be used and re-used in critical infrastructure everywhere makes it an enormous threat to non protected Industrial Control Systems.”</p></blockquote><p>CS3STHLM takes place at Nalen in Stockholm October 24-26.</p><p>www.cs3sthlm.se</p><p>For more information regarding the malware, please contact</p><p>Robert Malmgren</p><p>Phone: +46 708 33 03 78</p>"
    } ,
  
    {
      "title": "CS3STHLM Newsletter June",
      "author": "Robert Malmgren",
      "category": "news",
      "date": "13 Jun 2017",
      "content_html": "<p>Outline of this short newsletter</p><ul>  <li>CFP work</li>  <li>Announced speakers</li>  <li>Technical Trainings</li>  <li>Social events</li>  <li>Early Bird tickets</li>  <li>Venue</li>  <li>Conference Hotel</li></ul><p>We want to share some info about the recent development.</p><p>We will carry on the tradition from when we where called 4SICS - to be a leading international conference on SCADA, ICS and critical infrastructure cyber security! We will have multiple stages with the best international speakers and trainers, having excellent social activities and provide hard-to-earn knowledge, no matter if it is deeply technical matters, sucessful solutions or policy briefs.</p><p>In the program comittee, we are working with the submissions that we have received as the CFP closed. We have alot more submissions than available speaker slots! And still not all slots are for submitted proposals, but we have reserved some slots for invited speakers as well. Thus it is really hard to make the selection this year.</p><h3 id=\"announced-speakers\">Announced speakers</h3><p>We have announced a couple of speakers already, especially since they are related to investigations into the recently unveiled industroyer/CRASHOVERRIDE malware:</p><ul>  <li>Joe Slowik of Dragos Inc (US), who will speak on “Strategic Network Defense in ICS Environments”</li>  <li>The ESET team (SK) who have a presentation on “Industroyer: biggest threat to industrial control systems since Stuxnet”</li></ul><p>We will have a special panel on the Ukraine 2016 event with detailed discussion, where both the ESET and Dragos specialists will attend. We plan to add more experts to this discussion.</p><p>More speakers will be announced in the weeks to come, including keynote speakers!</p><h3 id=\"technical-trainings\">Technical trainings</h3><p>We will have a number of technical trainings related to network forenics, honeypots, hacking, etc.</p><ul>  <li>Erik Hjelmvik of Netresec (SE) will have a 2 day Network Forensic class</li>  <li>Mikael Vingaard (DK) will have a 1 day Honeypot class</li></ul><p>Thus, with the addition of 2 day training classes, the pre-conference activity will start already on the 23rd of october!</p><h4 id=\"social-events\">Social Events</h4><p>We will have a welcome reception on the evening of the 24th and a conference dinner on the 25th.</p><h3 id=\"early-bird\">Early Bird</h3><p>A reminder - the early bird prices are until 30 of June! You will find the ticket site here: <a href=\"\">https://tickets.4sics.se/sales/</a> or from the main CS3STHLM web page.</p><h3 id=\"venue\">Venue</h3><p>As per the last 2 years, we will be in wonderful Nalen, in the heart of Stockholm. You will find information and directions at <a href=\"https://cs3sthlm.se/practical-details/\">/practical-details</a></p><h3 id=\"conference-hotel\">Conference hotel</h3><p>We have a special arrangement with Elite Palace Hotel located just ~200 meters away from the venue. Use this link to get our special discount when booking <a href=\"https://www.elite.se/en/conference-reservations/stockholm/e1a64817-7910-4517-bff8-d94ea2e28ed5/\">Elite Conference Reservation</a></p><p>–Until the next news letter,</p><p>Best wishes from the whole CS3STHLM team</p><p><img src=\"/assets/news/cyber.jpg\" alt=\"Cyber\" class=\"full-width-image\" /></p>"
    } ,
  
    {
      "title": "CFP - DON'T MISS OUR DEADLINE",
      "author": "Robert Malmgren",
      "category": "news",
      "date": "08 May 2017",
      "content_html": "<p>To show how seriously we take all parts of the CS3STHLM summit we have sent one team member to Carrara, Italy, in order to actually carve the prize for Best Presenter in white marble. If it turns out nicely you will be able to see, and maybe accept, the piece at CS3STHLM summit in October. If it fails you won’t.</p><h3 id=\"we-want-your-submission-for-presentation-or-workshop-by-may-31\">WE WANT YOUR SUBMISSION FOR PRESENTATION OR WORKSHOP BY MAY 31</h3><p><a href=\"mailto:cfp@cs3sthlm.se\">cfp@cs3sthlm.se</a></p><p><img src=\"/assets/news/marble-one.jpg\" alt=\"Marble One\" /> <img src=\"/assets/news/marble-two.jpg\" alt=\"Marble Two\" /></p>"
    } ,
  
    {
      "title": "Cyber Security Summit 4SICS Relaunches as CS3STHLM",
      "author": "Maria Engstrom Ostby",
      "category": "press",
      "date": "21 Apr 2017",
      "content_html": "<p>Due to a conflict of interest regarding the name SICS between the summit 4SICS and Swedish Institute of Computer Science, Omnisiens announces the fourth summit to be arranged under the new name CS3 STHLM. Three CS stand for Cyber Security, Control Systems and Critical Structures, and STHLM is an official acronym for Stockholm. CS3 STHLM takes place in Stockholm this October 24-26.</p><p>Top level cyber security experts from all over the world will gather again in the old concert venue Nalen in Stockholm for the internationally acclaimed summit. Owners of arranging company Omnisiens, Swedish cyber security experts Erik Johansson and Robert Malmgren, state:</p><blockquote>  <p>-”We changed the name because we had to, but we are convinced our target group will find us, and that it won’t be such a big deal. Ticket sales are up and running, and we look forward to presenting yet another exciting mix of speakers and topics.”</p></blockquote><p>Interest for the summit is expected to escalate while awareness of hacker attacks and vulnerabilities in IoT (Internet of Things), rises.</p><p>Tickets are on sale with an early bird price until June 30.</p><h3 id=\"facts-cs3sthlm\">FACTS CS3STHLM</h3><p>CS3STHLM is hosted by Omnisiens, owned by Swedish Cyber Security Experts Robert Malmgren; voted number one IT security specialist in Sweden in trade magazine Computer Sweden and Erik Johansson, PhD; Security Researcher, Advisor, and Contractor working at the intersection of Information Technology (IT) and Operational Technology (OT)</p><p>Key note speakers previous years:</p><ul>  <li>2014 Stefan Lüders, Head of Computer Security at CERN</li>  <li>2015 Kim Zetter, editor at Wired Magazine and author of the book Countdown to Zero Day</li>  <li>2016 Robert M Lee, SCADA expert who was one of the investigators of the attack on Ukraine</li></ul><p>Selected topics from previous years, among ca 12-20 per year:In depth analysis of the attacks against Ukraine with Robert M Lee from Dragos and Anton Cherepanov together with Robert Lipovsky from anti virus company ESET who presented a thorough walk through of what is known about the virus ”Black Energy”, which was used against power companies in Ukraine.</p><p>Internet of Things; John Matherly, creator of Shodan, called the world’s most dangerous search engine leads a discussion of escalation of IoT with a number of the world’s leading experts on the subject.</p><p>Hackable pacemakers discussed by scientists Marie Moe and Eireann Leverett, they present weaknesses and possible threats against Moe’s own pacemaker. A kind of threat that led Dick Cheney, previous Vice President of The US, to discountct his pacemaker from the Internet to avoid being targeted by hackers.</p><p>The summit’s moderator is since the start Anne Marie Eklund Löwinder, AMEL, Head of Security at IIS, The Internet Foundation in Sweden, and one of seven crypto officers in the world with a key to the Internet root zone.</p>"
    } 
  
]}