{"speakerList":[






{
	"description": "<p>In the talk, we will discuss our research on the network communication of industrial devices that have Codesys Runtime installed on them. Codesys Runtime is an example of software designed to resolve the issue of industrial device unification and interaction.</p><p>Codesys Runtime installation has already been adapted for over 350 devices designed for all types of industrial applications. CoDeSys developers have made it easy for vendors to build Codesys Runtime into their devices to enable users of these devices to program them using the CoDeSys programming environment. As a result of this, thenumber of adapted devices is set to grow further.</p><p>A flaw or vulnerability identified in a core networking component on a device is highly likely to be reproduced on other devices, even though these devices may be based on completely different hardware. It should also be kept in mind that, since the software is designed for industrial applications, devices running it will be united into an integrated network infrastructure. And since no documentation on the protocol is available, monitoring network activity between devices is not an option. Putting these three factors together, we can see that the exploitation of a vulnerability in Codesys Runtime could lead to an attack on an integrated network of devices running Codesys Runtime, a situation not unlike a “Die Hard” scenario.</p><p>In the talk, we will analyze the proprietary network protocol, look at the fields used, describe the protocol’s functionality and how the packets received are handled on the client side. We will also discuss the difficulties that we faced in our research and demonstrate both the architecture­related vulnerabilities in the protocol itself and the vulnerabilities in the request handlers used by it.</p>"
},



{
	"description": "<p>Tactics, techniques, and procedures are the sophisticated intelligence information. Threat intelligence agencies using this approach attribute attacks to a specific “group”. This is also a valid approach to defend yourself against these attack groups. However, if you want to defend against an unknown attacker – especially in OT-infrastructures – it seems more suitable starting by the consequences of a cyber attack you want to avoid and the possible paths leading to it. Critical functions can be identified by applying the Consequence-driven Cyber-informed Engineering (CCE) method. Compromising specific devices or applications may provide an easy way to achieve the consequence the attacker is up to. This is demonstrated at a real test facility containing over 60 devices, which regulate a physical process.</p><p>This presentation illustrates the application of CCE for an attack on a facility. First, the goal of the attack is specified, which would be the sabotage of the facility in this case. After that, possible paths achieving this goal are determined. The easiest path in this case is an attack manipulating the communication between a HMI and PLC using a common but proprietary protocol. Finally, countermeasures from the IT security standards such as “IT-Grundschutz” and ISO/IEC 62443 are applied which hamper a successful attack.</p><p>Using the CCE method and a security standard, the presentation starts and ends on a high level. This is interesting for middle management, which want to improve their security. Furthermore, the technical illustration executing a possible attack is interesting for the appropriate audience, which is also present at the conference. During the work, a dissector in Wireshark for the protocol was implemented. Consequently, the communication between the devices can be illustrated in more detail explaining the performed attack. As a result of the technical and high level illustration, the contribution of the BSI outline a cyber attack for both groups.</p><p>The key take away are the dissector for the protocol and the applied CCE method. Later can be used for risk assessment.</p>"
},





{
	"description": "<h4 id=\"network--security--and-vulnerability-monitoring-for-ics-a-demystification-from-an-asset-owners-perspective\">Network-, Security- and Vulnerability Monitoring for ICS: a demystification from an asset owner’s perspective.</h4><p>In this session Dr. Mona Lange (Audi) and Christian Augustat (Gassco) will take you on a conceptual tour through Industrial Control System (ICS) Security, both have a solid background in securing industrial plants in the manufacturing and Oil- and Gas industry. The session will provide you with insights into areas of Governance, Network Security Monitoring, Vulnerability Management and Continuous Security Monitoring, all from the perspective of an Asset-Owner.</p><p>In the area of Governance management we will dissect the pros and cons of IEC62443, ISO27001 and CIS as a foundation for an ICS security strategy, demonstrate how to prioritize security measures and render existing security risks transparent to management for security risk acceptance. Based on this security strategy, we will motivate the importance of asset management as a foundation for network security monitoring, describe how to build an MAC Address based Asset Inventory based on existing network components and integrate it into a Security Information and Event Management System (SIEM). Effective network security monitoring requires asset owners to understand what sources of infection or attack on ICS exist, how threat groups exploit them and how they can be monitored.</p><p>Generally, it is not feasible to defend against all threats everywhere, however we will demonstrate how baselining can be used to make an existing attack surface transparent and prioritize network security monitoring efforts in a threat aware manner. We will show how baselining can be used as a foundation for hardening Firewalls andderiving monitoring scenarios and integrating them into a SIEM. In addition, we will point out the difference between shopping security in comparison to building security. Vulnerability management means identifying vulnerabilities present in the environment, understanding their impact for an attack surface and finding possible mitigations as alternatives to patching.</p><p>We will show how the concept of ICS in a Virtual Machine can be used for live vulnerability scanning and provide some practical examples on how to rank the criticality of vulnerabilities. Main focus is to point out common problems from an asset owner’s perspective and point towards easy solutions based on our experience “from the trenches”.</p>"
},



{
	"description": "<p>The automobile industry is changing and new fields such as autonomous driving, battery enhancements and infrastructure or advanced mobility services are under development. As a side effect the interconnection of vehicles increases with numerous new protocols and technologies introduced to enable these scenarios, which also attract the attention of security researchers and hackers. Therefore, more focus on security practices is necessary.</p><p>One of these new technologies is Automotive Ethernet. It not only affects the in-vehicle network with enhanced bandwidth and protocol versatility, but also enables the connection of the vehicle to existing external network infrastructures. This can be accomplished by the Diagnostic over Internet Protocol (DoIP) which is used for diagnostic communication over the Onboard Diagnostic (OBD) interface.</p><p>Therefore potential unsafe or even unknown functionality is exposed to the outside world which, until now, was a private point to point connection between the diagnostic equipment and the vehicle. Moreover the diagnostic interface is commonly used to modify vehicles like enabling/disabling software features or update firmware. With an increasing proportion of software as a product features and at the same time raising attractiveness for malicious activities (e.g. fraud, attacks, manipulation) by attackers. The Original Equipment Manufacturers (OEM) are faced with new challenges in the domain of evidence preservation and reconciliation. Especially with the ISO21434 and UNECE on the horizon.</p><p>We examined possible scenarios that range from information gathering to malicious activities with focus on the vehicle and infrastructure. At the same time we approached the idea of what forensic evidence such activities might leave behind and how state-of-the-art technology helps preserving evidence. We therefore analysed the protocol specification and developed software according to our scenarios for evaluation. Furthermore, we studied existing forensic investigation approaches in the IT and SCADA domains and their feasibility with the DoIP protocol, as being the central point of communication with the in-vehicle network from outside the vehicle.</p><p>In this presentation we present our approach on the analysis of the protocol, the scenarios we derived and the tools we used for evaluation. This also includes the applicability check of the diagnostic interface for forensic investigation as well as discussion to provide these forensic investigations for court relevant incidents.</p>"
},



{
	"description": "<p>In most todays ICS networks, security testing is already being performed to know allweaknesses and issues. At least I hope that is the fact…. These tests are either run by the ICS owners themselves or by an trusted external party. However in a lot of occasions, security testing is performed in a too limitative scope and hence security issues often get overlooked because of this or potential drafted scenario’s to abuse the found weaknesses are incomplete and do not give a full picture. Next to that, a lot of talk is still focussed on testing industrial devices such as PLCs and other network components. Which is fine on its own but again the bigger picture is not looked at. In this presentation, a broader view is shown on how thorough security tests can be performed (without performing illegal actions) in an attempt to provide the ICS owners with a complete view on what their risks are. It is explained why you have to combine physical, logical and human elements within the different security tests you run and why it is sometimes better to take a step back instead of just plunging in and perform logical security testing. The different viewpoints on how you can perform testing to know your weakest elements are shown along with the different requirements to run testing from a particular viewpoint. Combinations of discovered weaknesses are then put together within realistic scenario’s. The advantages as well as pitfalls are explained of performing security testing this way using real­world experience examples.</p><p>The things mentioned within this presentation are all actions that can be done by ICS owners themselves, or should they decide in doing so by a third party, yet the ICS owners will then be able to follow along and understand what is going on instead of being left in the FUD zone.</p>"
},





{
	"description": "<p>Wireless sensor networks are commonly thought of as IoT devices communicating using familiar short­range wireless protocols like Zigbee, MiWi, Thread and OpenWSN. A lesser known fact is that about a decade ago, two industrial wireless protocols (WirelessHART and ISA100.11a) have been designed for industrial applications, which are based on the common IEEE 802.15.4 RF standard. These Wireless Industrial Sensor Networks (WISN) are used in process field device networks to monitor temperature, pressure, levels, flow or vibrations. The petrochemical industry uses WISN in oil and gas fields and plants around the world.</p><p>Both IEC ratified standards have been commonly praised by the ICS industry for their security features, including strong encryption on multiple layers within the protocol stack, resistance to RF interference, and replay protection. While the standards in general look safe on paper, there are potential interesting attack vectors that require verification. However, security research so far has not yielded any significant results beyond basic attack vectors. Often these attacks have only been theorized, and not (publically) demonstrated. In addition, vendor implementations have not been thoroughly tested for security by independent third parties, due to protocol complexity and the lack of proper (hardware/software) tools. We strongly believe in Wright’s principle, “Security does not improve until practical tools for exploration of the attack surface are made available.”</p><p>This presentation will fill this gap by providing the necessary building blocks to perform more in depth security analysis of WISN, and provide tools to perform practical attacks against these wireless networks in order to verify resistance to real world attacks.</p><h4 id=\"type-of-presentation\">Type of presentation:</h4><p>Presentation, including demonstrations of the attacks</p><p>Aim of the presentation:</p><ul>  <li>No expensive equipment is required to sniff and interact with WISN technology allowing a larger group of security researchers to assess the security of these critical infrastructure components.</li>  <li>Asset owners should familiarize themselves with risks involved when using WISN technologies in industrial environments. The configuration of existing installations could be verified to further improve the security.</li>  <li>Asset owners are advised to be reluctant in applying WSN technology for control and functional safety applications, as this seems to be trending at the moment.</li></ul><p>Target audience: technical specialists and asset owners of OT environments</p>"
},









































































































































{
	"description": "<p>The TRISIS/TRITON/HatMan malware represents the first time that a rootkit was used against a programmable logic controller. In this talk, we will dive deep into several major PLC brands and ask the questions: Could TRISIS happen here? And if so, how easy or difficult would it be for an attacker to have the same effect?</p><p>The talk will detail the ladder logic programming and compilation systems from several vendors, and provide results of testing for ladder logic privileges and privilege escalation issues. This will include, where possible, reviewing the CPU used in each PLC, showing what security features the CPU has, and finally showing results of loading weaponized ladder logic into the PLC for execution. This will also cover in some limited depth the ladder logic transfer protocol used by each controller.</p><h4 id=\"target-audience-\">Target audience ­</h4><p>Technical researchers, low­level engineers for vendors, and low­level protocol analysis</p><h4 id=\"key-takeaways\">Key takeaways</h4><ul>  <li>For end users, they should walk away with questions to ask their vendors. For PLCs vendors, they should ask, ‘Is this type of attack in your threat model, and how are you dealing with it?’. For their security vendors, they should ask, ‘Are you able to carve logic updates and perform any level of analysis on them in your security system?’</li>  <li>For vendors, they key takeaway should be: This type of attack should be in your threat model.</li>  <li>For security researchers and vendors, the key takeaway should be: We should research tools to monitor and prevent malicious logic updates. This might require more research into static code analysis, and will likely require some cooperation from the vendors.</li></ul>"
},



{
	"description": "<p>As we respond to attacks on connected industries, control systems, and computer systems we have learned the value of digital forensics. The art of identifying an attack, collecting traces and recovering compromised data is an essential part of the cleanup process and evidence collection. A wellperformed forensic investigation also gives insights into how products can be improved upon, and how similar attacks can be more efficiently detected in the future.</p><p>The increased complexity of attacks, more creative obfuscation of malware, and highly motivated threat actors puts increasing demands on security researchers, and requires us to refine our forensic methods. We want to enable the potential of digitalization of our society while remaining robust with respect to cyber threats. According to the Swedish National Council for Crime Prevention, IT-related crimes grew almost tenfold in Sweden between 2006 and 2015, and the UK National Crime Agency and Strategic Cyber Industry Group reported in 2016 that cybercrime accounts for 53% of all reported crime in the UK. Ransomware attacks, for instance, can lead to costly outages or disrupt critical functions in society.</p><p>Digital forensics is a key area in which we have to be in the forefront. As a consequence of this, a newly formed initiative based in Linköping, Sweden has been formed in order to facilitate new developments in this area. Called the Digital Forensics Competence Center (DFCC), the aim is to focus efforts across industry, academia and governmental agencies toward better and more robust digital forensics. In addition to Sectra Communications, partners that make up the DFCC include two departments at Linköping University, the Swedish National Forensic Centre (NFC), the Research Institutes of Sweden (RISE), Halmstad University, Ericsson, Saab, plus many others.</p><p>In my talk I will discuss why cooperation between the public, academic, and private sectors is key in building a connected society that is resilient against attacks on connected infrastructure. I will discuss the role of the DFCC and how it will benefit the ICS community. Next, what current trends in digital forensics can we identify? Specifically, how can improved forensic techniques be used to prevent and detect attacks on connected industries?</p><h4 id=\"target-audience\">Target audience</h4><p>Industry professionals who want to learn more about forensics.</p><p>The audience should expect to learn about new methods that can be applied in forensics. No specialprerequisites should be needed.</p><h4 id=\"key-takeaway\">Key takeaway</h4><p>Cooperation between public, private and academic sectors! Digital forensics is beneficial for the ICS community.</p>"
},



{
	"description": "<p>The presentation will be geared towards asset­owners, primarily from the manufacturing sector. However, other industries may also benefit. I intend to present how we, as an asset­owner, are approaching the challenge of securing our Manufacturing Execution Systems (MES). I will briefly discuss what an MES system is and why do most manufacturing industries need it.</p><p>An MES system bridges IT and OT networks ­­ it interfaces with ERP on the IT side and Automation layer (PLCs, etc.) on the OT side. And also interfaces with Laboratory and other systems at the same level. I will briefly go into the reasons why the MES needs to talk to both IT and OT. And how it is the air­gap myth­buster!</p><p>As an MES is exposed to the IT side, and hence indirectly to the Internet, it is critical we secure it. I will discuss how careful network segmentation will help in this cause.</p><p>OPC is a common protocol used by most MES systems for interfacing with various Automation systems. I will discuss our attempts at securing our legacy OPC­DA communication interfaces, and how we migrated to and are securing our current OPC­UA interfaces. Will go into security features afforded by the OPC­UA specification and how just moving to OPC­UA does not guarantee security.</p><p>In addition, I will present other security controls that may be deployed to increase security posture of a MES system.</p><p>Finally, I will end the presentation with the argument for absolute need for developing strong and verifiable disaster recovery plans (DR) and business continuity plans (BCP) for when MES goes down. And what would such a BCP typically comprise of.</p>"
},





{
	"description": "<p>In industrial applications process control discipline involves monitoring and controlling of machinery, systems and physical processes to make sure that production processes are carried out efficiently, consistently and little variation. Monitoring is an integral part of plant operations and no OT environment is imaginable without local or control room HMIs and human operators. Increasingly, process industries take additional advantage of various optimization application for detection of abnormalities and early indicators of deterioration. In contrast, when it comes to supporting communication infrastructure (networks and end-points), they are frequently expected to be implement and configured in 110% reliable and secure way that no monitoring for deviations or breaches would be necessary. Ugh.</p><p>However, the purpose of this talk is not to discuss the terrible and unfair negligence of OT communication infrastructure when it comes to monitoring. Instead, we will use the case of “monitoring” function to help professionals from two distinct worlds, IT and OT, to realize their similarities beyond sharing hate for filling in timesheets. On the example of two distant jobs such as SOC analyst and Control Room operator, we will show how their jobs are fundamentally the same. Throughout the talk we will cover similarities and differences in key areas such as:</p><ul>  <li>Vocabulary,</li>  <li>SIEM vs. HMI applications,</li>  <li>Alarm configuration and response; alarm management,</li>  <li>Logging and log correlation; historian functions,</li>  <li>Types of anomalies/events/threats,</li>  <li>Event/incident root-cause analysis,</li>  <li>Incident response,</li>  <li>SOPs, etc.</li></ul><p>It is hopeful that by the end of the presentation, IT and OT professionals will develop a solid respect for each other the job functions and feel encouraged to discuss common matters. It is also hoped, that OT experts become conscious about value of log collection and network monitoring in their environments and will be more collaborative when asked to configure a mirror port on an industrial switch.</p><h4 id=\"target-audience\">Target audience</h4><p>IT and OT professionals who would like to know more about each other worlds</p><h4 id=\"key-takeaway\">Key takeaway</h4><ul>  <li>Monitoring is the process of providing a feedback loop into the state of object under observation. The process of monitoring physical processes and communication infrastructure are fundamentally similar.</li>  <li>OT domain has more mature body of knowledge and better-established processes when it comes to alarm management, work place and GUI ergonomics and cognitive performance. Experience exchange could be beneficial for a “younger” SOC function.</li>  <li>Short-term job rotations could help IT and OT professionals to better understand and appreciate specifics of each other jobs, enable cross-learning and for-real effective IT-OT conversion.</li></ul>"
},



{
	"description": "<p>During implementation of protocols in a communication stack usually only positive testing is performed to verify the conformance to the standard, especially for ICS protocols. Negative testing as part of the development process is often not applied. Therefore, it remains unknown how the stack or entire component is reacting on invalid, random or unexpected data. This talk will introduce robustness tests on IEC 61850, an ICS protocol that is used in digital substation communication. IEC 61850 is a modern and highly complex protocol stack and therefore provides a high attack surface.</p><p>The talk contains an introduction on IEC 61850 and describes the fuzzing approach together with details on how these tests are performed using a mutation-based fuzzer utilizing the XML based “Packet Description Markup Language” (PDML). It will also provide insights of difficulties encountered by performing those tests and how they have been circumvented. The audience will also learn what kind of attack vectors arise from thosevulnerabilities.</p><p>As part of the talk, anonymized fuzzing results are presented from day-to-day ICS security audits as well as a live demonstration of the fuzzer is given.</p><p>This talk will provide in depth technical details and is primarily meant for security professionals in the area of industrial control systems and substation automation.</p>"
},



{
	"description": "<p>Project files are the blueprints of the industrial process, these files can contain network configuration, screen definitions, hardware and software configurations and the actual automation logic of the controllers.</p><p>Access to the project file means access to knowledge on the most important and secret elements of the production floor.</p><p>Because of their sensitivity, these files should be kept in a well-secured manner like an internal vault, but due to the growing need to share and collaborate with suppliers it’s hard to keep track and the data might end up in the wrong hands.</p><p>In our research we have discovered a large amount of highly confidential industrial data located on the internet.</p><p>The data contains multiple manufactures, suppliers and orchestrators from different sectors and geographical locations. The amount and spread of the data and companies leads us to believe that this is not a one time event or incident but a systematic issue.</p><p>In the presentation we will:</p><ul>  <li>Explain the basic components and structures of some project files</li>  <li>We will explain how the research was performed.</li>  <li>Explain about the threat landscape connected to this data and explain about the inherent insecurity of the supply chain</li>  <li>We will showcase how an attacker might use this data to target a company and use the data from the files to successfully affect the operation of the process</li>  <li>We will showcase what can be derived out of the automation logic, both by noting past research works that have been done on this topic and by proposing new possibilities</li>  <li>We will share statistics about the amount of companies, sectors and geo locations of the affected companies</li>  <li>We will propose a few options for the potential sources of the leaks</li>  <li>We will discuss the different security methods a victim should apply</li></ul><h4 id=\"type-of-target-audience-\">Type of target audience –</h4><ul>  <li>Knowledge in automation &amp; risk management – advantage</li></ul><h4 id=\"audience-should-expect-\">Audience should expect –</h4><ul>  <li>Understanding a threat intelligence research process</li>  <li>Understanding of the threat involved with this kind of leakage</li>  <li>A clear rundown of potential attacks on OT environment</li></ul><h4 id=\"key-takeaways-\">Key takeaways –</h4><ol>  <li>Security guidelines for protecting critical OT data</li>  <li>Security guidelines for securing the supply chain process</li></ol>"
},



{
	"description": "<p>Back in October 2018, “Bloomberg” recounted a Chinese supply-chain attack on Supermicro motherboards used in servers for Amazon, Apple, and more than 20 other companies. <a href=\"https://www.bloomberg.com/news/features/2018-10-04/the-big-hack-how-china-used-a-tiny-chip-to-infiltrate-america-s-top-companies\">the-big-hack-how-china-used-a-tiny-chip-to-infiltrate-america-s-top-companies</a></p><p>Here is how I replicated it, on a Cisco firewall, with a shoestring budget, and how you can too.</p><p>This presentation will explain how I built and installed an implant chip on an industry-standard firewall, allowing the creation of privileged accounts, network access, and covert notification of successful compromise.</p><p>We’ll also discuss possible defenses and how to decide if you should be concerned about this class attack in your environment.</p><p>This talk will lead the audience through the chip selection process, the tools required to develop the attack (both hardware and software), and their use.</p><p>The techniques explained can be used on a variety of I.T. and O.T. equipment as well.</p><h4 id=\"target-audience-expectations-and-key-takeaway\">Target Audience, Expectations, and Key Takeaway:</h4><p>Audience: Security professional interested in supply chain “chipping” attacks of equipment</p><p>Audience takeaway will include the ease of creating “chipping” attacks on a small budget, the developmental steps, defences against such attacks, and understanding of why you likely don’t have to worry about them yet.</p>"
},





{
	"description": "<p>This presentation will discuss the different issues relating to the fact that systems for critical infrastructure and industry are in the midst of a revolution with many technologies that require connectivity, such as Industry 4.0. The presentation will go through a scenario with an industry that has implemented many, if not almost all of the features, of an Industry 4.0 implementation; in which nothing is impossible and there is not a tin foil hat in sight. When the stage is set we will have a more adversarial point of view and go through the new different attack vectors that are introduced as well as how they can be exploited. Finally advice will be provided on how some of the new threats can be mitigated and what to do.</p><p>I define Industry 4.0 in three categories, how to connect data, how to process data and how to store data, all in big amounts. My perspective comes from starting my carrier as an system and automation engineer who worked extensively with optimization, building plant simulators and analyzing big amounts of data with neural networks before big data and machine learning were buzzwords, to later move to work with IT security at the Swedish CERT. This gives an unique view of how the industry has evolved and will evolve. This is combined with current work in IT security incidents, related to both ICS and administrative systems, giving a broad perspective of the attacks that are going on today. I will also look at statistical data today, and to what kind of systems and versions, are installed in each layer of the Purdue model.</p><p>Below are some of the different subjects that will be discussed during the presentation divided into the three main pillars om Industry 4.0</p><p>How to connect data</p><ul>  <li>How are ICS doing compared to OWASP IoT 2018?</li>  <li>Can unsigned live on internet?</li>  <li>Life cycle management with embedded system and what is hidden in there?</li>  <li>Web servers</li>  <li>Firmware</li>  <li>We are halfway between Y2K and Y2K38, whats next?</li></ul><p>How to process data</p><ul>  <li>Outdated operating systems, and the increase of that number with Windows 7 and Windows Server 2008</li>  <li>DevOps in the world of ICS</li>  <li>The challenge of aggregation</li></ul><p>How to store data</p><ul>  <li>Can ICS move towards MongoDB, Hadoop and so forth?</li>  <li>HMI and store process data in the cloud</li>  <li>The unnoticed dependencies</li>  <li>New attack vectors such as speculative execution attacks and container break out</li></ul>"
},



{
	"description": "<p>Patching known security vulnerabilities is one of the most essential task in any OT security program. Utilities having large number of patches to be applied in various cyber assets, use CVSS (Common Vulnerability Scoring System) metrics of the vulnerabilities to prioritize in applying patches. This prioritization however doesn’t serve well the purpose of patching at all times, particularly in OT industry; the reason being that CVSS has not been designed with OT security in mind. A low scored vulnerability that left unpatched can bring in high-risk to the OT environment. Environmental metrics have also similar challenges. Moreover, finding a single scoring system that fits every utility doesn’t seems to be realistic; at least in near future. Hence, there is clearly a need for a better approach to prioritize among various patches, that should take the cyber-physical impact on OT also into account.</p><p>This presentation illustrates a few examples of vulnerabilities and their respective CVSS score, in order to understand why these may fail to reveal the real impact to the ICS environment. Also, exhibits a possible better approach for prioritizing patch irrespective of the vendor provided score. For each asset in an OT ecosystem that has a specified functionality, the top priority would be to secure the functionality. For example, the functionality could be that a controller sending critical command to the field device or a HMI which displays the actual field data. This approach serves the purpose of securing the functionality of the OT system rather than focusing on confidentiality, integrity and availability.</p>"
},







{
	"description": "Coming Soon."
},



{
	"description": "This presentation will cover and explain what TSCM (Technical surveillance Counter Measures) a.k.a. \"Bug sweeping\" is, how it is performed, the tools, the methodology and how not it shall be performed. The presentation and on stage demo will show how hard and complex the procedure is and to educate persons and organizations to procure and understand the subject. But most importantly to expose those who do it as a secret \"voodoo ritual\" just to make money."
},



{
	"description": "My presentation will touch on a few moral dilemmas that you face when you discover a critical vulnerability in ICS/SCADA environments. I will also discuss how my discovery was handled by the system supplier and how things could have played out differently. Another key take-away is how you as an asset owner can act to mitigate, and live with, a known serious vulnerability in your critical infrastructure. A problem that my customer and I had to face for over four years. The presentation will be of interest to suppliers, asset owners, and security researchers alike.The story begins several years ago when I stumbled upon what I suspected was a remote authentication bypass in a component in a SCADA system. I came in very late in the project and was hired as a consultant to replace the IT representative of my customer at a system SAT, since he was going on parental leave. We did a few crude tests and verified that we could bypass authentication and asked the supplier to fix the problem. A few months later they came back with a new version that allegedly was flawless. I was asked to verify the fix and was handed the system on virtual machines.Using passive methods (mainly Wireshark) I discovered that the problem was far worse than we initially suspected. The security architecture was something from the 80’s and I was able to reverse engineer the protocol and make the system hand over the keys to the kingdom... We went back with this information to the supplier and they tried to downplay the problem. It was hard to exploit and required deep technical skills etc... I got upset and wrote a 30 line POC in python that owned the system and sent them a screenshot.My customer wanted to tell their colleagues within Swedish national critical infrastructure, and I was on my way to Stockholm to inform Svenska kraftnät’s security manager. That’s when the lawyers came. We discussed the handling of the information intensely over a few weeks, but finally my customer decided that the information was classified, and I had to cancel my trip.Now my customer (where I also was employed a few years during this debacle) finally has received a new product to replace the broken system (not really a new product, just more lipstick on the same pig, but with a new fancy name). The problem seems like it is handled, and I think it is time to tell the story.I will end my presentation with a demo of my tool for testing for this vulnerability. At least I hope to have something that could be called a tool at the time of the presentation, otherwise I’ll demo my POC code which is spectacular enough.The presentation is not deeply technical but will sometimes drop down on the wire and take a cursory glance at protocols. The main focus is on disclosure, risk management, and how suppliers not should handle vulnerability reports. And, as a serial crowd pleaser, I will throw in a demonstration to boot."
},



{
	"description": "The session will propose an OT security engineering thought model which empowers automation engineers to take responsibility for their own systems’ security in a technically sound, systematic, and pragmatic way.The thought model consists of four layers: The function layer includes analyzing and use case-based modelling of functional requirements an OT network and its elements need to fulfill. Proper operation of these use cases is taken as security objective. The risk layer takes the identified use cases and for derivation and evaluation of “abuse cases” forming threat scenarios. The third layer is about identifying security requirements, which are state of the art, compliant with necessary standards, and taking into account the organization’s existing processes. The uppermost layer deals with implementing these systematically derived security requirements.Taking into account that in plant engineering and operation security requirements are never in focus, but always need to be wrapped around plant functionality and plant operators’ busy workdays, security engineering desperately needs to be efficient.Also, when security by design is to be taken seriously, security engineering must be integrated in the existing plant engineering process, making use of tools and data formats engineers use anyway.For these reasons, the presentation does not stop at introducing the thought model but shows how this thought model can be transferred into a machine-readable representation – a data model. The data model is not meant to take decisions away from automation engineers by boasting AI capabilities, but is designed to facilitate a more informed, smoother security engineering process.The data model poses two advantages within the security engineering process:First, it simplifies creating and visualizing network models and use cases, which serve as input for the outlined security engineering process.Second, it sets the basis for (partly) automating the implementation of security solutions, by defining security characteristics of modelled entities which may result from the security engineering process. This also includes the opportunity to make configuration management “security-sensitive” by adding information like security requirements a certain configuration fulfills and risks a certain configuration mitigates.The presentation outlines how existing tools may assist during the security engineering process: Asset discovery and inventory tools can provide the basis for network and use case modelling. Configuration management tools may help to roll out and maintain security-relevant configurations.Still, many plant operators, integrators, and vendors are understandably reluctant to become dependable on such rather expensive tools.Therefore, the presented data model aims at making use of efficiency gains that existing network inventory and configuration management tools promise without becoming too dependable on a certain tool vendor’s product. In order to achieve that, it makes use of well-established, non-proprietary description languages and data formats like AutomationML, OWL, and OPC UA. Thus, the proposed data model may serve as an open interface between existing, proprietary asset inventory and configuration management tools and the security engineering process."
},









{
	"description": "In 2018 we disclosed a total of 10 vulnerabilities to 7 independent industrial radio remote-control vendors. Our findings boil down to being able to control any equipment connected via these type of radio remote-control systems. So far, we focused our reports and speaking engagements on reaching out to as many people as possible, to increase awareness about the problem. At this time, we want to share stories about how we were able to perform the research and achieve the results with a globally dispersed team looking at global radio vendors.This talk will focus on the \"backstage\" of this research, that is:* how we started it and why we selected this class of systems* how we selected the vendors out from our extensive market search* how are these systems built, and how we figured this out* for two systems in details, we will describe\t* how to approach them from a reverse-engineering standpoint\t* how to interpret their RF protocol\t* what tools are needed for an in-depth reverse engineering\t* why we needed to come up with our own tools for certain corner cases (e.g., tricky modulation schemes)* how the disclosure process went\t* what challenges we found along the way\t* what were the vendors' responses (Vendors will not be called out for bad responses by name)\t* what is the status of the vulnerabilities now – lookout on future research trends in this spaceWhile the project was a success the road to get there, was very bumpy due to things that all researchers face. We will also discuss how we overcame some of the obstacles, such as identifying the chips, micro soldering with non-professional equipment, reversing unreliable radio signals caught over the air.#### Target audienceTechnical, with the understanding of embedded systems and sub-GHz radio communication."
},





{
	"description": "The PCILeech direct memory access attack toolkit was released three years ago and quickly became popular amongst red teamers, governments and game cheaters alike. We will demonstrate how to take total control of up-to-date still vulnerable systems with PCIe DMA code injection using affordable FPGA hardware and the open source PCILeech direct memory access attack toolkit.MemProcFS - The Memory Process File System is memory forensics made super easy! Analyze memory by clicking on files in a virtual file system or by using the C/C++/Python API. Analyze memory dump files by point and click, analyze and edit live memory acquired using PCILeech PCIe FPGA devices or even live memory acquired in real time from remote hosts over the network. Zero-cost, open source, fast and super-easy to use memory forensics!"
},






]}