{"speakerList":[




{
	"description": "<p>Most SCADA protocols have no security, but will continue to be used in ICS for many years to come. The recent “Industroyer” malware has underscored this lack of endpoint security in most industrial networks. Defense-in-depth must now include components cryptographically proving their identity to their network peers to increase difficulty for attackers, especially automated malware.</p><p>SSP21 is an open source development effort to create a modern secure encapsulation layer specifically for industrial control system protocols.  SSP21 is intended to fill a technology gap where existing technologies like TLS are not applicable, namely for serial communication channels and endpoints with limited bandwidth and/or processing capabilities.</p><p>Our specification includes a production-ready reference implementation that has been developed iteratively alongside the specification.  We see this iterative process of design, implementation, and testing as crucial to creation of good standards. The reference implementation also include a proxy</p><p>This presentation will cover the following topics:</p><ul>  <li>SSP21 modes of operation (pre-shared public key vs PKI)</li>  <li>Improvements vs TLS/x509 in ICS</li>  <li>Key differences between SSP21 and past efforts to create secure SCADA protocols/wrappers</li>  <li>Details of the SSP21 secure encapsulation layer    <ul>      <li>Modern cryptographic primitives</li>      <li>Authenticated ECDH key agreement</li>      <li>Time-protected authenticated sessions</li>      <li>The “industrial certificate format (ICF)”</li>    </ul>  </li>  <li>Key management in SSP21 systems, including revocation schemes</li>  <li>Results from laboratory testing at San Diego Gas &amp; Electric</li>  <li>SSP21 public release status</li>  <li>Progress with industry partners and vendors</li></ul><p>SSP21 is sponsored by California Energy Systems for the 21st Century (CES21).</p>"
},





{
	"description": "<p>This paper unveils some of the reasons for and the types of security concerns associated with Internet of Things, and some recommendations that device manufacturers should keep in mind while manufacturing IoT enabled devices and designing IoT interfaces.</p><p>Highlights of presentation are:</p><ol>  <li>Gaining the shell on kankun smart plug</li>  <li>View real time streaming of dvr without authentication</li>  <li>Controlling a victim’s BLE smart bulb</li></ol>"
},



{
	"description": "<p>PLCs are playing a major role in critical infrastructures. Similar toother computer systems PLCs are vulnerable to code-reuse attacks.Compromising these devices in a critical environment constitute asignificant security and safety risk.</p><p>Code-reuse mitigations previously suggested for general-purposecomputers. However, there are specific PLC specific constraints thatwere never addressed in other code-reuse mitigation systems ingeneral-purpose computers.</p><p>Firstly, PLCs are embedded systems that are extremely heterogeneousconcerning the processing power. Secondly, the PLC vendors tend toprocure third party software only available in Commercial Off-The-Shelf(COTS) binary form. Finally, one cannot rely on the presence of anyparticular hardware, hardware-facilitated functionality orhardware-specific features for a memory corruption mitigation approachin the PLCs.</p><p>In this presentation, we introduce an open source code-reuse mitigationsystem for PLC binaries. Our system addresses the performance diversity(the first constraint) of the PLCs by providing configurable protectionpolicies, that can be tailored to the specific system. Also, our systemprotects COTS binaries (second constraint) without relying on thecontrol-flow graph and can work with hardware-agnostic cryptographicallysecure shadow stack.</p><p>To the best of our knowledge, no memory corruption mitigation approachfor embedded systems in general and specifically for the PLCs, addressesall limitations mentioned above.</p><p>For evaluation of our work, we choose ARM since it is a commonarchitecture in the PLCs. Our evaluation shows that our code-reusemitigation system provides its protection with a limited performanceoverhead for COTS binaries of the PLC.</p>"
},



{
	"description": "<p>Industroyer is unique and extremely dangerous malware designed to disrupt critical industrial processes. This malware was involved in the December 2016 attack on Ukraine’s power grid. What sets Industroyer apart from other malware targeting infrastructure, such as BlackEnergy (a.k.a. SandWorm), is its ability to control switches and circuit breakers directly via 4 different industrial communication protocols. As the protocols and hardware targeted by Industroyer are employed in power supply infrastructure, transportation control systems, and other critical infrastructure systems, like water and gas, worldwide, this discovery should serve as a wake-up call for those responsible for security of these critical systems.</p>"
},



{
	"description": "<p>Introducing the honeypot project, which will be an open source project, allowing anyone to run a small honeypot in their network. The idea of this project is to let anyone clone the git repo and then setup his own IoT honeypot anywhere using Docker virtualization platform. The project will be announced for the first time at your conference, as I’m still polishing right now.</p><p>Showing the latest attacks captured by the honeypots that are deployed mostly in Romania, in residential networks. The main assumption is that attackers are actually avoiding honeypots running in main VPS providers ASNs / IP ranges and are actually targeting residential networks. So I did just that: installed honeypots in 5 big Romanian ISPs. They account for more than 80% of all RO residential networks. The moment we installed these honeypots, we started seeing attacks. They were not just a few, so I will discuss about trends: for example how attackers are reacting to publicly released new 0day exploits by improving the attack methods. I will present a comprehensive view and the current attack trends at global scale ( data provided by honeypots installed all around the world) and at a country level (data provided by the honeypots installed in Romanian residential networks).</p><p>Once we collected network attacks I started checking the payload or bash commands the attackers were sending. This allowed me to fetch some fresh/interesting samples (this part was not presented at SAS due to time constraints). I will talk about these samples as well.</p>"
},



{
	"description": "<p>This presentation aims at helping people setting up an internal “insider threat detection/prevention” program without looking at the big/expensive products out there. This presentation mainly shows how (sometimes simple) things and tricks can be used to tackle the insider threat within ICS environments. Before digging into the possible things to be done, a small recapitulation on what an insider is, is given. The DIY is meant to be done without (heavy) use of large and sometimes expensive toolsets and covers aspects like baselining environment and users. And what interesting set of information should be taken into account to increase detection ratio of insider threats (physical, network, system and user level). Preventing insider threats is influenced by network zoning, hardening, physical walkthroughs etc…</p><p>Free tooling such as arp detection, scanners, the FOSS project will be included in the presentation to indicate where these can be effectively used for threat detection/prevention.</p><p>All this will be with ICS environments and the inherent problems theirin in mind. A pragmatic approach will be shown perform insider threat detection/prevention within ICS without having to spend big money on it (except for time necessary to do/setup things).</p>"
},



{
	"description": "<p>ENISA’s Cyber Security Training material was introduced in 2008, and has grown continuously ever since. This training content comprises of essential material to develop skills in the Incident Responders community and in the field of Operational Security. The ENISA CSIRT training material covers four main areas:  Technical, Operational, Setting up a CSIRT and Legal and Cooperation.</p><ul>  <li><a href=\"https://www.enisa.europa.eu/topics/trainings-for-cybersecurity-specialists\">https://www.enisa.europa.eu/topics/trainings-for-cybersecurity-specialists</a></li></ul>"
},











































{
	"description": "<p>ENISA will publish in the coming months  Baseline Security Recommendations for IoT and recently launched the ENISA IoT Security Experts Group.</p><p>ENISA defines Internet of Things as an emerging concept describing a wide ecosystem where interconnected devices and services collect, exchange and process data in order to adapt dynamically to a context. Internet of Things is tightly bound to cyber-physical systems and in this respect is an enabler of Smart Infrastructures by enhancing their quality of service provisioning.</p><p>The upcoming report builds on previous work by ENISA, covering the areas of:</p><ul>  <li>Smart Homes</li>  <li>Smart Cities and Intelligent Public Transport</li>  <li>Smart Grids</li>  <li>Smart Cars</li>  <li>Smart Airports</li>  <li>eHealth and Smart Hospitals</li></ul><p>Link: <a href=\"https://www.enisa.europa.eu/iot\">https://www.enisa.europa.eu/iot</a></p>"
},



{
	"description": ""
},



{
	"description": "<p>In many industries Safety Instrumented Systems (SIS) are considered the last line of defense to prevent catastrophic events – even if control over a facility is lost - SIS have to prevent damage for human and environment by forcing the process to a defined safe condition.</p><p>Taking into account the recently becoming known attempts to disrupt Critical Infrastructures the expectations into the capabilities of SIS are quite high. But with the progressing integration and merging of IT and OT even specialized SIS couldbe using standard hard- and software which might be compromised more easily. Additionally the personnel used to dealing with functional safety usually are no IT security experts and are being confronted with a whole new ruleset where the protection goals are different to IT and OT! While in IT confidentiality usually is the primary goal, in OT it is availability, but Integrity being the most important in SIS is often considered subordinate.</p><p>Practical adaptation of normative requirements (like IEC 61511 and ISA-TR84.00.09) are currently quite vague. This talk will present the result of over a year’s work of NAMUR* and BSI which lead after controversial discussions to a thorough, yet practical approach to define state of the art procedures and best practices.</p><p>*NAMUR, the “User Association of Automation Technology in Process Industries”, an international association of user companies (established in 1949) which represents their interests concerning automation technology had established a working group dealing with these questions.</p>"
},



{
	"description": ""
},



{
	"description": "<p>Adopting a critical examination of ICS infrastructure and communication channels provides defenders with a means to prioritize and focus network protection.</p><p>By identifying network ‘key terrain’ and focusing operations on these critical path nodes, defenders can significantly reduce freedom of movement for adversaries and reduce the time from initial compromise to detection. Ultimately, by ‘knowing the network’ and having an understanding of attacker methodology, ICS network defenders can take the initiative in a cyber breach or attack scenario away from the attacker and empower critical infrastructure defense. To illustrate these concepts, the above will be discussed in light of two recent threats to the ICS environment: the wormable, ETERNALBLUE-employing ransomware WannaCry; and the electric grid-targeting malware CrashOverride/Industroyer.</p>"
},



{
	"description": "<p>During a prolonged incident response contract with a customer, mnemonic was able to study an APT actor closely over a time span of six months.</p><p>During this talk you will be given the result of an analysis of over 12.000 commands issued by the attacker, with some surprising insights into adversary operator behavior.</p>"
},



{
	"description": "<p>Full control!The international focus on industrial control systems, whether it´s SCADA, local control or PLCs are high.</p><p>The hardware and software components that are the core of these systems, our most sensitive and critical infrastructure, are increasingly protected, and the management presents the new and great security solutions and -plans. Safe as the bank of England!</p><p>Or have we forgotten a back door? Do all the technicians, system owners and managers know the different systems that support the control systems how they are connected? How do you get into critical infrastructure through support systems? How can these systems affect and take down critical infrastructure? How do you get into a building with the help of the telephone system? These are the systems that often get the least attention, but that can be a way in which to create imbalances in our critical infrastructure or allow for unauthorized access.</p><p>In this presentation you will be presented for case studies and reviews showing how to utilize support systems in critical infrastructure.</p>"
},





{
	"description": "<p>The concept that we are in one country and the network stops at the border, is not the case for a Multinational Corporations. MNCs face the same typical challenges to industrial security as a regional facility, amplified over the cultural, language, legal and geographic boundaries of regional centers. As industrial facilities become further digitalized and enter Industry 4.0, the importance of security of the SCADA/ICS systems cannot be ignored. Many countries are recognizing this by implementing industrial control relevant laws to enforce cybersecurity standards and best practices. This means the multinational corporation must institute cost efficient strategies which encompass compliance with international standards and local regulations.</p><p>The presentation highlights best practices for a successful development and roll out of industrial cybersecurity program based on our experience with MNCs. Unique challenges specific to MNCs are examined and explained. The work also describes the major phases of implementing a cybersecurity plan for a MNC across several regions, from asset identification and risk assessment, guideline/policy development, awareness training and rollout, monitoring center to governance and follow-up auditing, and built-in lifecycle protection measures.</p><p>Some region specific adjustments to the central program are presented and explained. The impact of reducing the attack surface after implementation of cybersecurity program at pilot plants is discussed.</p>"
},







{
	"description": "<p>The NIS Directive is the first piece of EU-wide legislation on cybersecurity. It provides legal measures to boost the overall level of cybersecurity in the EU. In the context of the NIS Directive, ENISA is assisting Member States and the European Commission by providing expertise and advice, as well as developing and facilitating the exchange of good practices.</p><ul>  <li><a href=\"https://www.enisa.europa.eu/scada\">https://www.enisa.europa.eu/scada</a></li></ul>"
},





{
	"description": "<p>Having investigated 15+ latest advanced cyberattacks that were organized since 2015 against Ukrainian critical energy and transport infrastructure, media, financial institutions and governmental authorities and caused serious consequences - from data exfiltration and damaging computer infrastructure to blackouts - we deeply studied each step of the attacks in detail, determined the specifics of the attack and developed a range of behavioral patterns to identify targeted attacks.</p><p>With a help of ThreatSCALET -  Sequence of Cyber Attack Lifecycle Events - framework our team of researchers at ISSP Labs has discovered how attacks grew in complexity for just last 3 years, and how the attackers developed a mature supply chain of diverse competences and powerful capabilities.</p>"
},



{
	"description": "<p>Stringing together the exploitation of several seemingly uninteresting vulnerabilities can be a fun challenge for security researchers, penetration testers, and malicious attackers.</p><p>This talk follows some of the paths and thought processes that one researcher followed while evaluating the security of several new “out of the box” Industrial Control System (ICS) and Internet of Things (IoT) devices, using a variety of well known exploitation and analysis techniques, and eventually finding undocumented, root-level, and sometimes un-removable, backdoor accounts.</p>"
},





{
	"description": "ENISA efforts focus on securing Europe's Information Society and therefore protecting citizens and transport infrastructures from cyber disruptions. ENISA since 2015 is helping transport operators and relevant actors in their own risk assessemnt with threat modeling, security measures and trainings for* Smart cities * Intelligent public transport* Smart cars* Smart AirportsThe goal is to ensure an higher level of cybersecurity and resilience of the European transport infrastructures.* [https://www.enisa.europa.eu/air](https://www.enisa.europa.eu/air)* [https://www.enisa.europa.eu/road](https://www.enisa.europa.eu/road)* [https://www.enisa.europa.eu/water](https://www.enisa.europa.eu/water)"
},









{
	"description": "ENISA is continuing the work on communication network dependencies in industrial infrastructures, focusing in this case on ICS/SCADA systems and networks. The main objective is to provide insight into the communication network interdependencies currently present in industrial infrastructures and environments, mapping critical assets, assessing possible attacks and identifying potential good practices and security measures to apply.* [https://www.enisa.europa.eu/scada](https://www.enisa.europa.eu/scada)"
},






]}