{"speakerList":[






{
	"description": "<p>Reverse Engineering is the process of identifying a software or hardware logic by investigating the software binary code or hardware behavior. Programmable Logic Controllers are one of the most (if not the most) critical embedded devices in the industry. PLCs can control almost all the crucial elements of an industrial process and are considered the ’brain of modern industrial control systems’. With recent advances in Industry 4.0, the concept of PLCs operating in an air gapped network became a myth. Thus, with growing accessability of these devices, vendors which historically did not have to worry about their product security, try to find shortcuts while working on improving the security of their product. In this talk, we will take a look into how some of these shortcuts might affect the vendors product security. We finally talk about few other PLC vendors which have similar functionality but are less critical. We end by taking a look at overall roadblocks on reverse engineering the PLCs to identify security issues or similar special access functionalities.</p>"
},







{
	"description": "<p>The talk will cover the basics of windfarms and their operations, I’ll briefly discuss prior research  in this area, noting that those findings are still valid today.  Then the core of this talk will focus  on identified security threats and their mitigations based on real life assessments.  The impact  these threats can have both in terms of windfarm operation and the physical damage that can  be caused.  I will show how physical and remote access to the windfarm can be gained, and by  investigating the vulnerabilities found, I will show that there is an over-reliance on security boxes  and buzzword solutions that has left general, basic, security hygiene lacking.  So much so that  that in some cases, not only have systems not been patched, but they were installed insecurely  in the first place.  I will then discuss the recent 2019 UK outage and the part played by  windfarms in that, from the initial outage to their impact on restoration as a result of how micro generation is modelled within control systems.</p><p>There will be two key takeaways from this talk. Firstly, I will be busting the myth that ‘cutting off  the supply’ is the most interesting attack that can be performed.  It is the most likely, and one of  the simplest attacks, but it is not the most interesting.  Secondly, I will cover a point often  glossed over in other talks.  When an attacker ‘takes control’ it is often simply left at that, as if  taking control was the ‘win condition’. This talk will cover some of the more interesting cyber physical attacks that can be performed on a wind farm and look at some of the ways that actual  physical damage could be caused.</p>"
},



{
	"description": "<p>Since at least 2017, we have observed an increase in public disclosures of ransomware incidents impacting industrial production and critical infrastructure organizations. This trend results from increasingly skilled threat actors moving from indiscriminate ransomware propagation to deliberate deployment of post-compromise malware. This increases the likelihood of substantial financial rewards, especially when targeted organizations have high-availability requirements and/or lack backup processes.</p><p>Despite this scenario, it is not uncommon for ICS/OT security professionals to consider ransomware as an out-of-scope threat. Although it is true that this type of malware typically only propagates across IT systems, OT asset owners are often the most affected by its impacts. We find three main reasons to share responsibility to address this threat:</p><ol>  <li>    <p>The main objective of ICS/OT is to facilitate and scale the production of specific goods or services to satisfy a certain demand. Ransomware at different levels of the enterprise architecture may directly or indirectly result in delayed, disrupted, or stopped production.</p>  </li>  <li>    <p>The growth of post-compromise approaches to ransomware situate the attacker at a privileged position where they can explore target networks and identify critical systems before deploying the payload.</p>  </li>  <li>    <p>The techniques, tactics, and procedures (TTPs) used for post-compromise ransomware resemble those employed by high-skilled actors across the lifecycle of past OT security incidents. Identification at earlier stages is only possible with collaboration between OT and IT security teams.</p>  </li></ol><p>In this talk, we highlight why ransomware is a relevant challenge for ICS/OT security practitioners, describe some of the main TTPs used by attackers for post-compromise ransomware, and share ideas for actionable ways to address this problem. We invite the audience to learn how to collaborate across the organization so the next time they need to talk about ransomware, they are not forced to delegate the task to the next available agent.</p><h3 id=\"type-or-target-audience\">Type or target audience</h3><p>No pre-requisites, should be interesting for the general audience as we have seen a variety of customers inquiring about this topic. We believe this topic would work well both for experienced security professionals looking for a deep dive, but also for other positions that seek to understand what the challenge is and what to do about it from an organizational level.</p><h3 id=\"what-audience-should-expect-from-the-presentation\">What audience should expect from the presentation</h3><p>The audience should expect to learn about the impacts of ransomware in industrial/critical infrastructure organizations, learn about past relevant cases, and take a deep dive into the TTPs that we have observed actors leveraging for post-compromise incidents.</p><p>One of the main strengths of the talk is that it will leverage knowledge from our organization responding to and understanding ransomware incidents, but it will also place the information in the context of ICS/OT.</p><p>It will also challenge some of the conceptions we currently have about the degree of collaboration between IT and ICS.OT security teams. Highlighting what can ICS/OT security teams do to address this challenge, mainly when it happens at different levels of the organization.</p><h3 id=\"key-takeaway\">Key takeaway</h3><p>Addressing the challenge of ransomware in industrial/critical infrastructure organization must be a shared responsibility. Even though there is no impact in the controllers, ransomware infections oftentimes result in direct or indirect delays and disruptions to production.</p>"
},





{
	"description": "<p>Last year we performed a security analysis on a testbed smart manufacturing system using a variety of “unconventional” attack vectors. Striving to think very much outside the box, we wanted to understand which overlooked conditions and attacker capabilities make certain attacks possible, and their consequences.</p><p>Through concrete PoCs, we’ll describe what unconventional attack vectors and very creative attackers can achieve, as well as how they can be stopped by current security solutions.</p><p>We’ll first show how a remote attacker can indirectly compromise an engineering workstation to backdoor the automation logic of an industrial robot. Then, we’ll reveal how the attack has been carried out via a malicious software extension that targets the simulation and offline programming (OLP) platform. The attendees will learn that such malicious extensions have full capabilities on the target system, but we’ll explain what they are and how they can be stopped.</p><p>Our second entry point is an industry-grade embedded device. These devices, often dubbed as “IIoT devices” offer great programming flexibility—compared to, say, PLCs—at the price of more responsibility for the programmers. The proliferation of customizable IIoT devices along with the many 3rd-party development libraries are the perfect target for software supply-chain attacks. We’ll show how we trojanized a simple temperature-measurement library to implement an ARP-based DoS attack, along with inaccurate temperature data-points, which can cause cascade effects down the data-processing pipeline. We’ll argue that detecting violations in the software supply-chain is hard in large, distributed enterprises, but their effects can be mitigated with proper network partitioning.</p><p>The last step of our security analysis focused on lateral movements to complex, programmable machines such as industrial robots. We observe that, movement-instructions aside, industrial robot programming languages have statements, loops, conditions, network sockets, serial communication, etc. With access to low-level system resources like files, network, memory, and peripherals, task programs are a powerful, overlooked payload. Not only we show that task programs are susceptible to input-validation vulnerabilities, we also show that they’re rich enough to implement malware-like functionalities, given that the runtime environment provides no resource isolation. As a result, task programs have unmediated access to the entire system.</p><p>We’ll share cases of vulnerable and malicious task programs, and how to discover such patterns, including some vulnerabilities we found in real-world code.</p><p>We conclude by discussing the remediation steps that can be adopted by developers and vendors to mitigate our findings in the medium and long term.</p><h3 id=\"takeaways\">Takeaways:</h3><ul>  <li>Learn that programming environments for industrial automation are extensible with plug-in systems (like many other software applications), which could be the weak entry point that can be exploited by using plug-ins as an attack vector.</li>  <li>Learn that the proliferation of customizable IIoT is creating the demand for faster (and more accessible) firmware development, which in turns makes 3rd-party development libraries an attractive target.</li>  <li>Learn that the languages used to program industrial robots, and possibly other machines, include features that can allow writing and hiding malicious or vulnerable code.</li>  <li>Understand why it’s essential to always contextualize attack vectors and vulnerabilities within the entire system: there are so many protection layers and humans in the loop, that could easily prevent a concrete attack from happening, without the need of complex defense solutions.</li></ul>"
},



























































































































































{
	"description": ""
},



{
	"description": "<p>Media hype concerning attacks on ““the grid”” abound - but just what would be necessary to achieve an at-scale disruption of electric utility operations in Europe or North America? This presentation will explore this issue focusing first on events that actually brought grid operations to their knees: the 2003 Italian/Swiss, US/Canada, and Denmark/Sweden blackouts; and the 2006 European blackout event. Based on these events (which were not cyber in origin), we will explore grid resiliency and how interconnections, inter-dependencies, and N-1 (sometimes also phrased as N+1) resiliency come into play for maintaining power operations.</p><p>Based on this discussion, we will then explore how a sufficiently patient, motivated, and resourceful attacker could either produce or take advantage of conditions to actually create large-scale outage events. The focus here is not on relatively short, geographically limited disruptions in service (such as 2015 and 2016 Ukraine), but rather potentially long-term or physically disruptive (or destructive events) across large regions. To explore this, we will discuss chaining cyber impacts with environmental or operational variability, and how potential attackers could utilize manufactured grid-level disturbances to produce negative outcomes. Specifically, this discussion will look at two frequency deviation events (one in Europe, one in the United States) in 2019 as actual examples of conditions that could be leveraged to achieve wider disruption.</p><p>Finally, this presentation will conclude with what actions asset owners, operators, and defenders can take to either detect or mitigate such events. First and foremost - greater visibility into operations and communications is necessary to both identify potential attackers as they move toward their objectives and what operational changes or alterations might take place when attackers initiate effects. However, this comes with an important caveat: in systems such as electric utility operations, no provider - from the municipal distribution authority through the multinational utility operator - is isolated and alone. Thus, truly identifying grid-scale attack attempts requires greater, faster communication and coordination among all stakeholders involved in an operational area. While truly grid-scale events induced via cyber remain theoretical at this time, adversaries are investing in the capabilities necessary to make such effects possible. Defenders will only be able to counter such moves through a combination of enhanced visibility, improved reaction time, and sharing information as quickly as possible with partner organizations.</p>"
},



{
	"description": "<p>As more and more devices are becoming cloud connected it is important to understand how this attack surface is different from traditional socket based server applications. There is no open port listening with a cloud connected application so there is additional work required in order to just get the application to accept attacker controlled data. This talk will walk through the initial steps necessary to even begin vulnerability research of the application. Cloud based control of physical devices has some security benefits compared to traditional socket programming but, at the end of the day there is an application running on a device that acts on messages from the cloud. This means that there is opportunity for bugs and vulnerabilities in the software responsible for handling cloud messages. This talk will describe changes in research methodology that are necessary for performing vulnerability research on a cloud connected application. Zero-day vulnerabilities found in a cloud connected application on a popular industrial controller will be covered in depth. These vulnerabilities will be demonstrated live by impersonating the industrial vendor cloud application, resulting in getting root from the cloud.</p><h2 id=\"outline\">Outline</h2><ul>  <li>Introduction</li></ul><h3 id=\"moving-to-the-cloud\">Moving to the cloud</h3><ol>  <li>Software stack, traditional vs. cloud connected</li>  <li>Additional security benefits of cloud applications    <ul>      <li>Libraries provided which include:</li>      <li>Authentication enabled by default (most times)</li>      <li>Encryption enabled by default (most times)</li>    </ul>  </li>  <li>Where are vulnerabilities most likely to be found?    <ul>      <li>In the actual handling of the message data, and the actions taken as a result Vendor code</li>    </ul>  </li>  <li>Challenges for Vulnerability research    <ul>      <li>Researcher doesn’t have access to application running in the cloud at least not source access</li>      <li>Authentication and encryption makes it difficult to MITM to observe traffic for research</li>      <li>Pre-work is necessary to even begin learning about the data format</li>      <li>Which is what we will go into next</li>    </ul>  </li></ol><h3 id=\"intro-to-the-industrial-controller\">Intro to the industrial controller</h3><ol>  <li>Azure IoT Hub client    <ul>      <li>MQTT based protocol</li>      <li>JSON data format</li>      <li>We will need to learn the exact format through research</li>    </ul>  </li>  <li>Azure IoT Hub    <ul>      <li>Running the industrial vendor cloud application</li>    </ul>  </li></ol><h3 id=\"protocol-overview\">Protocol Overview</h3><ol>  <li>MQTT Overview    <ul>      <li>Publish / Subscribe protocol</li>      <li>Client</li>      <li>Broker</li>      <li>Cloud Application</li>    </ul>  </li>  <li>MQTT Topics    <ul>      <li>Format</li>      <li>Examples</li>      <li>Wildcards</li>    </ul>  </li></ol><h3 id=\"research-methodology\">Research Methodology</h3><ol>  <li>Changes to Research Approach    <ul>      <li>Can’t connect to a port and start sending data</li>      <li>If you’re lucky you might have access to both applications and could capture data between them</li>      <li>Options</li>      <li>Configure the device to connect to a real cloud instance that you control</li>      <li>Stand up a “local” server pretending to be the cloud</li>    </ul>  </li>  <li>Test Setup - Real cloud instance    <ul>      <li>In this scenario the researcher must have access to configure connection properties with the cloud</li>    </ul>  </li>  <li>Test Setup - Local MQTT broker    <ul>      <li>In this scenario the researcher must have the ability to add a root certificate to the device. (will probably require root)</li>    </ul>  </li></ol><h3 id=\"industrial-controller-vulnerabilities\">Industrial controller vulnerabilities</h3><ol>  <li>Supported messages    <ul>      <li>Discuss device specific messages</li>    </ul>  </li>  <li>Discuss vulnerable message structure</li>  <li>Outline of vulnerable process    <ul>      <li>Discuss steps involved</li>    </ul>  </li>  <li>Vulnerability explanations    <ul>      <li>Discuss specific vulnerabilities</li>    </ul>  </li>  <li>DEMO (live)    <ul>      <li>Code Execution from the cloud</li>    </ul>  </li></ol><h3 id=\"conclusion\">Conclusion</h3><ol>  <li>Mitigations / Lessons Learned    <ul>      <li>Discuss mistakes to avoid when developing a cloud application</li>      <li>Discuss ways to mitigate with existing industrial control devices</li>    </ul>  </li>  <li>Review - Research Pre-work    <ul>      <li>Impersonating the cloud application</li>      <li>Local vs. Real Cloud instance</li>      <li>Learning the topic format</li>      <li>For both publish and subscribe</li>      <li>Learning the data format</li>      <li>Finding the data parsing code</li>      <li>From there it’s business as usual for vulnerability research</li>    </ul>  </li></ol><h3 id=\"target-audience\">Target audience</h3><p>Familiarity with programming and common bug classes</p><h3 id=\"audience-expectations\">Audience expectations</h3><p>Detailed description of vulnerability research methodology relating to cloud connected ICS devices.</p><p>Description of an attack chain combining multiple zero day vulnerabilities to gain root access to a cloud connected controller.</p><h3 id=\"audience-takeaway\">Audience takeaway</h3><p>Cloud connectivity provides many benefits to Industrial automation, but it also provides additional attack surface. Vendors should be mindful of untrusted data even if it comes from a cloud application.</p>"
},



{
	"description": "<p>Regardless of the type and scale of the vessels that we test in our security assessments there are a  set of common security issues that always seem to be present. Whether it’s a Moss Maritime CS55  deep water exploration drilling rig, a Neo-Panamax container ship, a re-supply vessel, a seabed  survey vessel, or a brand-new cruise ship on its shakedown voyage, some things just keep cropping  up.</p><p>We’ll talk about the distinct lack of understanding and interaction between IT and OT  installers/engineers on board and in the yard. The issue here is that OT systems are often accessible  from the IT systems and vice versa, often through deliberate bypass of security features by those on  board, or through poor design / poor password management / weak patch management.</p>"
},



{
	"description": "<p>The presentation will cover a walk through on how we have combined best practices for securing OT and IT environments, general and sector specific standards and guidance as well as the much debated Purdue model into a future-oriented flexible and scalable zone model for a multinational and multisite company.</p>"
},



{
	"description": "<h3 id=\"overview\">Overview</h3><p>The presentation will guide audience through a complete ICS attack vector aimed at compromising smart meters and advanced metering infrastructure. It will show how in a recent case study team of security researchers identified zero days in smart devices and vulnerabilities in other components of AMI architecture and leveraged those to simulate comprehensive attack scenario. The talk will show an overview of challenges of smart metering solutions cybersecurity in Europe.</p><h3 id=\"agenda\">Agenda</h3><ul>  <li>Smart meters design, architecture and role of firmware</li>  <li>Approach to reverse engineering smart meters firmware</li>  <li>Results of DLMS/COSEM protocol implementation reversing – examples of identified key vulnerabilities</li>  <li>Examples of common misconfigurations of 3G modems, PLC concentrators and serial port gateways</li>  <li>Exploitation of identified vulnerabilities in simulated attack on DSO (Energy Distribution System Operator) and end customer</li></ul><h3 id=\"target-audience\">Target audience</h3><p>Critical Infrastructure managing organizations, i.e. Power &amp; utilities representatives, especially: executive managers (CISOs, CSOs, CIOs and CTOs), OT/ICS engineers and cybersecurity experts and managers responsible for/ or involved in smart grid and smart metering initiatives. No specific prerequisites are needed.</p><p>Audience should expect comprehensive analysis covering general concepts as well as more technical details that will be supported and illustrated by specific and practical examples.</p><h3 id=\"key-takeaways-for-the-audience\">Key takeaways for the audience</h3><p>Target audience will build awareness of cybersecurity challenges and typical vulnerabilities found in smart metering solutions.</p>"
},





{
	"description": "<p>Digitalisation and the interconnectivity of operational technology (OT) drastically increases cybersecurity risk in the oil and gas industry. The security challenges, requirements and potential consequences in industrial environments significantly differ from those in a traditional office IT environment. While the impact of a security breach in office environments is often limited to financial losses, attacks on industrial systems have the potential to stop production, cause physical damage, harm the environment and even put peoples’ lives at risk.</p><p>The oil and gas industry is increasingly reliant on digital systems, and companies have ambitious plans for increased use of digital technology. Established operational patterns are changing, allowing more onshore operation on offshore installations. This trend provides great benefits in areas of efficiency, cost savings and competitiveness, however it also leads to new challenges related to cybersecurity. The industry must therefore actively follow-up changes in the risk landscape, and their increased exposure to continuously evolving cyber threats. A key component in this is incident response readiness planning.</p><p>The first part of this talk presents the results of an empirical study of cyber incident response readiness in the Norwegian oil and gas industry, performed by SINTEF on behalf of the Norwegian Petroleum Safety Authority. The study addresses the CERT capacity among various actors in the industry and their ability to handle critical cybersecurity incidents in industrial control and safety systems. The study focuses on OT systems, information sharing, and the operationalisation of CERT alerts and warnings.</p><p>The study shows that informants are relatively satisfied with their own cyber incident preparedness today, but they acknowledge that it can be improved in the areas of visibility and real-time monitoring of cybersecurity in OT systems. Furthermore, the study shows that not all oil and gas companies or drilling rig operators distinguish between cybersecurity incidents in IT and OT systems, and views vary widely concerning who is responsible for security in and between IT and OT systems.</p><p>mnemonic has, for several years, delivered security monitoring services to different customers within these industrial verticals and helped them build cybersecurity mechanism for protecting their industrial automation and control systems. In the second part of this talk, we will present a recent use-case where mnemonic designed a solution for securing remote access into SAAS and protecting IACS subsystems offshore from cyber threats. Here we implemented a system allowing the control room offshore to dynamically grant access and isolate critical subsystems offshore by pressing a “big red button”. If there is an incident, the “big red button” can be used without impacting the protected production process.</p><p>The key takeaways from this talk will be an insight into the unique challenges of the petroleum industry when it comes to incident response readiness, including a real-world example of how to design secure remote access with a built in practical emergency network segmentation solution.</p>"
},



{
	"description": "<p>IT/OT Convergence is a major challenge for industrial organizations on the path to digitalization.</p><p>The volume and variety of security products as well as the standards for OT networks is growing at a fast pace. As a result, the need for deep expertise, required to sort through and select the right systems for specific industry needs, grows even faster.</p><p>In our session we will present a promising new initiative designed to simplify digitalization processes and test the efficiency and relevance of OT security tools before they are placed in the network.</p><p>We’ll present the results of our latest research which studied the unique Tactics Techniques and Procedures (TTPs) of OT attacks and devised a method to test them in a simulated lab environment.</p><p>The research included the implementation of tens of new techniques and OT use cases over a MITRE’s Caldera platform, an open-source advisory emulation platform. The research was further expanded by implementing the recently published “ATT&amp;CK for ICS” model, and also will point some improvements for the existing model.</p>"
},













{
	"description": "This work concentrates on the cyber security of enterprise and Industrial Control Systems (ICS).Enterprise systems are growing in complexity, and the adoption of cloud and mobile services has greatly increased attack surfaces. This all has led to fragmentation on the security front. To improve the security of enterprise systems, threat modeling can be applied to proactively deal with security issues from a holistic point of view, and can also be combined with attack simulations to provide quantitative security measurements, which has not been commonly used while shown efficient in some disciplines. Hitherto, we have proposed the use of attack simulations based on system architecture models. Our approaches facilitate a model of the system and simulate cyber-attacks in order to identify the greatest weaknesses. This can be imagined as the execution of a great number of parallel virtual penetration tests. Such an attack simulation tool enables the security assessor to focus on the collection of the information about the system required for the simulations.As the previous approaches rely on a static implementation, we propose the use of the Meta Attack Language (MAL). This framework is built for creating domain-specific languages (DSLs) that define which information about a system is required and specifies the generic attack logic. Since MAL is a meta language (i.e. the set of rules that should be used to create a new DSL), no particular domain of interest is represented, but it can be used to create languages targeting certain domains like enterprise system and ICS.This work first introduces enterpriseLang - a threat modeling language for enterprise security based on the MITRE ATT&CK Matrix, which can assess the cyber security of enterprise systems from a holistic point of view. This compilable language can automatically visualize possible attack paths an adversary may choose, show the most vulnerable asset, and provide possible mitigations for each attack step intended to counter cyber-attacks. The attack steps representing adversary techniques are captured within the ATT&CK Matrix based on real-world observations. These adversary techniques are categorized by tactics, and are organized with security metrics e.g. platform, permissions required, and mitigations that provide information for threat modeling.Moreover, this core IT related threat modeling language is complemented by our IcsLang that allows to create and simulate OT specific environments. Similar to enterpriseLang, this language is based on the ICS MITRE ATT&CK Matrix and enriched by real-world observations collected from industry partners in an EU project (EnergyShield). Based on the characteristics of MAL, we will motivate why certain types of attacks are included in our artifact and others not. Mainly, this is based on assumptions, made in the design of MAL and creating a trade-off between level of detail and usability.To demonstrate the applicability and the integration between the two languages, we present energy domain architecture and simulate well-known attacks e.g. the Ukraine power grid attack scenario to test the languages. These languages can also be re-used by people with less security expertise to automatically assess the security of their specific-enterprise or ICS."
},





{
	"description": "Deploying honeypots or other deception technology to attract attackers is the to-go approach to discover unknown threats or simply to assess the threat level against a specific target. Over the years, however, attackers have grown accustomed to the presence of honeypots and learned how to get around them. We decided to make one of the most realistic ones created to date, it was so real – it was mistakenly identified as a real production environment by other security researchers!In this talk we will see how, over the course of a few months, we designed, setup, and built a factory honeypot that was so real that we could have started making products with it. We went as far as creating a fake company including online presence, with a website featuring employee profiles and pictures, phone numbers with auto-responding prompts with extension numbers, postal addresses, etc. Also, we went beyond recording network and host attack traces: We wanted to be able to see the attacker actions as they were happening on the screen, so we created a system to record screencast on demand, when activity is detected on the host.By attending this talk, you will learn what kind of attacks we’ve recorded, ranging from the initial reconnaissance scans, interactions, frauds, and ransomware infection. Finally, the session will wrap up with some recommendations based on the findings from building and running this honeypot."
},




]}