{"speakerList":[
	{
		"id"		: "1",
		"conf-role"	: "presentation",
		"name"		: "Jenny Radcliffe",
		"country"	: "Great Britain",
		"role"		: "Social Engineering Expert",
		"work"		: "",
		"image"		: "https://cs3sthlm.se/assets/speakers/jenny-radcliffe.png",
		"bio"		: "Jenny Radcliffe – aka “The People Hacker” – is an expert in Social Engineering (the human element of security), negotiations, non-verbal communication and deception, using her skills to help clients from corporations and law enforcement, to poker players, politicians and the security industry protect themselves from malicious social engineering attacks.",
		"presentation" : "Adventures in Social Engineering - Tales of A People Hacker",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "2",
		"conf-role"	: "presentation",
		"name"		: "Joe Slowik",
		"country"	: "United States",
		"role"		: "Network Defender",
		"work"		: "Dragos Inc",
		"image"		: "https://cs3sthlm.se/assets/speakers/joe-slowik.png",
		"bio"		: "Joe Slowik has extensive network security and computer network operations experience spanning the military, intelligence, and nuclear communities. Joe served as an Information Warfare Officer in the US Navy from 2009 to 2014, where he brought cybersecurity and network operations experience to places as varied as the mountains of Afghanistan to the Pacific Ocean. Following his military service, Joe moved to Los Alamos National Laboratory (LANL), working as a threat and malware analyst and leading the incident response team. While at LANL, Joe led efforts to completely revise threat hunting and intelligence operations to make network security more agile and responsive to the threat environment, such as tracking network infrastructure creation and malware development by nation state actors of interest. Joe joined Dragos Inc in April 2017 to focus his research and efforts on the ICS threat landscape, where he now applies his passion for defense to the critical infrastructure and industrial control ecosystem.",
		"presentation" : "Strategic Network Defense in ICS Environments",
		"workshop"	: "",
		"description"	: "Adopting a critical examination of ICS infrastructure and communication channels provides defenders with a means to prioritize and focus network protection.By identifying network 'key terrain' and focusing operations on these critical path nodes, defenders can significantly reduce freedom of movement for adversaries and reduce the time from initial compromise to detection. Ultimately, by 'knowing the network' and having an understanding of attacker methodology, ICS network defenders can take the initiative in a cyber breach or attack scenario away from the attacker and empower critical infrastructure defense. To illustrate these concepts, the above will be discussed in light of two recent threats to the ICS environment: the wormable, ETERNALBLUE-employing ransomware WannaCry; and the electric grid-targeting malware CrashOverride/Industroyer.",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "3",
		"conf-role"	: "presentation",
		"name"		: "Adam Crain",
		"country"	: "United States",
		"role"		: "Software Engineer",
		"work"		: "Automatak",
		"image"		: "https://cs3sthlm.se/assets/speakers/adam-crain.png",
		"bio"		: "Adam is a software engineer, security researcher, and open source advocate. In 2012, he started his own venture, Automatak, to improve the adoption of robust open source software (OSS) in the utility space. He is the principal author of opendnp3, an implementation of IEEE 1815 (DNP3). Since April 2013, vulnerabilities have been identified in products sold by more than twenty vendors. Adam works with vendors, utilities, government agencies, standards bodies, and industry organizations to identify and solve systemic issues.",
		"presentation" : "Secure SCADA Protocol for the 21st Century (SSP21)",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "4",
		"conf-role"	: "workshop",
		"name"		: "Mikael Vingaard",
		"country"	: "Denmark",
		"role"		: "Preparedness coordinator, IT",
		"work"		: "EnergiNet",
		"image"		: "https://cs3sthlm.se/assets/speakers/mikael-vingaard.png",
		"bio"		: "Mikael Vingaard leverages his 15+ years of IT-security experience to build practicalinformation security with a real-life perspective. Mikael works as IT-Security Consultant at EnergiNet.dk, the Danish national transmission system operator. In his spare time, Mikael runs several research projects, build on Open Source softwareto make a positive difference to secure critical infrastructure environments.",
		"presentation" : "",
		"workshop"	: "Practical SCADA/ICS Honeypots",
		"description"	: "This 1-day workshop would start with a short general introduction to ICS/SCADA & Honeypots.During the day, the students will be guided in the different phases in planning, deploying and analyzing the collected data from a honeypot. During the day, we will deploy live honeypots on the internet and see how attackers would start to probe our honeypots. Furthermore, we will also attack the deployed honeypots ourselves; using SCADA pen testing tools and similar software.",
		"place"		: "Cabaret",
		"time"		: "09:00 - 17:00"
	},

	{
		"id"		: "5",
		"conf-role"	: "presentation",
		"name"		: "Lars Erik Smevold",
		"country"	: "Norway",
		"role"		: "Senior Security Analyst",
		"work"		: "KraftCERT",
		"image"		: "https://cs3sthlm.se/assets/speakers/lars-erik-smevold.png",
		"bio"		: "Lars Erik Smevold is a senior security analyst in KraftCERT. KraftCERT is the Norwegian energy sector and ICS CERT - a non profit incident response team. The focus for KraftCERT is to together with the companies, protect, detect and recover from incidents that may harm production or distribution of power or water. Lars Erik has many years of experience in the industry from the automation, telco business, and later from security in the energy sector - including the building of security operations center (SOC). In his spare time he enjoys experimenting in his lab.",
		"presentation" : "Pandora´s Box",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "6",
		"conf-role"	: "workshop",
		"name"		: "Erik Hjelmvik",
		"country"	: "Sweden",
		"role"		: "Network Analyst",
		"work"		: "NETRESEC",
		"image"		: "https://cs3sthlm.se/assets/speakers/erik-hjelmvik.png",
		"bio"		: "Erik is the creator of NetworkMiner and an experienced incident handler who has specialized in the field of network forensics.",
		"presentation" : "",
		"workshop"	: "Network Forensics Training",
		"description"	: "Our two-day Network Forensics class consists of a mix of theory and hands-on labs, where students will learn to analyze Full Packet Capture (FPC) files. The scenarios in the labs are primarily focused at network forensics for incident response, but are also relevant for law enforcement/internal security etc. where the network traffic of a suspect or insider is being monitored.",
		"place"		: "Harlem",
		"time"		: "09:00 - 17:00"
	},

	{
		"id"		: "7",
		"conf-role"	: "presentation",
		"name"		: "Jon Røgeberg",
		"country"	: "Norway",
		"role"		: "Manager",
		"work"		: "mnemonic IRT",
		"image"		: "https://cs3sthlm.se/assets/speakers/jon-røgeberg.png",
		"bio"		: "Jon Røgeberg works as the Manager for mnemonic’s Threat Intelligence group. He is also the Operational Manager of mnemonic IRT and responsible for Forensics in mnemonic. He has 10 years’ experience with Incident Response ranging from virus outbreaks, opportunistic crime, targeted crime and advanced targeted attacks.",
		"presentation" : "APT Case Study",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "8",
		"conf-role"	: "presentation",
		"name"		: "Martin Eian",
		"country"	: "Norway",
		"role"		: "Senior Security Analyst",
		"work"		: "mnemonic IRT",
		"image"		: "https://cs3sthlm.se/assets/speakers/martin-eian.png",
		"bio"		: "Dr. Martin Eian works as a Senior Security Analyst in mnemonic's Threat Intelligence group, and he is the Project Manager for the research project Semi-Automated Cyber Threat Intelligence. He has more than 15 years of work experience in IT security, IT operations, and information security research roles. He is also a member of the Europol EC3 Advisory Group on Internet Security. He holds a PhD in Telematics/Information Security from the Norwegian University of Science and Technology (NTNU).",
		"presentation" : "APT Case Study",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "9",
		"conf-role"	: "presentation",
		"name"		: "Melissa Crawford",
		"country"	: "United States",
		"role"		: "Global Consultant",
		"work"		: "Siemens",
		"image"		: "https://cs3sthlm.se/assets/speakers/melissa-crawford.png",
		"bio"		: "After earning the B.S. in Nuclear Engineering from the University of Florida, Melissa started 8 years ago working with Siemens on the design and security of Instrumentation & Control projects for nuclear power plants around the world. She has since taken this detailed knowledge of the I&C systems into her role as Global Consultant for cybersecurity of the industrial control systems at the headquarters for Siemens Plant Security Services, specializing in development of cybersecurity strategies for multinational corporations and remote incident handling.",
		"presentation" : "ICS Program Development for Multi-national Corporations",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "10",
		"conf-role"	: "presentation",
		"name"		: "Dieter Sarrazyn",
		"country"	: "Belgium",
		"role"		: "Security Expert",
		"work"		: "Secudea bvba",
		"image"		: "https://cs3sthlm.se/assets/speakers/dieter-sarrazyn.png",
		"bio"		: "Dieter is a security expert who systematically aims to find vulnerabilities and weaknesses within IT and OT information systems for hackers to exploit. He has built his career in industrial environments and has gained excellent knowledge on strategic, tactical and operational level regarding security related subjects. He works extensively on industrial control system security including more than 8 years in a large electricity generation company. He deploys this expertise primarily in an Operational Technology (OT) environment, performing SCADA security assessments and securing SCADA environments. These activities are always part of a larger program, aimed at reducing business risks.",
		"presentation" : "DIY insider threat detection/prevention within ICS enviroments",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "11",
		"conf-role"	: "presentation",
		"name"		: "Akriti Srivastava",
		"country"	: "India",
		"role"		: "Security Researcher",
		"work"		: "Adobe Systems",
		"image"		: "https://cs3sthlm.se/assets/speakers/akriti-srivastava.png",
		"bio"		: "Akriti is a security researcher working with Adobe Systems, blogger, web application security, APIs security, IOT security and Network security enthusiast. Involved in multiple responsible disclosure of critical vulnerabilities and listed in various hall of fame including Google, developed various CTFs on Web Services and IOT for multiple conferences.",
		"presentation" : "S in IoT is for Security",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "12",
		"conf-role"	: "presentation",
		"name"		: "Oleksii Yasynskyi",
		"country"	: "Ukraine",
		"role"		: "Cybersecurity Expert",
		"work"		: "ISSP Labs",
		"image"		: "https://cs3sthlm.se/assets/speakers/oleksii-yasynskyi.png",
		"bio"		: "Oleksii is Cybersecurity expert with more than 20 years hands-on experience in the field. Oleksii participated in many complex technological projects, headed Security Operations Centre and acted as CISO in Enterprise-scale companies. Within a team of ISSP Labs experts, he made a deep research of cyber-attacks against critical infrastructure of Ukraine. Due to his hard work and high level of competence, it was possible to study each step of the attacks in detail, determine the specifics of the attack and develop a range of behavioral patterns to identify targeted attacks, similar to the ones that occurred in Ukrainian cyberspace in the past few years. Regarding this topic, Oleksii published a number of articles and case studies.",
		"presentation" : "Cyberattacks Against Critical Infrastructure in Ukraine: Taxonomy, Consequences, Lessons Learned",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "12",
		"conf-role"	: "presentation",
		"name"		: "Roman Sologub",
		"country"	: "Ukraine",
		"role"		: "General Manager & CEO",
		"work"		: "ISSP Group",
		"image"		: "https://cs3sthlm.se/assets/speakers/roman-sologub.png",
		"bio"		: "Oleksii is Cybersecurity expert with more than 20 years hands-on experience in the field. Oleksii participated in many complex technological projects, headed Security Operations Centre and acted as CISO in Enterprise-scale companies. Within a team of ISSP Labs experts, he made a deep research of cyber-attacks against critical infrastructure of Ukraine. Due to his hard work and high level of competence, it was possible to study each step of the attacks in detail, determine the specifics of the attack and develop a range of behavioral patterns to identify targeted attacks, similar to the ones that occurred in Ukrainian cyberspace in the past few years. Regarding this topic, Oleksii published a number of articles and case studies.",
		"presentation" : "Cyberattacks Against Critical Infrastructure in Ukraine: Taxonomy, Consequences, Lessons Learned",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "14",
		"conf-role"	: "presentation",
		"name"		: "Patrick DeSantis",
		"country"	: "USA",
		"role"		: "Senior Security Researcher Engineer",
		"work"		: "Cisco Talos",
		"image"		: "https://cs3sthlm.se/assets/speakers/patrick-desantis.png",
		"bio"		: "Patrick DeSantis is a security researcher with Cisco Talos and focuses his efforts on discovery and exploitation of vulnerabilities in technologies that have an impact on the physical world, such as Industrial Control Systems (ICS), Supervisory Control and Data Acquisition (SCADA), Internet of Things (IoT), and anything else that looks like it's asking to be hacked. Patrick's background includes work in both the public and private sectors, as well as a pile of information security certifications and a few college degrees.",
		"presentation" : "From Box to Backdoor: Using Old School Tools and Techniques to Discover Backdoors in Modern Devices",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "15",
		"conf-role"	: "presentation",
		"name"		: "Anton Cherepanov",
		"country"	: "Slovakia",
		"role"		: "Senior Malware Researcher",
		"work"		: "ESET",
		"image"		: "https://cs3sthlm.se/assets/speakers/anton-cherepanov.png",
		"bio"		: "Anton Cherepanov currently working at ESET as a malware researcher, his responsibilities include the analysis of complex threats. His research was presented on numerous conferences, including Virus Bulletin, CARO Workshop, PHDays, and ZeroNights. His interests focus on IT security, reverse engineering and malware analysis automation.",
		"presentation" : "Industroyer: biggest threat to industrial control systems since Stuxnet",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "15",
		"conf-role"	: "presentation",
		"name"		: "Robert Lipovský",
		"country"	: "Slovakia",
		"role"		: "Senior Malware Researcher",
		"work"		: "ESET",
		"image"		: "https://cs3sthlm.se/assets/speakers/robert-lipovsky.png",
		"bio"		: "Robert Lipovsky is Senior Malware Researcher in ESET’s Security Research Laboratory, working for ESET since 2007. He is responsible for malware intelligence and research and leads the Malware Research team in Bratislava. He is a regular speaker at security conferences, including Virus Bulletin, EICAR, and CARO. He runs a reverse engineering course at the Slovak University of Technology, his alma mater and the Comenius University. When not bound to a keyboard, he enjoys sports, playing guitar and flying an airplane.",
		"presentation" : "Industroyer: biggest threat to industrial control systems since Stuxnet",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "17",
		"conf-role"	: "presentation",
		"name"		: "Ali Abbasi",
		"country"	: "Iran",
		"role"		: "Ph.D. candidate",
		"work"		: "University of Twente, Netherlands",
		"image"		: "https://cs3sthlm.se/assets/speakers/ali-abbasi.png",
		"bio"		: "Ali Abbasi is a Ph.D. candidate in Distributed and Embedded System Security group at the University of Twente, The Netherlands and visiting Ph.D. researcher at the Chair of Systems Security of Ruhr-University Bochum, Germany. His research interest involves embedded systems security mostly related to Industrial Control Systems, Critical Infrastructure Security, and Real-Time Operating Systems security. He received his master degree in Computer Science from Tsinghua University, Beijing, China in 2013. He was working there on Programmable Logic Controller (PLC) security in Network Security Lab, Microprocessor and SoC Technology R&D Center with the National 863 High-tech Program grant from Ministry of Industry and Information Technology of China. He is currently doing his research at the Chair of Systems Security of Ruhr-University Bochum regarding designing binary-level protection mechanisms to battle against the sophisticated memory corruption and code-reuse attacks against PLCs and other critical real-time embedded systems.",
		"presentation" : "Configurable Code-Reuse Attacks Mitigation for COTS Programmable Logic Controller Binaries",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "18",
		"conf-role"	: "workshop",
		"name"		: "Michael Theuerzeit",
		"country"	: "Netherlands",
		"role"		: "Cyber Security Consultant",
		"work"		: "Hudson Cybertec",
		"image"		: "https://cs3sthlm.se/assets/speakers/michael-theuerzeit.png",
		"bio"		: "Michael is a seasoned consultant, specialized in Cyber Security for the Operational Technology (OT). For Cyber Security Solution Provider Hudson Cybertec, he is actively engaged in Industrial Automation and Control Systems (IACS) security projects worldwide. His focus is on cyber security for critical Infrastructure sectors like Nuclear, Oil & Gas, Water and Food. He worked with some of the largest companies operating in critical infrastructure sectors, as well as with government and government agencies, enterprises and EPC contractors. He is also an experienced lecturer and Subject Matter Expert for IEC 62443 and an accomplished speaker at international security events, conferences and seminars.",
		"presentation" : "",
		"workshop"	: "Cyber Security for Industrial Automation and Control Systems: An introduction of the IEC 62443 standard",
		"description"	: "The IEC 62443 is the worldwide standard for security of Industrial Automation & Control Systems, or Operational Technology (OT). The standard offers your organization grip on the improvement of the digital security of these environments. During the workshop the following topics will be covered:",
		"place"		: "Cabaret",
		"time"		: "09:00 - 17:00"
	},

	{
		"id"		: "19",
		"conf-role"	: "presentation",
		"name"		: "Jens Wiesner",
		"country"	: "Germany",
		"role"		: "Dipl. Phys.",
		"work"		: "German Federal Office for Information Security (BSI)",
		"image"		: "https://cs3sthlm.se/assets/speakers/jens-wiesner.png",
		"bio"		: "Jens Wiesner heads the section “Cyber Security in Industrial Control Systems” in the German Federal Office for Information Security (BSI). He and his team focus on non-standard IT-systems known as OT/ICS/SCADA as well as life-critical systems used in safety or medical domain. They advise other sections of BSI as well as external working groups, manufacturers, integrators and operators of OT especially in critical infrastructures.",
		"presentation" : "Security for Safety: Fortifying the last line of defense",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "20",
		"conf-role"	: "presentation",
		"name"		: "Dan Demeter",
		"country"	: "Romania",
		"role"		: "Security Researcher",
		"work"		: "Kaspersky Labs",
		"image"		: "https://cs3sthlm.se/assets/speakers/dan-demeter.png",
		"bio"		: "Dan graduated from Imperial College London and holds a Master of Engineering in Software Engineering. He joined Kaspersky Lab in 2014 where his work focuses on developing threat intelligence systems, processing big data and creating new technologies to fight advanced persistent threats.",
		"presentation" : "Back to the IoT Future",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "21",
		"conf-role"	: "presentation",
		"name"		: "Jessikka Aro",
		"country"	: "Finland",
		"role"		: "Investigative Reporter",
		"work"		: "Yle Kioski",
		"image"		: "https://cs3sthlm.se/assets/speakers/jessikka-aro.png",
		"bio"		: "Jessikka Aro is an awarded investigative reporter with Finnish Broadcasting Company's social media project Yle Kioski. Aro specializes in Russia, extremism and information warfare. In 2014 she became the target of serious and still ongoing international propaganda and hate speech campaign after reporting about pro-Kremlin social media trolls. Currently Aro writes an investigative book about Kremlin's information warfare and trains reporters and general public to recognize and counter online disinformation. Aro is also lobbying for better legislation to counter hybrid threats and protect citizens from state-sponsored online security threats.",
		"presentation" : "Pro-Kremlin trolls, fake news and propagandists as opinion influencers - and how to counter them",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "22",
		"conf-role"	: "moderator",
		"name"		: "Anne-Marie Eklund Löwinder",
		"country"	: "Sweden",
		"role"		: "Chief Information Security Officer",
		"work"		: "IIS, The Internet Foundation In Sweden",
		"image"		: "https://cs3sthlm.se/assets/speakers/amel.png",
		"bio"		: "She is the Chief Information Security Officer at IIS, The Internet Foundation In Sweden. She also serves on the boards of internet-related organisations including the Council of European National Top Level Domain Registries (CENTR) and the Swedish Law and Informatics Research Institute. Eklund Löwinder has been appointed Trusted Community Representative by the Internet Corporation for Assigned Names and Numbers (ICANN). She is one of seven people who control the DNSSEC key generation for the internet root zone.",
		"presentation" : "",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "23",
		"conf-role"	: "presentation",
		"name"		: "Rossella Mattioli",
		"country"	: "Europe",
		"role"		: "Officer in Network and Information Security",
		"work"		: "ENISA",
		"image"		: "https://cs3sthlm.se/assets/speakers/rossella-mattioli.png",
		"bio"		: "Rossella Mattioli joined ENISA, the European Union Agency for Network and Information Security, in 2013 and has over 10 years of experience in the IT industry. Her work focuses on promoting cyber security for Critical Infrastructures, IoT and transport infrastructures in Europe. Along the thematic reports and community engagement, she coordinates also ENISA’s expert groups related to Internet infrastructure, IoT, ICS/SCADA, Intelligent public transport and smart car cybersecurity. She holds a MSc in Engineering with main specialization in Cybersecurity at Tallinn University of Technology and she is a Certified Information Systems Security Professional.",
		"presentation" : "",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	},

	{
		"id"		: "24",
		"conf-role"	: "presentation",
		"name"		: "Paraskevi Kasse",
		"country"	: "Europe",
		"role"		: "Network and Information Security Officer",
		"work"		: "ENISA",
		"image"		: "https://cs3sthlm.se/assets/speakers/paraskevi-kasse.png",
		"bio"		: "Her work in ENISA focuses on enhancing the cybersecurity posture of utilities in Energy sector (Electricity, Oil and Gas). Furthermore, she is dealing with security aspects of ICS/SCADA systems and cybersecurity aspects related to energy sector in the European NIS Directive. Paraskevi has been awarded a diploma in computer engineering and informatics, she holds a Msc in Information Science and Technology. Prior to joining ENISA, she worked as a security expert for 7 years at the Hellenic National CERT.",
		"presentation" : "",
		"workshop"	: "",
		"description"	: "",
		"place"		: "",
		"time"		: ""
	}

]}