{"speakerList":[
	{
		"id"		: "1",
		"type"		: "workshop",
		"name"		: "Erik Hjelmvik",
		"role"		: "Network Analyst",
		"work"		: "NETRESEC",
		"country"	: "Sweden",
		"shortcode" : "SE",
		"image"		: "https://cs3sthlm.se/assets/speakers/erik-hjelmvik.png",
		"bio"		: "<p>Erik is the creator of NetworkMiner and an experienced incident handler who has specialized in the field of network forensics.</p>",
		"date"		: "22-23 October",
		"time"		: "09:00 - 17:00",
		"place"		: "Harlem",
		"title"		: "Network Forensics Training",
		"description": "<p>Our two-day Network Forensics class consists of a mix of theory and hands-on labs, where students will learn to analyze Full Packet Capture (FPC) files. The scenarios in the labs are primarily focused at network forensics for incident response, but are also relevant for law enforcement/internal security etc. where the network traffic of a suspect or insider is being monitored.</p><h4 id=\"day-1---theory-and-practice-using-open-source-tools\">Day 1 - Theory and Practice using Open Source Tools</h4><ul>  <li>Theory: Ethernet signaling</li>  <li>Hardware: Network TAPs and Monitor ports / SPAN ports</li>  <li>Sniffers: Recommendations for high-performance packet interception</li>  <li>Analyze Modbus TCP traffic</li>  <li>Forensics of IEC 60870-5-104 network traffic</li>  <li>Investigate telnet sessions</li>  <li>PCAP analysis: Extracting evidence and indicators of compromise using open source tools</li>  <li>Defeating Big Data: Techniques for working with large data sets</li>  <li>Whitelists: Learn how to detect 0-day exploit attacks without using IDS signatures</li>  <li>Challenge Day 1: Find the needle in our haystack and win a honorable prize!</li></ul><h4 id=\"day-2---advanced-network-forensics-using-netresec-tools\">Day 2 - Advanced Network Forensics using Netresec Tools</h4><ul>  <li>NetworkMiner Professional: Learning to leverage the features available in the Pro version    <ul>      <li>Port Independent Protocol Identification (PIPI)</li>      <li>DNS Whitelisting</li>    </ul>  </li>  <li>NetworkMinerCLI: Automating content extraction with our command line tool</li>  <li>CapLoader: Searching, sorting and drilling through large PCAP data sets    <ul>      <li>Super fast flow transcript (aka Follow TCP/UDP stream)</li>      <li>Filter PCAP files and export frames to other tools</li>      <li>Keyword search</li>      <li>Create inventory of ICS devices from PCAP</li>    </ul>  </li>  <li>Challenge Day 2</li></ul><h4 id=\"the-scenario\">The Scenario</h4><p>The scenario used in the class involves a new progressive Bank, which provides exchange services for Bitcoin and Litecoin. We’ve set up clients and a server for this bank using REAL physical machines and a REAL internet connection. All traffic on the network is captured to PCAP files by a SecurityOnion sensor. In the scenario this bank gets into lots of trouble with hackers and malware, such as:</p><ul>  <li>Defacement of the Bank’s web server (see zone-h mirror)</li>  <li>Backdoor infection through trojanized software</li>  <li>Spear phishing</li>  <li>Use of a popular RAT (njRAT) to access the victims machine and exfiltrate the wallet.dat files for Bitcoin and Litecoin</li>  <li>Infection with real malware (Nemucod, Miuref / Boaxxe and more)</li></ul><p>Class attendees will learn to analyze captured network traffic from these events in order to:</p><ul>  <li>Investigate web server compromises and defacements</li>  <li>Identify covert backdoors</li>  <li>Reassemble incoming emails and attachments</li>  <li>Detect and decode RAT/backdoor traffic</li>  <li>Detect malicious traffic without having to rely on blacklists, AV or third-party detection services</li></ul><h4 id=\"professional-software-included-free-of-charge\">Professional software included FREE of charge</h4><p>Each attendee will be provided with a free personal single user license of NetworkMiner Professional and CapLoader. These licenses will be valid for six months from the first training day.</p><h3 id=\"target-audience\">Target Audience</h3><p>Q: Who should attend?</p><p>A: Anyone who want to improve their skills at finding evil stuff in full content packet captures.</p><p>Q: Who should NOT attend?</p><p>A: Those who are afraid of using Linux command line tools.</p><h3 id=\"training-preparations\">Training Preparations</h3><h4 id=\"laptop-required\">Laptop Required</h4><p>Attendees will need to bring a laptop that fits the following specs:</p><ul>  <li>A PC running any 64 bit Windows OS (can be a Virtual Machine)</li>  <li>At least 4GB RAM</li>  <li>At least 40 GB free disk space</li>  <li>VirtualBox (64 bit) installed (VMWare will not be supported in the training)</li></ul><p>A VirtualBox VM will be provided on USB flash drives at the beginning of the training.</p><p>Please note that having a 64-bit CPU and a 64-bit OS is not always enough to support 64-bit virtualization. You might need to enable features such as ”AMD-V”, ”VT-x” or ”Hyper-V” in BIOS in order to run virtual machines in 64-bit mode. You might also need to turn off “Intel Trusted Execution” in BIOS. One way to verify that your laptop supports 64-bit virtualization is to download the SecurityOnion ISO and see if it boots up in VirtualBox.</p>"
	},

	{
		"id"		: "2",
		"type"		: "workshop",
		"name"		: "Stephan Beirer",
		"role"		: "Senior Consultant",
		"work"		: "GAI NetConsult GmbH",
		"country"	: "Germany",
		"shortcode" : "DE",
		"image"		: "https://cs3sthlm.se/assets/speakers/stephan-beirer.png",
		"bio"		: "<p>Stephan Beirer studied and received his PhD in physics. Since 2006 Mr. Beirer has been employed with GAI NetConsult GmbH as a senior consultant and is the Head of Industrial Control Systems Security since 2012. He advises clients on the development and implementation of organizational and technical security policies and controls, on implementing an information security management system (ISMS) according to IEC 62443, ISO/IEC 27001 and ISO/IEC 27019 and on business continuity planning. His professional focus is on securing process control and automation technology, especially in the field of energy supply. He gained his experience in more than 200 ICS security projects in the field of energy, transportation and industrial manufacturing. He is an active member of several national and international standardization committees at DIN, DKE, IEC and ISO and the editor of ISO/IEC 27019.</p>",
		"date"		: "23 October",
		"time"		: "",
		"place"		: "",
		"title"		: "Cyber security for the energy sector – an introduction to ISO/IEC 27019 and the BDEW/OE Whitepaper",
		"description": "<p>Generation, storage, transport and distribution of electricity and gas are the most critical of all critical infrastructure processes supporting our daily life. As in every modern industry domain, energy supply is heavily dependent on industrial control systems (ICS) and the security of these systems. While many energy utilities implement an information security management system (ISMS) based on the ISO/IEC 27000 standard family, they often struggle with the inclusion of the ICS and OT domain, when they try to harmonize security management over their entire business scope. To fill this gap ISO/IEC 27019 <em>Information security controls for the energy utility industry</em> was developed. ISO/IEC 27019 is a sector specific control set for the process control system domain of the energy sector which is based on ISO/IEC 27001 and ISO/IEC 27002.</p><p>To supplement the generic controls of ISO/IEC 27019 with detailed technical security specifications for ICS systems, the German and Austrian energy operator associations BDEW and Oesterreichs Energie have published the BDEW/OE Whitepaper. The Whitepaper can be used during system procurement and defines security requirements for control and automation systems of the energy domain and their telecommunication infrastructure.</p><p>The workshop gives an introduction to the contents and practical application of ISO/IEC 27019 and the BDEW/OE Whitepaper. The following topics will be covered:</p><ul>  <li>Industrial control systems in the energy sector</li>  <li>Introduction to the ISO/IEC 27000 series</li>  <li>Overview of ISO/IEC 27019</li>  <li>Practical application of ISO/IEC 27019</li>  <li>ISO/IEC 27019 and European cyber security regulation</li>  <li>The BDEW/OE Whitepaper, a security procurement guideline for energy ICS</li></ul><p>The workshop will include a lecture, discussions and exercises.</p>"
	},

	{
		"id"		: "3",
		"type"		: "presentation",
		"name"		: "Marty Edwards",
		"role"		: "Cybersecurity Expert",
		"work"		: "The Automation Federation",
		"country"	: "United States",
		"shortcode" : "US",
		"image"		: "https://cs3sthlm.se/assets/speakers/marty-edwards.png",
		"bio"		: "<p>Marty Edwards, a globally recognized industrial control systems cybersecurity expert and speaker, serves as Managing Director of the Automation Federation.</p><p>Prior to joining the Automation Federation in mid-2017, Edwards—a 25-year industry veteran—was the longest-serving Director of the U.S. Department of Homeland Security’s Industrial Control Systems Cyber Emergency Response Team (ICS-CERT). Under his leadership the ICS-CERT was awarded the 2013 SC Magazine Security Team of the Year award and was named as a finalist in the Community Awareness category in the 2015 Government Information Security Leadership Awards (GISLA).</p>",
		"date"		: "",
		"time"		: "",
		"place"		: "",
		"title"		: "Think like a hacker but act like an engineer",
		"description": "<p>Industrial Control Systems (ICS) as well as Operational Technology (OT) are under increased risks from cyber events.  Come learn how Cyber Informed Engineering is an evolving concept to use cyber risk in designing control systems and associated protection systems.</p><p>“Cyber risks to Industrial Control Systems (ICS) and Operational Technology (OT) continue to evolve.  Whether it is the threat of ransomware taking a production system offline, or sophisticated malware targeting the safety critical components of your system.  Engineers have long designed systems to be resilient to a multitude of failure modes, and it is time that we started taking the lessons learned from cyber attacks against these systems into consideration during new system design, or legacy system retrofit.  This session will introduce this evolving concept and describe some of the standards and practices being developed and utilized.”</p>"
	},

	{
		"id"		: "4",
		"type"		: "presentation",
		"name"		: "Patrick Miller",
		"role"		: "Managing Partner",
		"work"		: "Archer",
		"country"	: "United States",
		"shortcode" : "US",
		"image"		: "https://cs3sthlm.se/assets/speakers/patrick-miller.png",
		"bio"		: "<p>Patrick Miller has dedicated his career to the protection and defense of critical infrastructures. As Managing Partner at Archer Security Group, he is a trusted independent security and regulatory advisor for industrial control systems worldwide. Mr. Miller is also the founder, director and president emeritus of EnergySec and US. Coordinator for the Industrial Cybersecurity Center. Patrick’s diverse background spans the Energy, Telecommunications, Water and Financial Services verticals including key positions with regulatory agencies, private consulting firms, utility asset owners and commercial organizations.</p>",
		"date"		: "",
		"time"		: "",
		"place"		: "",
		"title"		: "Industrial Technology Trajectory: Running With Scissors",
		"description": "<p>Abstract: Innovative and disruptive technologies are enhancing and invading our traditional industrial business model. Future infrastructure organizations will need more data to operate efficiently and succeed in the brave new interconnected world. The diversity of new technologies and data will fuel more diversity in business opportunity. Everyone expects more OT, more IOT, and more IT - and all of it is supposed to be highly reliable and secure. These factors (and more) lead to a landscape shift for the industrial cybersecurity risk profile. In this session, hear ways to recognize the problems and gain some clarity on possible solutions through historic lessons, made up words, and practical front-line experience.</p>"
	},

	{
		"id"		: "5",
		"type"		: "workshop",
		"name"		: "Arnaud Soullié",
		"role"		: "Cybersecurity R&D Manager",
		"work"		: "Wavestone",
		"country"	: "France",
		"shortcode" : "FR",
		"image"		: "https://cs3sthlm.se/assets/speakers/arnaud-soullie.png",
		"bio"		: "<p>Arnaud Soullié (@arnaudsoullie) is the cybersecurity R&amp;D manager at Wavestone. For 8 years, he has been performing security audits and pentest on all type of targets. He specializes in Industrial Control Systems and Active Directory security. He has spoken at numerous security conferences on ICS topics : BlackHat Europe, BruCon, 4SICS, BSides Las Vegas, DEFCON…He also has an interest in hardware security, and is the designer of DYODE (Do Your Own Diode): an open-source, low-cost, ICS oriented data diode.</p>",
		"date"		: "22-23 October",
		"time"		: "",
		"place"		: "",
		"title"		: "Pentesting Industrial Control Systems",
		"description": ""
	}

]}