{
	"speakerList":[
	{
		"id"		: "1",
		"type"		: "training",
		"name"		: "Erik Hjelmvik",
		"role"		: "Network Analyst",
		"work"		: "NETRESEC",
		"country"	: "Sweden",
		"shortcode"	: "SE",
		"image" 	: "https://cs3sthlm.se/assets/speakers/erik-hjelmvik.png",
		"date" 		: "21-22 October",
		"time" 		: "09:00 - 17:00",
		"place" 	: "TBA",

		"presentation":{
		
			"active": 	"none",
			"title": 	"",
			"partner":	"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/.png",
			"description": ""
		
		},
		
		"training": {
			"active": "live",
			"title": "Network Forensics Training",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "<p>Our two-day Network Forensics class consists of a mix of theory and hands-on labs, where students will learn to analyze Full Packet Capture (FPC) files. The scenarios in the labs are primarily focused at network forensics for incident response, but are also relevant for law enforcement/internal security etc. where the network traffic of a suspect or insider is being monitored.</p><h4 id=\"day-1---theory-and-practice-using-open-source-tools\">Day 1 - Theory and Practice using Open Source Tools</h4><ul>  <li>Theory: Ethernet signaling</li>  <li>Hardware: Network TAPs and Monitor ports / SPAN ports</li>  <li>Sniffers: Recommendations for high-performance packet interception</li>  <li>Analyze Modbus TCP traffic</li>  <li>Forensics of IEC 60870-5-104 network traffic</li>  <li>Investigate telnet sessions</li>  <li>PCAP analysis: Extracting evidence and indicators of compromise using open source tools</li>  <li>Defeating Big Data: Techniques for working with large data sets</li>  <li>Whitelists: Learn how to detect 0-day exploit attacks without using IDS signatures</li>  <li>Challenge Day 1: Find the needle in our haystack and win a honorable prize!</li></ul><h4 id=\"day-2---advanced-network-forensics-using-netresec-tools\">Day 2 - Advanced Network Forensics using Netresec Tools</h4><ul>  <li>NetworkMiner Professional: Learning to leverage the features available in the Pro version    <ul>      <li>Port Independent Protocol Identification (PIPI)</li>      <li>DNS Whitelisting</li>    </ul>  </li>  <li>NetworkMinerCLI: Automating content extraction with our command line tool</li>  <li>CapLoader: Searching, sorting and drilling through large PCAP data sets    <ul>      <li>Super fast flow transcript (aka Follow TCP/UDP stream)</li>      <li>Filter PCAP files and export frames to other tools</li>      <li>Keyword search</li>      <li>Create inventory of ICS devices from PCAP</li>    </ul>  </li>  <li>Challenge Day 2</li></ul><h4 id=\"the-scenario\">The Scenario</h4><p>The scenario used in the class involves a new progressive Bank, which provides exchange services for Bitcoin and Litecoin. We’ve set up clients and a server for this bank using REAL physical machines and a REAL internet connection. All traffic on the network is captured to PCAP files by a SecurityOnion sensor. In the scenario this bank gets into lots of trouble with hackers and malware, such as:</p><ul>  <li>Defacement of the Bank’s web server (see zone-h mirror)</li>  <li>Backdoor infection through trojanized software</li>  <li>Spear phishing</li>  <li>Use of a popular RAT (njRAT) to access the victims machine and exfiltrate the wallet.dat files for Bitcoin and Litecoin</li>  <li>Infection with real malware (Nemucod, Miuref / Boaxxe and more)</li></ul><p>Class attendees will learn to analyze captured network traffic from these events in order to:</p><ul>  <li>Investigate web server compromises and defacements</li>  <li>Identify covert backdoors</li>  <li>Reassemble incoming emails and attachments</li>  <li>Detect and decode RAT/backdoor traffic</li>  <li>Detect malicious traffic without having to rely on blacklists, AV or third-party detection services</li></ul><h4 id=\"professional-software-included-free-of-charge\">Professional software included FREE of charge</h4><p>Each attendee will be provided with a free personal single user license of NetworkMiner Professional and CapLoader. These licenses will be valid for six months from the first training day.</p><h3 id=\"target-audience\">Target Audience</h3><p>Q: Who should attend?</p><p>A: Anyone who want to improve their skills at finding evil stuff in full content packet captures.</p><p>Q: Who should NOT attend?</p><p>A: Those who are afraid of using Linux command line tools.</p><h3 id=\"training-preparations\">Training Preparations</h3><h4 id=\"laptop-required\">Laptop Required</h4><p>Attendees will need to bring a laptop that fits the following specs:</p><ul>  <li>A PC running any 64 bit Windows OS (can be a Virtual Machine)</li>  <li>At least 4GB RAM</li>  <li>At least 40 GB free disk space</li>  <li>VirtualBox (64 bit) installed (VMWare will not be supported in the training)</li></ul><p>A VirtualBox VM will be provided on USB flash drives at the beginning of the training.</p><p>Please note that having a 64-bit CPU and a 64-bit OS is not always enough to support 64-bit virtualization. You might need to enable features such as ”AMD-V”, ”VT-x” or ”Hyper-V” in BIOS in order to run virtual machines in 64-bit mode. You might also need to turn off “Intel Trusted Execution” in BIOS. One way to verify that your laptop supports 64-bit virtualization is to download the SecurityOnion ISO and see if it boots up in VirtualBox.</p>",
			"excerpt":	"Our two-day Network Forensics class consists of a mix of theory and hands-on labs, where students will learn to analyze Full Packet Capture (FPC) files. The scenarios in the labs are primarily focu..."
		},
		

		"bio": "<p>Erik is the creator of NetworkMiner and an experienced incident handler who has specialized in the field of network forensics.</p>"
	},

	{
		"id"		: "2",
		"type"		: "training",
		"name"		: "Arnaud Soullié",
		"role"		: "Cybersecurity R&D Manager",
		"work"		: "Wavestone",
		"country"	: "France",
		"shortcode"	: "FR",
		"image" 	: "https://cs3sthlm.se/assets/speakers/arnaud-soullie.png",
		"date" 		: "21-22 October",
		"time" 		: "09:00 - 17:00",
		"place" 	: "TBA",

		"presentation":{
		
			"active": 	"none",
			"title": 	"",
			"partner":	"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/.png",
			"description": ""
		
		},
		
		"training": {
			"active": "live",
			"title": "Pentesting Industrial Control Systems",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "<p>On this intense 2-days training, you will learn everything you need to start pentesting Industrial Control Networks. We will cover the basics to help you understand what are the most common ICS vulnerabilities.</p><p>We will then spend some time learning and exploiting Windows &amp; Active Directory weaknesses, as most ICS are controlled by Windows systems. We will cover the most common ICS protocols (Modbus, S7, Profinet, Ethernet/IP, DNP3, OPC…), analyze packet captures and learn how to use these protocols to talk to Programmable Logic Controllers (PLCs).</p><p>You will learn how to program a PLC, to better understand how to exploit them. The training will end with an afternoon dedicated to a challenging hands-on exercise: The first CTF in which you capture a real flag! Using your newly acquired skills, you will try to compromise a Windows Active Directory, pivot to an ICS setup to take control of a model train and robotic arms.</p><h4 id=\"the-detailed-outline-of-the-training-will-be-the-following\">The detailed outline of the training will be the following:</h4><ul>  <li>Introduction to ICS &amp; common vulnerabilities</li>  <li>Pentesting Basics &amp; tools [Hands-on]</li>  <li>Windows basics and pentesting Windows [Hands-on]</li>  <li>Focus on ICS protocols</li>  <li>Programming PLCs [Hands-on]</li>  <li>Pentesting ICS [Hands-on]</li>  <li>Capture The Flag [Hands-on]</li></ul><h3 id=\"detailed-content\">Detailed content</h3><h4 id=\"module-1-introduction-to-ics--common-vulnerabilities\">Module 1: Introduction to ICS &amp; common vulnerabilities</h4><p>For starters, I will introduce the concept of ICS.</p><p>The topics will include:</p><ul>  <li>Vocabulary</li>  <li>Classic architectures</li>  <li>ICS components (PLCs, HMI, SCADA, DCS, sensors, RTUs, Historian, etc) and their roles</li>  <li>OT vs IT</li></ul><p>I will also introduce attendees to the most common vulnerabilities in ICS, and describes some of the public attacks:</p><ul>  <li>Lack of network segmentation / Exposure</li>  <li>Lack of hardening - ICS protocols insecurity</li></ul><p><em>This module is not hands-on</em></p><h4 id=\"module-2-pentesting-basics--tools\">Module 2: Pentesting Basics &amp; tools</h4><p>This module will introduce the concept of penetration test.I do not intend to spend too much time of the theoretical stuff (how to makea report, etc etc) since that is not what attendees are looking for.</p><p>However, I think a module is required to ensure that everyone shares at least thebasic concepts of penetration testing, in order to understand the rest of the training.The module will include :</p><ul>  <li>OSINT for ICS : Where to look to find informations</li>  <li>Reconnaissance : how to portscan &amp; nessus</li>  <li>Exploitation : Metasploit basics</li></ul><p>Toolz used : nmap, Nessus, Metasploit</p><p>Lab setup : Windows Servers and workstations, Metasploitable, Kali Linux</p><h4 id=\"module-3-windows-basics-and-pentesting-windows\">Module 3: Windows basics and pentesting Windows</h4><p>Any ICS now includes, at least in some areas, Windows systems. So I think that some time must be spent on Windows basics.</p><p>This module will introduce the following topics:</p><ul>  <li>Windows Active Directory</li>  <li>How to find credentials on Windows systems</li>  <li>Exploiting and pivoting to gain Domain Admin privileges</li></ul><p>A selection of hacking techniques will be applied on lab machines.</p><h4 id=\"module-4-focus-on-ics-protocols\">Module 4: Focus on ICS protocols</h4><p>This module will introduce the most common ICS protocols: Modbus/TCP, S7, Profinet, DNP3, Ethernet/IP…. Attendees will analyze network captures and be introduced to software libraries/ clients to use these protocols to talk to PLC simulators.</p><p><em>This module is not hands-on</em></p><h4 id=\"module-5-programming-plcs\">Module 5: Programming PLCs</h4><p>In order to have a better understanding of how a PLC works, student will use dedicated software to program a PLC in ladder logic (using trial versions of TIA portal and/or soMachine basic).</p><p>Students will then deploy the code to real PLCs.</p><p>Toolz used : SoMachine Basic</p><p>Lab : Windows virtual machine</p><h4 id=\"module-6-pentesting-ics\">Module 6: Pentesting ICS</h4><p>This module will be mostly lab sessions, in order to apply the knowledge learned so far:</p><ul>  <li>Network capture analysis &amp; replaying packets</li>  <li>Talking industrial protocols: Modbus, S7</li>  <li>Additional PLC features: web server, ftp, snmp and how to exploit it</li></ul><p>Toolz used : nmap, Nessus, Metasploit</p><p>Lab : Windows Servers and workstations, Kali Linux, Siemens and Schneider PLCs</p><h4 id=\"module-7-capture-the-flag\">Module 7: Capture The Flag</h4><p>I strongly believe that a good training must include “real-life” examples and labs. I will dedicate the last half-day of the training to a Capture The Flag event. To do so, I will have a specific setup where attendees will be able to use their newly-acquired knowledge on a simulation of a “real-life” system. This will include compromise of Windows host, pivoting to the ICS, understanding the industrial process, and finally capturing a real flag with a robot hand!</p><p>This will be an expanded version of the CTF I usually organize during the ICS workshops at conferences.</p><h4 id=\"target-audience\">Target audience</h4><p>This training is aimed at OT professionals willing to understand what are the security issues within ICS, and howto technically assess the security level of an ICS. It will also be beneficial for IT security professionals wanting to understand the technical specificities of ICS.</p><h4 id=\"key-takeaways\">Key takeaways</h4><p>The attendees will learn what are the common ICS vulnerabilities, the tools and techniques to assess an ICS (both Windows systems and PLCs), and will practice these techniques during an hands-on Capture The Flag on real hardware.</p><h4 id=\"training-preparations\">Training Preparations</h4><p>Laptop Required</p><p>Attendees will need to bring a laptop that fits the following specs:</p><ul>  <li>A PC with VirtualBox capable of running virtual machines.</li>  <li>At least 4GB RAM</li>  <li>At least 40 GB free disk space</li>  <li>VirtualBox (64 bit) installed (VMWare could be used but will not be supported in the training)</li></ul><p>Several VirtualBox VMs will be provided on USB flash drives at the beginning of the training.</p><p>Please note that having a 64-bit CPU and a 64-bit OS is not always enough to support 64-bit virtualization. You might need to enable features such as ”AMD-V”, ”VT-x” or ”Hyper-V” in BIOS in order to run virtual machines in 64-bit mode.</p><p>Please try to run a 64-bit VM prior to the training.</p>",
			"excerpt":	"On this intense 2-days training, you will learn everything you need to start pentesting Industrial Control Networks. We will cover the basics to help you understand what are the most common ICS vul..."
		},
		

		"bio": "<p>Arnaud Soullié (@arnaudsoullie) is a manager at Wavestone. For 9 years, he has been performing security audits and pentest on all type of targets. He specializes in Industrial Control Systems and Active Directory security. He has spoken at numerous security conferences on ICS topics : BlackHat Europe, BruCon, 4SICS, BSides Las Vegas, DEFCON… He is also the creator of the DYODE project, an open­source data diode aimed at ICS.</p>"
	},

	{
		"id"		: "4",
		"type"		: "presentation",
		"name"		: "Monta Elkins",
		"role"		: "Hacker-in-Chief",
		"work"		: "FoxGuard Solutions",
		"country"	: "United States",
		"shortcode"	: "US",
		"image" 	: "https://cs3sthlm.se/assets/speakers/monta-elkins.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"Nation-State Supply Chain Attacks for Dummies and You Too",
			"partner":	"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/.png",
			"description": "<p>Back in October 2018, “Bloomberg” recounted a Chinese supply-chain attack on Supermicro motherboards used in servers for Amazon, Apple, and more than 20 other companies. <a href=\"https://www.bloomberg.com/news/features/2018-10-04/the-big-hack-how-china-used-a-tiny-chip-to-infiltrate-america-s-top-companies\">the-big-hack-how-china-used-a-tiny-chip-to-infiltrate-america-s-top-companies</a></p><p>Here is how I replicated it, on a Cisco firewall, with a shoestring budget, and how you can too.</p><p>This presentation will explain how I built and installed an implant chip on an industry-standard firewall, allowing the creation of privileged accounts, network access, and covert notification of successful compromise.</p><p>We’ll also discuss possible defenses and how to decide if you should be concerned about this class attack in your environment.</p><p>This talk will lead the audience through the chip selection process, the tools required to develop the attack (both hardware and software), and their use.</p><p>The techniques explained can be used on a variety of I.T. and O.T. equipment as well.</p><h4 id=\"target-audience-expectations-and-key-takeaway\">Target Audience, Expectations, and Key Takeaway:</h4><p>Audience: Security professional interested in supply chain “chipping” attacks of equipment</p><p>Audience takeaway will include the ease of creating “chipping” attacks on a small budget, the developmental steps, defences against such attacks, and understanding of why you likely don’t have to worry about them yet.</p>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Monta, a Certified SANS Instructor and U.S. patent recipient, has been a speaker at more security and ICS conferences than even his enormous ego can remember including: CS3STHLM, DEFCON, BSIDES, GE Digital Energy, ICSJWG, Toshiba ICS, GridSecCon, Distributech, CIP Emerging Technology Roundtable, ICS CyberSecurity, UTC Telecom, Hack the Capitol, and SANS ICS Summit. Known for having once discovered ALL the devices on an ICS network, he has served as a guest lecturer for colleges, universities, and elsewhere teaching Arduino programming/circuit design, SDR, rapid prototyping techniques, and other ICS topics. As a small child, Monta entertained himself by memorizing Pi – backwards.</p>"
	},

	{
		"id"		: "5",
		"type"		: "presentation",
		"name"		: "Christopher Corbett",
		"role"		: "Junior Incident Responder",
		"work"		: "Audi",
		"country"	: "Germany",
		"shortcode"	: "DE",
		"image" 	: "https://cs3sthlm.se/assets/speakers/christopher-corbett.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"Automotive DoIP and forensic analysis for automotive systems",
			"partner":	"Kevin Gomez Buquerin",
			"role":		"Junior Incident Responder",
			"work":		"Audi",
			"image":	"https://cs3sthlm.se/assets/speakers/kevin-gomez-buquerin.png",
			"description": "<p>The automobile industry is changing and new fields such as autonomous driving, battery enhancements and infrastructure or advanced mobility services are under development. As a side effect the interconnection of vehicles increases with numerous new protocols and technologies introduced to enable these scenarios, which also attract the attention of security researchers and hackers. Therefore, more focus on security practices is necessary.</p><p>One of these new technologies is Automotive Ethernet. It not only affects the in-vehicle network with enhanced bandwidth and protocol versatility, but also enables the connection of the vehicle to existing external network infrastructures. This can be accomplished by the Diagnostic over Internet Protocol (DoIP) which is used for diagnostic communication over the Onboard Diagnostic (OBD) interface.</p><p>Therefore potential unsafe or even unknown functionality is exposed to the outside world which, until now, was a private point to point connection between the diagnostic equipment and the vehicle. Moreover the diagnostic interface is commonly used to modify vehicles like enabling/disabling software features or update firmware. With an increasing proportion of software as a product features and at the same time raising attractiveness for malicious activities (e.g. fraud, attacks, manipulation) by attackers. The Original Equipment Manufacturers (OEM) are faced with new challenges in the domain of evidence preservation and reconciliation. Especially with the ISO21434 and UNECE on the horizon.</p><p>We examined possible scenarios that range from information gathering to malicious activities with focus on the vehicle and infrastructure. At the same time we approached the idea of what forensic evidence such activities might leave behind and how state-of-the-art technology helps preserving evidence. We therefore analysed the protocol specification and developed software according to our scenarios for evaluation. Furthermore, we studied existing forensic investigation approaches in the IT and SCADA domains and their feasibility with the DoIP protocol, as being the central point of communication with the in-vehicle network from outside the vehicle.</p><p>In this presentation we present our approach on the analysis of the protocol, the scenarios we derived and the tools we used for evaluation. This also includes the applicability check of the diagnostic interface for forensic investigation as well as discussion to provide these forensic investigations for court relevant incidents.</p>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Christopher Corbett is a PhD student of modern vehicle network security at Ulm University. His work focuses specifically on the examination of modern in-vehicle networks to derive security mechanisms for manipulation prevention and detection. He is a junior incident responder at Audi AG with a focus on network security monitoring and active defence techniques.</p>"
	},

	{
		"id"		: "6",
		"type"		: "presentation",
		"name"		: "Kevin Gomez Buquerin",
		"role"		: "Junior Incident Responder",
		"work"		: "Audi",
		"country"	: "Germany",
		"shortcode"	: "DE",
		"image" 	: "https://cs3sthlm.se/assets/speakers/kevin-gomez-buquerin.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"Automotive DoIP and forensic analysis for automotive systems",
			"partner":	"Christopher Corbett",
			"role":		"Junior Incident Responder",
			"work":		"Audi",
			"image":	"https://cs3sthlm.se/assets/speakers/christopher-corbett.png",
			"description": "<p>The automobile industry is changing and new fields such as autonomous driving, battery enhancements and infrastructure or advanced mobility services are under development. As a side effect the interconnection of vehicles increases with numerous new protocols and technologies introduced to enable these scenarios, which also attract the attention of security researchers and hackers. Therefore, more focus on security practices is necessary.</p><p>One of these new technologies is Automotive Ethernet. It not only affects the in-vehicle network with enhanced bandwidth and protocol versatility, but also enables the connection of the vehicle to existing external network infrastructures. This can be accomplished by the Diagnostic over Internet Protocol (DoIP) which is used for diagnostic communication over the Onboard Diagnostic (OBD) interface.</p><p>Therefore potential unsafe or even unknown functionality is exposed to the outside world which, until now, was a private point to point connection between the diagnostic equipment and the vehicle. Moreover the diagnostic interface is commonly used to modify vehicles like enabling/disabling software features or update firmware. With an increasing proportion of software as a product features and at the same time raising attractiveness for malicious activities (e.g. fraud, attacks, manipulation) by attackers. The Original Equipment Manufacturers (OEM) are faced with new challenges in the domain of evidence preservation and reconciliation. Especially with the ISO21434 and UNECE on the horizon.</p><p>We examined possible scenarios that range from information gathering to malicious activities with focus on the vehicle and infrastructure. At the same time we approached the idea of what forensic evidence such activities might leave behind and how state-of-the-art technology helps preserving evidence. We therefore analysed the protocol specification and developed software according to our scenarios for evaluation. Furthermore, we studied existing forensic investigation approaches in the IT and SCADA domains and their feasibility with the DoIP protocol, as being the central point of communication with the in-vehicle network from outside the vehicle.</p><p>In this presentation we present our approach on the analysis of the protocol, the scenarios we derived and the tools we used for evaluation. This also includes the applicability check of the diagnostic interface for forensic investigation as well as discussion to provide these forensic investigations for court relevant incidents.</p>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Kevin Gomez Buquerin is a master student for computer science at the technical University in Ingolstadt. Additionally to his studies and academic career, he is a junior incident responder at AUDI AG with a focus on malware analysis and general active defence techniques. Furthermore, he is in close cooperation with the vehicle security team at AUDI AG to establish robust security techniques for state-of-the-art and future vehicles.</p>"
	},

	{
		"id"		: "7",
		"type"		: "presentation",
		"name"		: "Erwin Paternotte",
		"role"		: "Lead Security Consultant",
		"work"		: "Nixu",
		"country"	: "Netherlands",
		"shortcode"	: "NL",
		"image" 	: "https://cs3sthlm.se/assets/speakers/erwin-paternotte.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"It WISN't Me: Attacking Industrial Wireless MEsh Networks (part II)",
			"partner":	"Mattijs van Ommeren",
			"role":		"Lead Consultant",
			"work":		"Nixu",
			"image":	"https://cs3sthlm.se/assets/speakers/mattijs-van-ommeren.png",
			"description": "<p>Wireless sensor networks are commonly thought of as IoT devices communicating using familiar short­range wireless protocols like Zigbee, MiWi, Thread and OpenWSN. A lesser known fact is that about a decade ago, two industrial wireless protocols (WirelessHART and ISA100.11a) have been designed for industrial applications, which are based on the common IEEE 802.15.4 RF standard. These Wireless Industrial Sensor Networks (WISN) are used in process field device networks to monitor temperature, pressure, levels, flow or vibrations. The petrochemical industry uses WISN in oil and gas fields and plants around the world.</p><p>Both IEC ratified standards have been commonly praised by the ICS industry for their security features, including strong encryption on multiple layers within the protocol stack, resistance to RF interference, and replay protection. While the standards in general look safe on paper, there are potential interesting attack vectors that require verification. However, security research so far has not yielded any significant results beyond basic attack vectors. Often these attacks have only been theorized, and not (publically) demonstrated. In addition, vendor implementations have not been thoroughly tested for security by independent third parties, due to protocol complexity and the lack of proper (hardware/software) tools. We strongly believe in Wright’s principle, “Security does not improve until practical tools for exploration of the attack surface are made available.”</p><p>This presentation will fill this gap by providing the necessary building blocks to perform more in depth security analysis of WISN, and provide tools to perform practical attacks against these wireless networks in order to verify resistance to real world attacks.</p><h4 id=\"type-of-presentation\">Type of presentation:</h4><p>Presentation, including demonstrations of the attacks</p><p>Aim of the presentation:</p><ul>  <li>No expensive equipment is required to sniff and interact with WISN technology allowing a larger group of security researchers to assess the security of these critical infrastructure components.</li>  <li>Asset owners should familiarize themselves with risks involved when using WISN technologies in industrial environments. The configuration of existing installations could be verified to further improve the security.</li>  <li>Asset owners are advised to be reluctant in applying WSN technology for control and functional safety applications, as this seems to be trending at the moment.</li></ul><p>Target audience: technical specialists and asset owners of OT environments</p>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Erwin works as a lead security consultant at Nixu Benelux. He has 15 years experience conducting penetration tests and security assessments on a wide variety of systems and technology. In the recent years his focus is shifting towards more advanced tests like red teaming, embedded systems, ICS/SCADA, and telco systems. Within Nixu he is also the practice lead for penetration and security testing.</p>"
	},

	{
		"id"		: "8",
		"type"		: "presentation",
		"name"		: "Mattijs van Ommeren",
		"role"		: "Lead Consultant",
		"work"		: "Nixu",
		"country"	: "Netherlands",
		"shortcode"	: "NL",
		"image" 	: "https://cs3sthlm.se/assets/speakers/mattijs-van-ommeren.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"It WISN't Me: Attacking Industrial Wireless MEsh Networks (part II)",
			"partner":	"Erwin Paternotte",
			"role":		"Lead Security Consultant",
			"work":		"Nixu",
			"image":	"https://cs3sthlm.se/assets/speakers/erwin-paternotte.png",
			"description": "<p>Wireless sensor networks are commonly thought of as IoT devices communicating using familiar short­range wireless protocols like Zigbee, MiWi, Thread and OpenWSN. A lesser known fact is that about a decade ago, two industrial wireless protocols (WirelessHART and ISA100.11a) have been designed for industrial applications, which are based on the common IEEE 802.15.4 RF standard. These Wireless Industrial Sensor Networks (WISN) are used in process field device networks to monitor temperature, pressure, levels, flow or vibrations. The petrochemical industry uses WISN in oil and gas fields and plants around the world.</p><p>Both IEC ratified standards have been commonly praised by the ICS industry for their security features, including strong encryption on multiple layers within the protocol stack, resistance to RF interference, and replay protection. While the standards in general look safe on paper, there are potential interesting attack vectors that require verification. However, security research so far has not yielded any significant results beyond basic attack vectors. Often these attacks have only been theorized, and not (publically) demonstrated. In addition, vendor implementations have not been thoroughly tested for security by independent third parties, due to protocol complexity and the lack of proper (hardware/software) tools. We strongly believe in Wright’s principle, “Security does not improve until practical tools for exploration of the attack surface are made available.”</p><p>This presentation will fill this gap by providing the necessary building blocks to perform more in depth security analysis of WISN, and provide tools to perform practical attacks against these wireless networks in order to verify resistance to real world attacks.</p><h4 id=\"type-of-presentation\">Type of presentation:</h4><p>Presentation, including demonstrations of the attacks</p><p>Aim of the presentation:</p><ul>  <li>No expensive equipment is required to sniff and interact with WISN technology allowing a larger group of security researchers to assess the security of these critical infrastructure components.</li>  <li>Asset owners should familiarize themselves with risks involved when using WISN technologies in industrial environments. The configuration of existing installations could be verified to further improve the security.</li>  <li>Asset owners are advised to be reluctant in applying WSN technology for control and functional safety applications, as this seems to be trending at the moment.</li></ul><p>Target audience: technical specialists and asset owners of OT environments</p>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Mattijs works as a lead consultant at Nixu Benelux. He has spent most of his career as an information security consultant, both on the offensive as well as the defensive side. Mattijs has a special interest in process automation and industrial systems. Over the years he has discovered numerous vulnerabilities in RTUs, process controllers, industrial firewalls and other equipment. Industrial sensor networks currently have most of his focus, as this is still mainly unexplored terrain.</p>"
	},

	{
		"id"		: "9",
		"type"		: "presentation",
		"name"		: "Khalid Ansari",
		"role"		: "Automation & MES Engineer",
		"work"		: "Qatar Aluminium Ltd",
		"country"	: "Qatar",
		"shortcode"	: "QA",
		"image" 	: "https://cs3sthlm.se/assets/speakers/khalid-ansari.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"Secure your MES the bridge between IT and OT",
			"partner":	"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/.png",
			"description": "<p>The presentation will be geared towards asset­owners, primarily from the manufacturing sector. However, other industries may also benefit. I intend to present how we, as an asset­owner, are approaching the challenge of securing our Manufacturing Execution Systems (MES). I will briefly discuss what an MES system is and why do most manufacturing industries need it.</p><p>An MES system bridges IT and OT networks ­­ it interfaces with ERP on the IT side and Automation layer (PLCs, etc.) on the OT side. And also interfaces with Laboratory and other systems at the same level. I will briefly go into the reasons why the MES needs to talk to both IT and OT. And how it is the air­gap myth­buster!</p><p>As an MES is exposed to the IT side, and hence indirectly to the Internet, it is critical we secure it. I will discuss how careful network segmentation will help in this cause.</p><p>OPC is a common protocol used by most MES systems for interfacing with various Automation systems. I will discuss our attempts at securing our legacy OPC­DA communication interfaces, and how we migrated to and are securing our current OPC­UA interfaces. Will go into security features afforded by the OPC­UA specification and how just moving to OPC­UA does not guarantee security.</p><p>In addition, I will present other security controls that may be deployed to increase security posture of a MES system.</p><p>Finally, I will end the presentation with the argument for absolute need for developing strong and verifiable disaster recovery plans (DR) and business continuity plans (BCP) for when MES goes down. And what would such a BCP typically comprise of.</p>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>I am an Automation and MES engineer with 20+ years’ of experience. I am fairly new to ICS Security, but it’s now my newfound passion. I have obtained GICSP certification and intend to write CISSP over the summer.</p>"
	},

	{
		"id"		: "10",
		"type"		: "presentation",
		"name"		: "Matan Dobrushin",
		"role"		: "Head of OT Research",
		"work"		: "Otorio",
		"country"	: "Israel",
		"shortcode"	: "IL",
		"image" 	: "https://cs3sthlm.se/assets/speakers/matan-dobrushin.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"Project RunAway",
			"partner":	"Yoav Flint Rosenfeld",
			"role":		"Head of OT Research",
			"work":		"Otorio",
			"image":	"https://cs3sthlm.se/assets/speakers/yoav-flint-rosenfeld.png",
			"description": "<p>Project files are the blueprints of the industrial process, these files can contain network configuration, screen definitions, hardware and software configurations and the actual automation logic of the controllers.</p><p>Access to the project file means access to knowledge on the most important and secret elements of the production floor.</p><p>Because of their sensitivity, these files should be kept in a well-secured manner like an internal vault, but due to the growing need to share and collaborate with suppliers it’s hard to keep track and the data might end up in the wrong hands.</p><p>In our research we have discovered a large amount of highly confidential industrial data located on the internet.</p><p>The data contains multiple manufactures, suppliers and orchestrators from different sectors and geographical locations. The amount and spread of the data and companies leads us to believe that this is not a one time event or incident but a systematic issue.</p><p>In the presentation we will:</p><ul>  <li>Explain the basic components and structures of some project files</li>  <li>We will explain how the research was performed.</li>  <li>Explain about the threat landscape connected to this data and explain about the inherent insecurity of the supply chain</li>  <li>We will showcase how an attacker might use this data to target a company and use the data from the files to successfully affect the operation of the process</li>  <li>We will showcase what can be derived out of the automation logic, both by noting past research works that have been done on this topic and by proposing new possibilities</li>  <li>We will share statistics about the amount of companies, sectors and geo locations of the affected companies</li>  <li>We will propose a few options for the potential sources of the leaks</li>  <li>We will discuss the different security methods a victim should apply</li></ul><h4 id=\"type-of-target-audience-\">Type of target audience –</h4><ul>  <li>Knowledge in automation &amp; risk management – advantage</li></ul><h4 id=\"audience-should-expect-\">Audience should expect –</h4><ul>  <li>Understanding a threat intelligence research process</li>  <li>Understanding of the threat involved with this kind of leakage</li>  <li>A clear rundown of potential attacks on OT environment</li></ul><h4 id=\"key-takeaways-\">Key takeaways –</h4><ol>  <li>Security guidelines for protecting critical OT data</li>  <li>Security guidelines for securing the supply chain process</li></ol>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Cyber security researcher with military leadership experience in cyber security unit.</p>"
	},

	{
		"id"		: "11",
		"type"		: "presentation",
		"name"		: "Yoav Flint Rosenfeld",
		"role"		: "Head of OT Research",
		"work"		: "Otorio",
		"country"	: "Israel",
		"shortcode"	: "IL",
		"image" 	: "https://cs3sthlm.se/assets/speakers/yoav-flint-rosenfeld.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"Project RunAway",
			"partner":	"Matan Dobrushin",
			"role":		"Head of OT Research",
			"work":		"Otorio",
			"image":	"https://cs3sthlm.se/assets/speakers/matan-dobrushin.png",
			"description": "<p>Project files are the blueprints of the industrial process, these files can contain network configuration, screen definitions, hardware and software configurations and the actual automation logic of the controllers.</p><p>Access to the project file means access to knowledge on the most important and secret elements of the production floor.</p><p>Because of their sensitivity, these files should be kept in a well-secured manner like an internal vault, but due to the growing need to share and collaborate with suppliers it’s hard to keep track and the data might end up in the wrong hands.</p><p>In our research we have discovered a large amount of highly confidential industrial data located on the internet.</p><p>The data contains multiple manufactures, suppliers and orchestrators from different sectors and geographical locations. The amount and spread of the data and companies leads us to believe that this is not a one time event or incident but a systematic issue.</p><p>In the presentation we will:</p><ul>  <li>Explain the basic components and structures of some project files</li>  <li>We will explain how the research was performed.</li>  <li>Explain about the threat landscape connected to this data and explain about the inherent insecurity of the supply chain</li>  <li>We will showcase how an attacker might use this data to target a company and use the data from the files to successfully affect the operation of the process</li>  <li>We will showcase what can be derived out of the automation logic, both by noting past research works that have been done on this topic and by proposing new possibilities</li>  <li>We will share statistics about the amount of companies, sectors and geo locations of the affected companies</li>  <li>We will propose a few options for the potential sources of the leaks</li>  <li>We will discuss the different security methods a victim should apply</li></ul><h4 id=\"type-of-target-audience-\">Type of target audience –</h4><ul>  <li>Knowledge in automation &amp; risk management – advantage</li></ul><h4 id=\"audience-should-expect-\">Audience should expect –</h4><ul>  <li>Understanding a threat intelligence research process</li>  <li>Understanding of the threat involved with this kind of leakage</li>  <li>A clear rundown of potential attacks on OT environment</li></ul><h4 id=\"key-takeaways-\">Key takeaways –</h4><ol>  <li>Security guidelines for protecting critical OT data</li>  <li>Security guidelines for securing the supply chain process</li></ol>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Over 20 years of experience in cyber security as a pen tester, security consultant, SOC manager and threat intelligence manager.</p>"
	},

	{
		"id"		: "12",
		"type"		: "presentation",
		"name"		: "Mona Lange",
		"role"		: "Cyber Defense Team Lead",
		"work"		: "Audi",
		"country"	: "Germany",
		"shortcode"	: "DE",
		"image" 	: "https://cs3sthlm.se/assets/speakers/mona-lange.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"Tales from Industrial Plants and Responders",
			"partner":	"Christian Augustat",
			"role":		"Principal Engineer",
			"work":		"Gassco",
			"image":	"https://cs3sthlm.se/assets/speakers/christian-augustat.png",
			"description": "<h4 id=\"network--security--and-vulnerability-monitoring-for-ics-a-demystification-from-an-asset-owners-perspective\">Network-, Security- and Vulnerability Monitoring for ICS: a demystification from an asset owner’s perspective.</h4><p>In this session Dr. Mona Lange (Audi) and Christian Augustat (Gassco) will take you on a conceptual tour through Industrial Control System (ICS) Security, both have a solid background in securing industrial plants in the manufacturing and Oil- and Gas industry. The session will provide you with insights into areas of Governance, Network Security Monitoring, Vulnerability Management and Continuous Security Monitoring, all from the perspective of an Asset-Owner.</p><p>In the area of Governance management we will dissect the pros and cons of IEC62443, ISO27001 and CIS as a foundation for an ICS security strategy, demonstrate how to prioritize security measures and render existing security risks transparent to management for security risk acceptance. Based on this security strategy, we will motivate the importance of asset management as a foundation for network security monitoring, describe how to build an MAC Address based Asset Inventory based on existing network components and integrate it into a Security Information and Event Management System (SIEM). Effective network security monitoring requires asset owners to understand what sources of infection or attack on ICS exist, how threat groups exploit them and how they can be monitored.</p><p>Generally, it is not feasible to defend against all threats everywhere, however we will demonstrate how baselining can be used to make an existing attack surface transparent and prioritize network security monitoring efforts in a threat aware manner. We will show how baselining can be used as a foundation for hardening Firewalls and deriving monitoring scenarios and integrating them into a SIEM. In addition, we will point out the difference between shopping security in comparison to building security. Vulnerability management means identifying vulnerabilities present in the environment, understanding their impact for an attack surface and finding possible mitigations as alternatives to patching.</p><p>We will show how the concept of ICS in a Virtual Machine can be used for live vulnerability scanning and provide some practical examples on how to rank the criticality of vulnerabilities. Main focus is to point out common problems from an asset owner’s perspective and point towards easy solutions based on our experience “from the trenches”.</p>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Mona is the Cyber Defense Team Lead at AUDI AG. Currently, she is working as peer group lead on creating a modern Cyber Defense team encompassing enterprise, ICS, and the connected car infrastructure. Prior to Audi she worked on a European research project developing decision support systems for detecting and managing attacks in critical infrastructures and organized a NATO Exploratory Team on the topic of Model-Driven Paradigms for Integrated Approaches to Cyber Defense. Mona holds a PhD in computer science and artificial intelligence from the University of Lübeck and a diploma with honors in computer science from Friedrich-Alexander University of Erlangen-Nürnberg.</p>"
	},

	{
		"id"		: "13",
		"type"		: "presentation",
		"name"		: "Christian Augustat",
		"role"		: "Principal Engineer",
		"work"		: "Gassco",
		"country"	: "Norway",
		"shortcode"	: "NO",
		"image" 	: "https://cs3sthlm.se/assets/speakers/christian-augustat.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"Tales from Industrial Plants and Responders",
			"partner":	"Mona Lange",
			"role":		"Cyber Defense Team Lead",
			"work":		"Audi",
			"image":	"https://cs3sthlm.se/assets/speakers/mona-lange.png",
			"description": "<h4 id=\"network--security--and-vulnerability-monitoring-for-ics-a-demystification-from-an-asset-owners-perspective\">Network-, Security- and Vulnerability Monitoring for ICS: a demystification from an asset owner’s perspective.</h4><p>In this session Dr. Mona Lange (Audi) and Christian Augustat (Gassco) will take you on a conceptual tour through Industrial Control System (ICS) Security, both have a solid background in securing industrial plants in the manufacturing and Oil- and Gas industry. The session will provide you with insights into areas of Governance, Network Security Monitoring, Vulnerability Management and Continuous Security Monitoring, all from the perspective of an Asset-Owner.</p><p>In the area of Governance management we will dissect the pros and cons of IEC62443, ISO27001 and CIS as a foundation for an ICS security strategy, demonstrate how to prioritize security measures and render existing security risks transparent to management for security risk acceptance. Based on this security strategy, we will motivate the importance of asset management as a foundation for network security monitoring, describe how to build an MAC Address based Asset Inventory based on existing network components and integrate it into a Security Information and Event Management System (SIEM). Effective network security monitoring requires asset owners to understand what sources of infection or attack on ICS exist, how threat groups exploit them and how they can be monitored.</p><p>Generally, it is not feasible to defend against all threats everywhere, however we will demonstrate how baselining can be used to make an existing attack surface transparent and prioritize network security monitoring efforts in a threat aware manner. We will show how baselining can be used as a foundation for hardening Firewalls and deriving monitoring scenarios and integrating them into a SIEM. In addition, we will point out the difference between shopping security in comparison to building security. Vulnerability management means identifying vulnerabilities present in the environment, understanding their impact for an attack surface and finding possible mitigations as alternatives to patching.</p><p>We will show how the concept of ICS in a Virtual Machine can be used for live vulnerability scanning and provide some practical examples on how to rank the criticality of vulnerabilities. Main focus is to point out common problems from an asset owner’s perspective and point towards easy solutions based on our experience “from the trenches”.</p>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Christian M. Augustat is a Principal Engineer within the Oil-&amp;Gas Industry in Norway with a Diploma in “Communication Informatics” awarded by the University of Applied Sciences in Emden, Germany. Since joining his company in 2007 he has been involved in industrial control systems, application development, systems administration, network administration, governance and information security. Christian is currently architecting ICS Security Projects in Europe and is leading a Security Team. Besides various certifications, he is currently holding the following SANS Certifications: GRID, GCCC, GNFA, GPEN.</p>"
	},

	{
		"id"		: "14",
		"type"		: "presentation",
		"name"		: "Prasanna N",
		"role"		: "R&D Engineer",
		"work"		: "ABB GISPL",
		"country"	: "India",
		"shortcode"	: "IN",
		"image" 	: "https://cs3sthlm.se/assets/speakers/prasanna-n.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"CVSS for ICS; Gauging a tennis game with number of goals",
			"partner":	"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/.png",
			"description": "<p>Patching known security vulnerabilities is one of the most essential task in any OT security program. Utilities having large number of patches to be applied in various cyber assets, use CVSS (Common Vulnerability Scoring System) metrics of the vulnerabilities to prioritize in applying patches. This prioritization however doesn’t serve well the purpose of patching at all times, particularly in OT industry; the reason being that CVSS has not been designed with OT security in mind. A low scored vulnerability that left unpatched can bring in high-risk to the OT environment. Environmental metrics have also similar challenges. Moreover, finding a single scoring system that fits every utility doesn’t seems to be realistic; at least in near future. Hence, there is clearly a need for a better approach to prioritize among various patches, that should take the cyber-physical impact on OT also into account.</p><p>This presentation illustrates a few examples of vulnerabilities and their respective CVSS score, in order to understand why these may fail to reveal the real impact to the ICS environment. Also, exhibits a possible better approach for prioritizing patch irrespective of the vendor provided score. For each asset in an OT ecosystem that has a specified functionality, the top priority would be to secure the functionality. For example, the functionality could be that a controller sending critical command to the field device or a HMI which displays the actual field data. This approach serves the purpose of securing the functionality of the OT system rather than focusing on confidentiality, integrity and availability.</p>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Prasanna is currently an R&amp;D Engineer in ABB India. In this role he facilitates the realization of cyber security controls and management functions for Grid Integration products and services by participating in the R&amp;D process. Prior to joining ABB, he has been working with Symantec as a Threat Analyst, holds a Bachelor of Information Technology and Master of Information Security and Cyber Forensics. In his seven years of experience with both IT and OT security, he had experience in Vulnerability Management, Vulnerability Assessment, Security Event Monitoring, Patch Management, Security Policy Analysis and Cyber Security Training.</p>"
	},

	{
		"id"		: "15",
		"type"		: "presentation",
		"name"		: "Reid Wightman",
		"role"		: "Senior Vulnerability Researcher",
		"work"		: "Dragos Inc.",
		"country"	: "United States",
		"shortcode"	: "US",
		"image" 	: "https://cs3sthlm.se/assets/speakers/reid-wightman.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"Broken Rungs: A look at popular ladder logic runtime privileges",
			"partner":	"Jimmy Wylie",
			"role":		"Senior Adversary Hunter",
			"work":		"Dragos Inc.",
			"image":	"https://cs3sthlm.se/assets/speakers/jimmy-wylie.png",
			"description": "<p>The TRISIS/TRITON/HatMan malware represents the first time that a rootkit was used against a programmable logic controller. In this talk, we will dive deep into several major PLC brands and ask the questions: Could TRISIS happen here? And if so, how easy or difficult would it be for an attacker to have the same effect?</p><p>The talk will detail the ladder logic programming and compilation systems from several vendors, and provide results of testing for ladder logic privileges and privilege escalation issues. This will include, where possible, reviewing the CPU used in each PLC, showing what security features the CPU has, and finally showing results of loading weaponized ladder logic into the PLC for execution. This will also cover in some limited depth the ladder logic transfer protocol used by each controller.</p><h4 id=\"target-audience-\">Target audience ­</h4><p>Technical researchers, low­level engineers for vendors, and low­level protocol analysis</p><h4 id=\"key-takeaways\">Key takeaways</h4><ul>  <li>For end users, they should walk away with questions to ask their vendors. For PLCs vendors, they should ask, ‘Is this type of attack in your threat model, and how are you dealing with it?’. For their security vendors, they should ask, ‘Are you able to carve logic updates and perform any level of analysis on them in your security system?’</li>  <li>For vendors, they key takeaway should be: This type of attack should be in your threat model.</li>  <li>For security researchers and vendors, the key takeaway should be: We should research tools to monitor and prevent malicious logic updates. This might require more research into static code analysis, and will likely require some cooperation from the vendors.</li></ul>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Reid is a Senior Vulnerability Researcher with Dragos’ Intel team. Reid analyzes publicly disclosed vulnerabilities and determines whether the public reporting is accurate, as well as uncovers just what the true industrial impact of a vulnerability can be. He also performs in-house research and vulnerability assessments on both industrial hardware and software. Reid assists with malware analysis, especially if it involves ICS exploitation. Prior to joining Dragos, Reid was a security consultant for the well-known security firms Digital Bond and IOActive. In both roles, he regularly researched and discovered novel vulnerabilities in hardware and software. He truly began his career in industrial security working for Schweitzer Engineering Labs, where he tested security of the company’s flagship digital protective relays and other grid-related products. For fun, Reid enjoys randonneuring, a form of self-supported long-distance cycling. He often rides 200 or more miles in a day. In the winter months, he can be found cross-country skiing.</p>"
	},

	{
		"id"		: "16",
		"type"		: "presentation",
		"name"		: "Jimmy Wylie",
		"role"		: "Senior Adversary Hunter",
		"work"		: "Dragos Inc.",
		"country"	: "United States",
		"shortcode"	: "US",
		"image" 	: "https://cs3sthlm.se/assets/speakers/jimmy-wylie.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"Broken Rungs: A look at popular ladder logic runtime privileges",
			"partner":	"Reid Wightman",
			"role":		"Senior Vulnerability Researcher",
			"work":		"Dragos Inc.",
			"image":	"https://cs3sthlm.se/assets/speakers/reid-wightman.png",
			"description": "<p>The TRISIS/TRITON/HatMan malware represents the first time that a rootkit was used against a programmable logic controller. In this talk, we will dive deep into several major PLC brands and ask the questions: Could TRISIS happen here? And if so, how easy or difficult would it be for an attacker to have the same effect?</p><p>The talk will detail the ladder logic programming and compilation systems from several vendors, and provide results of testing for ladder logic privileges and privilege escalation issues. This will include, where possible, reviewing the CPU used in each PLC, showing what security features the CPU has, and finally showing results of loading weaponized ladder logic into the PLC for execution. This will also cover in some limited depth the ladder logic transfer protocol used by each controller.</p><h4 id=\"target-audience-\">Target audience ­</h4><p>Technical researchers, low­level engineers for vendors, and low­level protocol analysis</p><h4 id=\"key-takeaways\">Key takeaways</h4><ul>  <li>For end users, they should walk away with questions to ask their vendors. For PLCs vendors, they should ask, ‘Is this type of attack in your threat model, and how are you dealing with it?’. For their security vendors, they should ask, ‘Are you able to carve logic updates and perform any level of analysis on them in your security system?’</li>  <li>For vendors, they key takeaway should be: This type of attack should be in your threat model.</li>  <li>For security researchers and vendors, the key takeaway should be: We should research tools to monitor and prevent malicious logic updates. This might require more research into static code analysis, and will likely require some cooperation from the vendors.</li></ul>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Jimmy Wylie is a Senior Adversary Hunter at Dragos who spends his days (and nights) searching for and analyzing threats to critical infrastructure. Born and raised in New Orleans, he studied Computer Science at the University of New Orleans, where he received his Bachelor’s in 2009 and his Master’s in 2012. During that time, he was introduced to reverse engineering in a university-level malware analysis class. The class went well, and he continued to tinker with it as a hobby. However, the thought of doing reverse engineering for a living only slightly surpassed his desire to sleep on a bed of nails.</p>"
	},

	{
		"id"		: "17",
		"type"		: "presentation",
		"name"		: "Stephen Hilt",
		"role"		: "Senior Threat Researcher",
		"work"		: "Trend Micro",
		"country"	: "United States",
		"shortcode"	: "US",
		"image" 	: "https://cs3sthlm.se/assets/speakers/stephen-hilt.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"How we reverse-engineered multiple industrial radio remote-control systems",
			"partner":	"Fredrico Maggi",
			"role":		"Senior Researcher",
			"work":		"Trend Micro",
			"image":	"https://cs3sthlm.se/assets/speakers/fredrico-maggi.png",
			"description": "<p>In 2018 we disclosed a total of 10 vulnerabilities to 7 independent industrial radio remote-control vendors. Our findings boil down to being able to control any equipment connected via these type of radio remote-control systems. So far, we focused our reports and speaking engagements on reaching out to as many people as possible, to increase awareness about the problem. At this time, we want to share stories about how we were able to perform the research and achieve the results with a globally dispersed team looking at global radio vendors.</p><p>This talk will focus on the “backstage” of this research, that is:</p><ul>  <li>how we started it and why we selected this class of systems</li>  <li>how we selected the vendors out from our extensive market search</li>  <li>how are these systems built, and how we figured this out</li>  <li>for two systems in details, we will describe    <ul>      <li>how to approach them from a reverse-engineering standpoint</li>      <li>how to interpret their RF protocol</li>      <li>what tools are needed for an in-depth reverse engineering</li>      <li>why we needed to come up with our own tools for certain corner cases (e.g., tricky modulation schemes)</li>    </ul>  </li>  <li>how the disclosure process went    <ul>      <li>what challenges we found along the way</li>      <li>what were the vendors’ responses (Vendors will not be called out for bad responses by name)</li>      <li>what is the status of the vulnerabilities now – lookout on future research trends in this space</li>    </ul>  </li></ul><p>While the project was a success the road to get there, was very bumpy due to things that all researchers face. We will also discuss how we overcame some of the obstacles, such as identifying the chips, micro soldering with non-professional equipment, reversing unreliable radio signals caught over the air.</p><h4 id=\"target-audience\">Target audience</h4><p>Technical, with the understanding of embedded systems and sub-GHz radio communication.</p>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>Stephen Hilt is a Sr. Threat Researcher at Trend Micro. Stephen focuses on General Security Research, Threat Actors, Malware behind attacks, and Industrial Control System Security. Stephen enjoys breaking things and putting them back together with a few extra parts to spare. Stephen is a world-renowned researcher, having spoken at Blackhat US, and RSA, HITB and many more. His research has gained him Dark Reading top hacks of the year twice. Working at Digital Bond Stephen became a Nmap Contributor where he wrote Nmap scripts for ICS and other mainstream protocols. This work took him into becoming an expert on ICS protocols and co-authored the book Hacking Exposed Industrial Control Systems: ICS and SCADA Security Secrets &amp; Solutions.</p>"
	},

	{
		"id"		: "18",
		"type"		: "presentation",
		"name"		: "Fredrico Maggi",
		"role"		: "Senior Researcher",
		"work"		: "Trend Micro",
		"country"	: "Italy",
		"shortcode"	: "IT",
		"image" 	: "https://cs3sthlm.se/assets/speakers/fredrico-maggi.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"How we reverse-engineered multiple industrial radio remote-control systems",
			"partner":	"Stephen Hilt",
			"role":		"Senior Threat Researcher",
			"work":		"Trend Micro",
			"image":	"https://cs3sthlm.se/assets/speakers/stephen-hilt.png",
			"description": "<p>In 2018 we disclosed a total of 10 vulnerabilities to 7 independent industrial radio remote-control vendors. Our findings boil down to being able to control any equipment connected via these type of radio remote-control systems. So far, we focused our reports and speaking engagements on reaching out to as many people as possible, to increase awareness about the problem. At this time, we want to share stories about how we were able to perform the research and achieve the results with a globally dispersed team looking at global radio vendors.</p><p>This talk will focus on the “backstage” of this research, that is:</p><ul>  <li>how we started it and why we selected this class of systems</li>  <li>how we selected the vendors out from our extensive market search</li>  <li>how are these systems built, and how we figured this out</li>  <li>for two systems in details, we will describe    <ul>      <li>how to approach them from a reverse-engineering standpoint</li>      <li>how to interpret their RF protocol</li>      <li>what tools are needed for an in-depth reverse engineering</li>      <li>why we needed to come up with our own tools for certain corner cases (e.g., tricky modulation schemes)</li>    </ul>  </li>  <li>how the disclosure process went    <ul>      <li>what challenges we found along the way</li>      <li>what were the vendors’ responses (Vendors will not be called out for bad responses by name)</li>      <li>what is the status of the vulnerabilities now – lookout on future research trends in this space</li>    </ul>  </li></ul><p>While the project was a success the road to get there, was very bumpy due to things that all researchers face. We will also discuss how we overcame some of the obstacles, such as identifying the chips, micro soldering with non-professional equipment, reversing unreliable radio signals caught over the air.</p><h4 id=\"target-audience\">Target audience</h4><p>Technical, with the understanding of embedded systems and sub-GHz radio communication.</p>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>With more than a decade of research experience in the cybersecurity field, Federico Maggi is specialized in doing threat and security analysis on virtually any system. Federico has analyzed web applications, network protocols and devices, embedded systems, radio- frequency control systems, industrial robots, cars, and mobile devices. Federico has experience on defensive technology and research, through building machine learning-based tools for intrusion and fraud detection. He’s applied data visualization techniques for analyzing botnets, and has gained basic malware analysis and reverse-engineering on Android-based platforms. Currently employed as a Senior Researcher with security giant Trend Micro (trendmicro.com), Federico was an Assistant Professor at Politecnico di Milano, one of the leading engineering technical universities in Italy. Aside his teaching activities, Federico co-directed the security group and has managed hundreds of graduate students. Federico has given several lectures and talks as an invited speaker at international venues and research schools, and also serves in the review or organizing committees of well-known conferences.</p>"
	},

	{
		"id"		: "26",
		"type"		: "presentation",
		"name"		: "Markus Mahrla",
		"role"		: "Security Consultant",
		"work"		: "GAI NetConsult GmbH",
		"country"	: "Germany",
		"shortcode"	: "DE",
		"image" 	: "https://cs3sthlm.se/assets/speakers/markus-mahrla.png",
		
		
		

		"presentation":{
		
			"active": 	"live",
			"title": 	"Fuzz Testing IEC 61850",
			"partner":	"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/.png",
			"description": "<p>During implementation of protocols in a communication stack usually only positive testing is performed to verify the conformance to the standard, especially for ICS protocols. Negative testing as part of the development process is often not applied. Therefore, it remains unknown how the stack or entire component is reacting on invalid, random or unexpected data. This talk will introduce robustness tests on IEC 61850, an ICS protocol that is used in digital substation communication. IEC 61850 is a modern and highly complex protocol stack and therefore provides a high attack surface.</p><p>The talk contains an introduction on IEC 61850 and describes the fuzzing approach together with details on how these tests are performed using a mutation-based fuzzer utilizing the XML based “Packet Description Markup Language” (PDML). It will also provide insights of difficulties encountered by performing those tests and how they have been circumvented. The audience will also learn what kind of attack vectors arise from those vulnerabilities.</p><p>As part of the talk, anonymized fuzzing results are presented from day-to-day ICS security audits as well as a live demonstration of the fuzzer is given.</p><p>This talk will provide in depth technical details and is primarily meant for security professionals in the area of industrial control systems and substation automation.</p>"
		
		},
		
		"training": {
			"active": "none",
			"title": "",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "",
			"excerpt":	""
		},
		

		"bio": "<p>More than 10 years of work experience in the IT security field with more than 7 years experience in performing ICS security audits mainly in the area of industrial automation and energy supply. Graduation at Humbold-University („German Diplom“) in Computer Sci- ence</p>"
	},

	{
		"id"		: "28",
		"type"		: "training",
		"name"		: "Jasper Hooft",
		"role"		: "ICS Security Consultant",
		"work"		: "Toreon",
		"country"	: "Belgium",
		"shortcode"	: "BE",
		"image" 	: "https://cs3sthlm.se/assets/speakers/jasper-hooft.png",
		"date" 		: "22 October",
		"time" 		: "09:00 - 17:00",
		"place" 	: "TBA",

		"presentation":{
		
			"active": 	"none",
			"title": 	"",
			"partner":	"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/.png",
			"description": ""
		
		},
		
		"training": {
			"active": "live",
			"title": "Hands-on Threat Modeling for ICS-OT",
			"partner": "",
			"name":		"",
			"role":		"",
			"work":		"",
			"image":	"https://cs3sthlm.se/assets/speakers/",
			"description": "<p>Organizations are now dedicating resources to protecting their Industrial control systems (ICS) assets, which include supervisory control and data acquisition (SCADA) programs, against intentional or accidental security threats. ICS security has plenty of challenges. Several of them owe their existence to the ongoing convergence of information technology (IT) and operational technology (OT). People and technology must work together to develop security controls that they can implement, build upon, enforce, modify and improve.</p><p>From experience we see that threat modeling as a discipline fits really well in ICS and OT environments, to design and secure connected systems in a way that is aligned with typical operational technology challenges.</p><p>In order to minimize that gap we have developed a 1 day course with practical Use Cases, based on real life projects. Each use case includes a description of the environment, together with questions and templates to build a threat model. Students will be challenged in groups of 3 to 4 people to perform the different stages of threat modeling on the following:</p><ul>  <li>Diagramming remote support applications, sharing the same REST backend</li>  <li>STRIDE analysis of an Internet of Things (IoT) deployment with an on premise gateway and a cloud based update service</li>  <li>Threat mitigations in a pharmaceutical manufacturing facility</li>  <li>Modeling attack trees against a nuclear facility</li></ul><p>After each hands-on workshop, the results are discussed, and students receive a documented solution. Based on our successful trainings in the last years, we released this advanced threat modeling training at Black Hat USA 2018. Some feedback from our Black Hat training attendees:</p><ul>  <li>“Toreon delivered! One of the best workshop instructor’s I’ve ever had.”</li>  <li>“Very nice training course, one of the best I ever attended.”</li>  <li>“I feel that this course is one of the most important courses to be taken by a security professional.”</li>  <li>“The group hands-on practical exercises truly helped.”</li></ul><h4 id=\"audience\">Audience:</h4><p>Staff involved in securing control systems, critical infrastructure, automation and smart-grid.</p><h4 id=\"audience-should-expect-for-the-training\">Audience should expect for the training:</h4><ul>  <li>A solid foundation to apply threat modeling in the field of ICS and OT</li>  <li>Hands-on exercises take up at least 50% of the training in interactive challenges covering real cases.</li></ul><h4 id=\"key-takeaway\">Key Takeaway:</h4><p>Structured method to do risk assessments in an ICS environment</p><h2 id=\"course-outline\">Course Outline</h2><h4 id=\"threat-modeling-introduction\">Threat modeling introduction</h4><ul>  <li>Threat modeling in ICS and OT</li>  <li>What is threat modeling?</li>  <li>Why perform threat modeling?</li>  <li>Threat modeling stages</li>  <li>Different threat modeling methodologies</li>  <li>Communicate a threat model</li></ul><h4 id=\"diagrams--what-are-you-building\">Diagrams – what are you building?</h4><ul>  <li>Understanding context</li>  <li>Doomsday scenarios</li>  <li>Data flow diagrams</li>  <li>Trust boundaries</li>  <li><strong>Hands-on: Diagram remote support applications, sharing the same REST backend</strong></li></ul><h4 id=\"identifying-threats--what-can-go-wrong\">Identifying threats – what can go wrong?</h4><ul>  <li>STRIDE introduction</li>  <li>Spoofing threats</li>  <li>Tampering threats</li>  <li>Repudiation threats</li>  <li>Information disclosure threats</li>  <li>Denial of service threats</li>  <li>Elevation of privilege threats</li>  <li>ICS and OT Attack libraries</li>  <li><strong>Hands-on: STRIDE analysis of an Internet of Things (IoT) deployment with an on premise gateway and a cloud based update service</strong></li></ul><h4 id=\"addressing-each-threat\">Addressing each threat</h4><ul>  <li>Mitigation patterns</li>  <li>Authentication: mitigating spoofing</li>  <li>Integrity: mitigating tampering</li>  <li>Non-repudiation: mitigating repudiation</li>  <li>Confidentiality: mitigating information disclosure</li>  <li>Availability: mitigating denial of service</li>  <li>Authorization: mitigating elevation of privilege</li>  <li>ICS and OT mitigations</li>  <li><strong>Hands-on: Threat mitigations in a pharmaceutical manufacturing facility</strong></li></ul><h4 id=\"ics-ot-threat-modeling\">ICS-OT threat modeling</h4><ul>  <li>Typical steps and variations</li>  <li>Validation threat models</li>  <li>Effective threat model workshops</li>  <li>Communicating threat models</li>  <li>Updating threat models</li>  <li><strong>Threat models examples: automotive, industrial control systems, IoT and Cloud</strong></li>  <li><strong>Hands-on: Modeling attack trees against a nuclear facility</strong></li></ul><h4 id=\"threat-modeling-resources\">Threat modeling resources</h4><ul>  <li>Open-Source tools</li>  <li>Commercial tools</li>  <li>Threat modeling resources</li></ul><h3 id=\"student-package\">Student package:</h3><p>The course students receive the following package as part of the course:</p><ul>  <li>Hand-outs of the presentations</li>  <li>Work sheets of the use cases,</li>  <li>Detailed solution descriptions of the use cases</li>  <li>Template to document a threat model</li>  <li>Template to calculate risk levels of identified threats</li>  <li>Receive certificate: Following a successful exam (passing grade defined at 70%) the student will receive certification for successful completion of course</li></ul><h3 id=\"threat-modeling--real-life-use-cases\">Threat Modeling – Real Life Use Cases</h3><p>As highly skilled professionals with years of experience under our belts we know that there is a gap between academic knowledge of threat modeling and the real world. In order to minimize that gap we have developed practical Use Cases, based on real life projects. Each use case includes a description of the environment, together with questions and templates to build a threat model. Using this methodology for the hands on workshops we provide our students with a robust training experience and the templates to incorporate threat modeling best practices in their daily work.</p><p>The students will be challenged to perform the threat modeling in groups of 3 to 4 people performing the different stages of threat modeling on:</p><ul>  <li>Diagramming remote support applications, sharing the same REST backend</li>  <li>STRIDE analysis of an Internet of Things (IoT) deployment with an on premise gateway and a cloud based update service</li>  <li>Threat mitigations in a pharmaceutical manufacturing facility</li>  <li>Modeling attack trees against a nuclear facility</li></ul><p>After each hands-on workshop, the results are discussed, and the students receive a documented solution.</p><p><em>The students should bring their own laptop or tablet to read and use the training handouts and exercise descriptions.</em></p>",
			"excerpt":	"Organizations are now dedicating resources to protecting their Industrial control systems (ICS) assets, which include supervisory control and data acquisition (SCADA) programs, against intentional ..."
		},
		

		"bio": "<p>For more than 8 years, I worked around the world as automation programmer and maintenance/commissioning engineer. During this period, I obtained in-depth experience in various ICS environments (PLC and DCS) in different sectors (petrochemical, food and feed and many others).</p><p>Now as a Toreon ICS Security Consultant I leverage this knowledge to provide advice on security architecture for clients in the utilities sector in Europe. At those clients, I help to improve the security maturity level of their organisations.</p><p>I achieve this by organising Threat Modeling sessions with our customers to identify the vulnerabilities in their ICS environment. I consider Threat Modeling to be the most fitting risk assessment methodology for Industrial environments. Its scenario-based approach makes it easy for people of different profiles to add value to the process.</p>"
	}

]
}