{"trainingList":[
	{
		"id": 				"1",
		"type": 			"training",
		"author":[
		
		{
			"name": 		"Erik Hjelmvik",
			"role": 		"Network Analyst",
			"work": 		"NETRESEC",
			"country": 		"Sweden",
			"shortcode":	"SE",
			"image": 		"https://cs3sthlm.se/assets/speakers/erik-hjelmvik.png",
			"bio": 			"<p>Erik is the creator of NetworkMiner and an experienced incident handler who has specialized in the field of network forensics.</p>"
		}
		
		],
		"training":
		
		{
			"subject": 		"Network Forensics Training",
			"date": 		"22-23 October",
			"time": 		"09:00 - 17:00",
			"place": 		"Nalen",
			"description":  "<p>Our two-day Network Forensics class consists of a mix of theory and hands-on labs, where students will learn to analyze Full Packet Capture (FPC) files. The scenarios in the labs are primarily focused at network forensics for incident response, but are also relevant for law enforcement/internal security etc. where the network traffic of a suspect or insider is being monitored.</p><h4 id=\"day-1---theory-and-practice-using-open-source-tools\">Day 1 - Theory and Practice using Open Source Tools</h4><ul>  <li>Theory: Ethernet signaling</li>  <li>Hardware: Network TAPs and Monitor ports / SPAN ports</li>  <li>Sniffers: Recommendations for high-performance packet interception</li>  <li>Analyze Modbus TCP traffic</li>  <li>Forensics of IEC 60870-5-104 network traffic</li>  <li>Investigate telnet sessions</li>  <li>PCAP analysis: Extracting evidence and indicators of compromise using open source tools</li>  <li>Defeating Big Data: Techniques for working with large data sets</li>  <li>Whitelists: Learn how to detect 0-day exploit attacks without using IDS signatures</li>  <li>Challenge Day 1: Find the needle in our haystack and win a honorable prize!</li></ul><h4 id=\"day-2---advanced-network-forensics-using-netresec-tools\">Day 2 - Advanced Network Forensics using Netresec Tools</h4><ul>  <li>NetworkMiner Professional: Learning to leverage the features available in the Pro version    <ul>      <li>Port Independent Protocol Identification (PIPI)</li>      <li>DNS Whitelisting</li>    </ul>  </li>  <li>NetworkMinerCLI: Automating content extraction with our command line tool</li>  <li>CapLoader: Searching, sorting and drilling through large PCAP data sets    <ul>      <li>Super fast flow transcript (aka Follow TCP/UDP stream)</li>      <li>Filter PCAP files and export frames to other tools</li>      <li>Keyword search</li>      <li>Create inventory of ICS devices from PCAP</li>    </ul>  </li>  <li>Challenge Day 2</li></ul><h4 id=\"the-scenario\">The Scenario</h4><p>The scenario used in the class involves a new progressive Bank, which provides exchange services for Bitcoin and Litecoin. We’ve set up clients and a server for this bank using REAL physical machines and a REAL internet connection. All traffic on the network is captured to PCAP files by a SecurityOnion sensor. In the scenario this bank gets into lots of trouble with hackers and malware, such as:</p><ul>  <li>Defacement of the Bank’s web server (see zone-h mirror)</li>  <li>Backdoor infection through trojanized software</li>  <li>Spear phishing</li>  <li>Use of a popular RAT (njRAT) to access the victims machine and exfiltrate the wallet.dat files for Bitcoin and Litecoin</li>  <li>Infection with real malware (Nemucod, Miuref / Boaxxe and more)</li></ul><p>Class attendees will learn to analyze captured network traffic from these events in order to:</p><ul>  <li>Investigate web server compromises and defacements</li>  <li>Identify covert backdoors</li>  <li>Reassemble incoming emails and attachments</li>  <li>Detect and decode RAT/backdoor traffic</li>  <li>Detect malicious traffic without having to rely on blacklists, AV or third-party detection services</li></ul><h4 id=\"professional-software-included-free-of-charge\">Professional software included FREE of charge</h4><p>Each attendee will be provided with a free personal single user license of NetworkMiner Professional and CapLoader. These licenses will be valid for six months from the first training day.</p><h3 id=\"target-audience\">Target Audience</h3><p>Q: Who should attend?</p><p>A: Anyone who want to improve their skills at finding evil stuff in full content packet captures.</p><p>Q: Who should NOT attend?</p><p>A: Those who are afraid of using Linux command line tools.</p><h3 id=\"training-preparations\">Training Preparations</h3><h4 id=\"laptop-required\">Laptop Required</h4><p>Attendees will need to bring a laptop that fits the following specs:</p><ul>  <li>A PC running any 64 bit Windows OS (can be a Virtual Machine)</li>  <li>At least 4GB RAM</li>  <li>At least 40 GB free disk space</li>  <li>VirtualBox (64 bit) installed (VMWare will not be supported in the training)</li></ul><p>A VirtualBox VM will be provided on USB flash drives at the beginning of the training.</p><p>Please note that having a 64-bit CPU and a 64-bit OS is not always enough to support 64-bit virtualization. You might need to enable features such as ”AMD-V”, ”VT-x” or ”Hyper-V” in BIOS in order to run virtual machines in 64-bit mode. You might also need to turn off “Intel Trusted Execution” in BIOS. One way to verify that your laptop supports 64-bit virtualization is to download the SecurityOnion ISO and see if it boots up in VirtualBox.</p>"
		}
		

	},

	{
		"id": 				"2",
		"type": 			"training",
		"author":[
		
		{
			"name": 		"Arnaud Soullié",
			"role": 		"Cybersecurity R&D Manager",
			"work": 		"pentesting-ics.com",
			"country": 		"France",
			"shortcode":	"FR",
			"image": 		"https://cs3sthlm.se/assets/speakers/arnaud-soullie.png",
			"bio": 			"<p>Arnaud Soullié (@arnaudsoullie) is the cybersecurity R&amp;D manager at Wavestone. For 8 years, he has been performing security audits and pentest on all type of targets. He specializes in Industrial Control Systems and Active Directory security. He has spoken at numerous security conferences on ICS topics : BlackHat Europe, BruCon, 4SICS, BSides Las Vegas, DEFCON…He also has an interest in hardware security, and is the designer of DYODE (Do Your Own Diode): an open-source, low-cost, ICS oriented data diode.</p>"
		}
		
		],
		"training":
		
		{
			"subject": 		"Pentesting Industrial Control Systems",
			"date": 		"22-23 October",
			"time": 		"09:00 - 17:00",
			"place": 		"Nalen",
			"description":  "<p>On this intense 2-days training, you will learn everything you need to start pentesting Industrial Control Networks. We will cover the basics to help you understand what are the most common ICS vulnerabilities.</p><p>We will then spend some time learning and exploiting Windows &amp; Active Directory weaknesses, as most ICS are controlled by Windows systems. We will cover the most common ICS protocols (Modbus, S7, Profinet, Ethernet/IP, DNP3, OPC…), analyze packet captures and learn how to use these protocols to talk to Programmable Logic Controllers (PLCs).</p><p>You will learn how to program a PLC, to better understand how to exploit them. The training will end with an afternoon dedicated to a challenging hands-on exercise: The first CTF in which you capture a real flag! Using your newly acquired skills, you will try to compromise a Windows Active Directory, pivot to an ICS setup to take control of a model train and robotic arms.</p><h4 id=\"the-detailed-outline-of-the-training-will-be-the-following\">The detailed outline of the training will be the following:</h4><ul>  <li>Introduction to ICS &amp; common vulnerabilities</li>  <li>Pentesting Basics &amp; tools [Hands-on]</li>  <li>Windows basics and pentesting Windows [Hands-on]</li>  <li>Focus on ICS protocols</li>  <li>Programming PLCs [Hands-on]</li>  <li>Pentesting ICS [Hands-on]</li>  <li>Capture The Flag [Hands-on]</li></ul><h3 id=\"detailed-content\">Detailed content</h3><h4 id=\"module-1-introduction-to-ics--common-vulnerabilities\">Module 1: Introduction to ICS &amp; common vulnerabilities</h4><p>For starters, I will introduce the concept of ICS.</p><p>The topics will include:</p><ul>  <li>Vocabulary</li>  <li>Classic architectures</li>  <li>ICS components (PLCs, HMI, SCADA, DCS, sensors, RTUs, Historian, etc) and their roles</li>  <li>OT vs IT</li></ul><p>I will also introduce attendees to the most common vulnerabilities in ICS, and describes some of the public attacks:</p><ul>  <li>Lack of network segmentation / Exposure</li>  <li>Lack of hardening - ICS protocols insecurity</li></ul><p><em>This module is not hands-on</em></p><h4 id=\"module-2-pentesting-basics--tools\">Module 2: Pentesting Basics &amp; tools</h4><p>This module will introduce the concept of penetration test.I do not intend to spend too much time of the theoretical stuff (how to makea report, etc etc) since that is not what attendees are looking for.</p><p>However, I think a module is required to ensure that everyone shares at least thebasic concepts of penetration testing, in order to understand the rest of the training.The module will include :</p><ul>  <li>OSINT for ICS : Where to look to find informations</li>  <li>Reconnaissance : how to portscan &amp; nessus</li>  <li>Exploitation : Metasploit basics</li></ul><p>Toolz used : nmap, Nessus, Metasploit</p><p>Lab setup : Windows Servers and workstations, Metasploitable, Kali Linux</p><h4 id=\"module-3-windows-basics-and-pentesting-windows\">Module 3: Windows basics and pentesting Windows</h4><p>Any ICS now includes, at least in some areas, Windows systems. So I think that some time must be spent on Windows basics.</p><p>This module will introduce the following topics:</p><ul>  <li>Windows Active Directory</li>  <li>How to find credentials on Windows systems</li>  <li>Exploiting and pivoting to gain Domain Admin privileges</li></ul><p>A selection of hacking techniques will be applied on lab machines.</p><h4 id=\"module-4-focus-on-ics-protocols\">Module 4: Focus on ICS protocols</h4><p>This module will introduce the most common ICS protocols: Modbus/TCP, S7, Profinet, DNP3, Ethernet/IP…. Attendees will analyze network captures and be introduced to software libraries/ clients to use these protocols to talk to PLC simulators.</p><p><em>This module is not hands-on</em></p><h4 id=\"module-5-programming-plcs\">Module 5: Programming PLCs</h4><p>In order to have a better understanding of how a PLC works, student will use dedicated software to program a PLC in ladder logic (using trial versions of TIA portal and/or soMachine basic).</p><p>Students will then deploy the code to real PLCs.</p><p>Toolz used : SoMachine Basic</p><p>Lab : Windows virtual machine</p><h4 id=\"module-6-pentesting-ics\">Module 6: Pentesting ICS</h4><p>This module will be mostly lab sessions, in order to apply the knowledge learned so far:</p><ul>  <li>Network capture analysis &amp; replaying packets</li>  <li>Talking industrial protocols: Modbus, S7</li>  <li>Additional PLC features: web server, ftp, snmp and how to exploit it</li></ul><p>Toolz used : nmap, Nessus, Metasploit</p><p>Lab : Windows Servers and workstations, Kali Linux, Siemens and Schneider PLCs</p><h4 id=\"module-7-capture-the-flag\">Module 7: Capture The Flag</h4><p>I strongly believe that a good training must include “real-life” examples and labs. I will dedicate the last half-day of the training to a Capture The Flag event. To do so, I will have a specific setup where attendees will be able to use their newly-acquired knowledge on a simulation of a “real-life” system. This will include compromise of Windows host, pivoting to the ICS, understanding the industrial process, and finally capturing a real flag with a robot hand!</p><p>This will be an expanded version of the CTF I usually organize during the ICS workshops at conferences.</p><h4 id=\"target-audience\">Target audience</h4><p>This training is aimed at OT professionals willing to understand what are the security issues within ICS, and howto technically assess the security level of an ICS. It will also be beneficial for IT security professionals wanting to understand the technical specificities of ICS.</p><h4 id=\"key-takeaways\">Key takeaways</h4><p>The attendees will learn what are the common ICS vulnerabilities, the tools and techniques to assess an ICS (both Windows systems and PLCs), and will practice these techniques during an hands-on Capture The Flag on real hardware.</p><h4 id=\"training-preparations\">Training Preparations</h4><p>Laptop Required</p><p>Attendees will need to bring a laptop that fits the following specs:</p><ul>  <li>A PC with VirtualBox capable of running virtual machines.</li>  <li>At least 4GB RAM</li>  <li>At least 40 GB free disk space</li>  <li>VirtualBox (64 bit) installed (VMWare could be used but will not be supported in the training)</li></ul><p>Several VirtualBox VMs will be provided on USB flash drives at the beginning of the training.</p><p>Please note that having a 64-bit CPU and a 64-bit OS is not always enough to support 64-bit virtualization. You might need to enable features such as ”AMD-V”, ”VT-x” or ”Hyper-V” in BIOS in order to run virtual machines in 64-bit mode.</p><p>Please try to run a 64-bit VM prior to the training.</p>"
		}
		

	}

]}